{
    "Location": "The Last City",
    "Planet": "Earth",
    "Landing Zone": "Tower Hangar",
    "Week": "October 27, 2023",
    "Exotics": {
        "Exotic Engram": {
            "name": "Exotic Engram",
            "type": "Exotic Engram",
            "description": "An engram with a predestined outcome.\n\nContains a new Exotic if any of the possible rewards remain to be collected. Preview contents for possible rewards.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "3875551374",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/ee21b5bc72f9e48366c9addff163a187.png",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Quest": {
            "name": "Xenology",
            "type": "Exotic Quest Step",
            "description": "Complete Vanguard playlist activities, or win matches in Crucible or Gambit.\n\nExtra progress is awarded for more challenging activities and for succeeding with clanmates.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "2125848607",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/7f9e6e79bb7a8ce59de9258a7d674af2.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Weapon": {
            "name": "The Prospector",
            "type": "Exotic Grenade Launcher",
            "description": "",
            "lore": "\"Some things should stay buried.\"",
            "ExtLore": "\"Get your axe and your pick and your shovel and your spine. We're goin' prospectin'.\" \n\"What?\" \n\"That. The quote. I don't get it.\" \n\"It's an old saying. It's about puttin' in a hard day's work.\" \n\"Seems… antiquated.\" \n\"How so?\"\n\"My grenade launcher's full auto and goes boom on command. What do I need hand tools for?\" \n\"It's a metaphor. It ain't literal. At least not anymore. Your launcher is your hand tool.\" \n\"Ahh. Got it. Good to know.\"",
            "itemHash": "3549153979",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/09e0e23b932b8b713549ce8d8f4c5f4d.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Excavation",
                    "description": "[Shoot]  : Hold to fire grenades. Release to detonate all live grenades simultaneously. Grenades stick to surfaces and set targets on fire. Defeating targets creates Arc explosions.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/2de42e7192359a2d5678d72c1d409f38.png",
                    "hashID": 2977709078,
                    "weaponHash": 3549153979,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Volatile Launch",
                    "description": "This weapon is optimized for an especially explosive payload.\n  •  Greatly increases blast radius\n  •  Slightly decreases handling speed\n  •  Slightly decreases projectile speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d255c9140cf640cfc820f995d1c1e96a.png",
                    "hashID": 1478423395,
                    "weaponHash": 3549153979,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Augmented Drum",
                    "description": "Heavy, high capacity drum.\n  •  Greatly increases magazine size\n  •  Greatly decreases reload speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/03a5a8b81c9fc5575a8a9bda79e0f8db.png",
                    "hashID": 1771897777,
                    "weaponHash": 3549153979,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Full Auto Trigger System",
                    "description": "Holding down the trigger will fire this weapon at full auto.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/85059dae97dea2121091a0f787e20985.png",
                    "hashID": 4267945040,
                    "weaponHash": 3549153979,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Hand-Laid Stock",
                    "description": "This weapon is optimized for recoil control.\n  •  Increases stability",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/11fe23229c61287c89916f094b26652f.png",
                    "hashID": 990298390,
                    "weaponHash": 3549153979,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Power",
            "legendWeaponDamageElement": "Arc",
            "masterworkData": null
        },
        "Hawkmoon": {
            "name": "Hawkmoon",
            "type": "Exotic Hand Cannon",
            "description": "",
            "lore": "Stalk thy prey and let loose thy talons upon the Darkness.",
            "ExtLore": "What is this feeling?\n\nI did not ask for it. I do not understand it. I do not want it.\n\nThe Crow is so carefree in his ignorance. The bonfire's glow lights up his pale features and I am drawn to the hope in his gold eyes. Where is the despairing child I anticipated?\n\nHe drinks from an open bottle of wine against the recommendation of his Ghost. The Guardian encourages him and they are laughing. This celebration is maddening; neither have reason to be so jubilant. Their world is ending and they thrash like dying creatures in the final light of collapsing stars. They do not seem to acknowledge the futility of their existence, the impermanence of it in the face of cosmic annihilation.\n\nNow the Guardian is drinking, standing close to the fire. Their Ghost, too, encourages them not to partake. They poison themselves for the enjoyment of it.\n\nI am reminded of my sisters. Of moments spent by lapping shores, gazing up at infinite stars full of possibilities and wonder. I am left yearning.\n\nWhat is this feeling?\n\nI do not understand it. I do not want it.\n\nThey are celebrating their victory over the Taken. The Crow is making a gun shape with his hand, swinging the nearly empty bottle of wine around in the other like a Sword. The Guardian looks pensive, sitting on a rock by the fire, contemplating the secret they are keeping. The Crow notices, but tries not to show it. He wants the Guardian's spirits to be lifted. He wants to be supportive, so that they may share in their triumphs together.\n\nAs equals.\n\nI am reminded of my home. I am reminded of the warmth of the sun and the embrace of my family. I am reminded of my father's face. I am reminded of everyone I betrayed. All the blood spilled in the name of immortality. The warmth of the sun burns me with its memory.\n\nWhat is this feeling?\n\nI do not want it.\n\nThe fire has nearly died. The Crow fell over and cannot stand, though he insists he is fine. The Guardian is turning the embers with the tip of their Sword. The Ghosts are talking to one another in quiet conspiracy. The celebration has ended, but I can sense their emotions are mixed: complex and myriad things, when a simple, singular focus would suffice.\n\nThere is a growing kinship here. Against better judgment.\n\nWhat is this feeling?",
            "itemHash": "3856705927",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/cef1290d58a2d94d1437e1e569fa7996.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Paracausal Shot",
                    "description": "Final blows and precision hits with Hawkmoon grant stacks of Paracausal Charge. The final round in the magazine deals bonus damage based on the number of stacks. Stowing Hawkmoon on the final round removes this bonus.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/243f5529bbd845871803181958599473.png",
                    "hashID": 213689231,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Extended Barrel",
                    "description": "Weighty barrel extension.\n  •  Increases range\n  •  Decreases handling speed\n  •  Moderately controls recoil",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9e5e8fa07a84c29252b78b0e7b3106d.png",
                    "hashID": 1467527085,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Alloy Magazine",
                    "description": "Faster reloads when the magazine is empty.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/069170916c98748b7b3e33b80bd7d689.png",
                    "hashID": 1431678320,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Quickdraw",
                    "description": "This weapon can be drawn unbelievably fast.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/6893bb2c7ec7d13cb0d91ec9dd8b6500.png",
                    "hashID": 706527188,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Combat Grip",
                    "description": "This weapon's recoil direction is more vertical.\n  •  Greatly controls recoil",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/02a60561b11d9abee82741981af12a3f.png",
                    "hashID": 3438534621,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Kinetic",
            "legendWeaponDamageElement": "Kinetic",
            "masterworkData": null
        },
        "Warlock Exotic": {
            "name": "Winter's Guile",
            "type": "Exotic Gauntlets",
            "description": "",
            "lore": "\"I know you.\" —Lord Felwinter",
            "ExtLore": "\"Listen to me very carefully. They're coming for you. They'll ask you for a name. Your name is Felwinter.'\" \n\"I don't think that's my name.\" \n\"I know. Say it anyway.\" \n\"Why can't I remember my name? I always remember my name. Something's wrong. Was I damaged in Crypt processing?\" \n\"I don't know anything about the Deep Stone Crypt. Before my time.\" \n\"What the hell are you?\" \n\"You don't trust me.\" \n\"No.\" \n\"You will.\" \n\"You're a very presumptuous little drone. What makes you think that?\" \n\"No one else will help you. It's kill or die out there.\"",
            "itemHash": "3844826443",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/0c586f183b821e16dd9b696c8e871d2b.jpg",
            "rarity": "Exotic",
            "class": 2,
            "statRolls": [
                65,
                2,
                28,
                4,
                6,
                2,
                23
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Warlord's Sigil",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/afb8bae64742a8633975b1bc85c98923.png",
                    "desc": "Defeating targets with melee attacks increases your melee damage. Targets encased by Penumbral Blast automatically shatter."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Hunter Exotic": {
            "name": "Young Ahamkara's Spine",
            "type": "Exotic Gauntlets",
            "description": "",
            "lore": "Give me your arm, oh bearer mine. Let me help you fill the world with teeth.",
            "ExtLore": "Bones! Let's wear some bones! \n\nOh, it's a taste many Guardians develop. I think because they feel a wee bit spectral. All this transmatting leaves one saying \"Am I still here? Am I flesh or am I mist?\" So, you strap some old bones to your arm, bones that've been unbreakable for an eon, and you feel solid again. More yourself. \n\nBearers of a particular species of bone do claim—and mind that I'm not recommending these bones—that the fossils grant them unusual powers. Nothing too wild. A little more of this and that. \n\nMy own research suggests these special bones come from a species of draconic post-Traveler neolife called 'ahamkara'. They apparently talked—loved the phrase 'o seeker mine'—and troubled us enough to be hunted to extinction. If you wanted some more of these bones for your friends, I might know a source…",
            "itemHash": "475652357",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/e8ebba4e0fbbaf71de4bd188f072fe67.jpg",
            "rarity": "Exotic",
            "class": 1,
            "statRolls": [
                67,
                14,
                3,
                18,
                12,
                2,
                18
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Wish-Dragon Teeth",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/28aa0f30e0e57d914bf5f12345c631f0.png",
                    "desc": "WISH-DRAGON TEETH\nIncreased Tripmine Grenade duration and blast radius. Gain Tripmine Grenade energy from ability final blows."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Titan Exotic": {
            "name": "Peacekeepers",
            "type": "Exotic Leg Armor",
            "description": "",
            "lore": "Designed for the seamless delivery of justice in an unjust world.",
            "ExtLore": "Peacekeepers once patrolled the City before the Red Legion's attack. They were Guardians, but their interest was in protecting our core, our home. Most understood the value in exploration, but the peacekeepers were old guard, born in the aftermath of the Iron Lords. They lived through the Faction Wars; bore witness to what damage internal strife could bring to a fragile society. They vowed to keep the factions in check and stood at the gates as our walls expanded and our city became a home. \n\nNow, nothing remains of the order. Yet their legacy delivers a harsh truth: the Last Safe City was never truly safe.",
            "itemHash": "3539357319",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/98491ae0d08dc78211ff10f34e42c923.jpg",
            "rarity": "Exotic",
            "class": 0,
            "statRolls": [
                67,
                3,
                3,
                28,
                11,
                10,
                12
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Mecha Holster",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/fc5f93fd49cdea67bf72d139c5a2c227.png",
                    "desc": "Reloads stowed Submachine Guns and allows you to ready them instantly. Improves your handling with Submachine Guns and your movement while wielding one. Provides a moderate benefit to the airborne effectiveness stat of Submachine Guns."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        }
    },
    "Legendaries": {
        "Legendary weapons": [
            {
                "name": "Firefright",
                "type": "Legendary Auto Rifle",
                "description": "",
                "lore": "What's the scariest part of a firefight? The whole damn thing.",
                "ExtLore": "Siegfried's feet touch down on a metal grate ten fathoms deep into the Leviathan, where snaking tunnels split into many different directions. The room is large, empty, and dark. He cycles through the night vision and thermal imaging on his helm, then looks up to his fireteam.\n\nHe can see the shimmering Eliksni camouflage distort the shapes of his seven teammates as they descend the shaft above him on a carbon-weave line. He disables his own. In front of him sits the base of a robotic construct in the likeness of Calus. It is twice his height, and the bare mechanisms of its internal workings creak with age.\n\nFour Cabal Legionaries, two Eliksni Splicers, and a Praxic Sunsinger drop in behind Siegfried and deactivate their cloaks. The Splicers get to work establishing a connection with the automaton while the Legionaries make a perimeter at their back. Siegfried stands with them.\n\nThe Warlock does not take their eyes from the automaton.\n\n\"Splice… formed.\" One of the Eliksni turns to the Warlock and nods. The Warlock steps forward—\n\n\"Thieves skulking through my Leviathan!\" The automaton bellows with Calus's voice and forcibly bats away a Splicer with a metallic hand. They crash into the adjacent wall and crumple into unconsciousness. The second Splicer leaps back and takes cover behind a Legionary as the Praxic Warlock unleashes a volley of celestial fire into the construct's face. In response, a steely fist bursts through the fire-smoke and crushes the Warlock into the floor.\n\nSiegfried turns toward the Legionaries and shouts, \"Contact!\"\n\nThe Cabal open up with slug rifles; munitions clang against the thick metal. The remaining Splicer aims for the construct's exposed machinery with their Arc pistol.\n\nSiegfried rushes forward, sliding to meet the automaton head on. He ignites in Solar flame and shoulder charges the construct into the chamber wall. He rolls under a retaliating fist and grabs the automaton's chassis, wrestling to spin its back to his fireteam.\n\nThe Sunsinger gasps, alive again. They grab the unconscious Eliksni and take a position amid the Legionaries, shouting, \"CONCENTRATE FIRE!\"\n\nWith one swift motion, the Praxic Warlock combusts brilliantly with Solar Radiance that emboldens the firing line of Cabal shooters and fills the Splicer's heart with courage. Heated slugs puncture and the Arc pistol finds its mark, shorting out one of the automaton's exposed knees.\n\nSlug rifles shred the construct's face as it crashes to the ground and frenetically crawls toward them, tearing metal from the floor with each scraping motion.\n\nThe Titan raises a hand, and in a burst of fiery might, summons a Devastator's maul. He brings the maul down into the automaton's back, demolishing it and sending molten shrapnel skidding across the floor.\n\nSiegfried looks to the Sunsinger, then the rest of the fireteam. \"Contact down… let's keep going.\"",
                "itemHash": "2778013407",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/78de754b509d75fb24b1e3671f59fe10.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Arrowhead Brake",
                        "description": "Lightly vented barrel.\n  •  Greatly controls recoil\n  •  Increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8f7fb54687aa52a9c2595d90ce9c9417.png",
                        "hashID": 839105230,
                        "weaponHash": 2778013407,
                        "isPerk": true,
                        "isFavorablePerk": true
                    },
                    {
                        "name": "High-Caliber Rounds",
                        "description": "Shots from this weapon knock the target back farther.\n  •  Slightly increases range",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/9d1c49edb2d2b24c74067742c09fd5a5.png",
                        "hashID": 1561002382,
                        "weaponHash": 2778013407,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Fragile Focus",
                        "description": "This weapon gains bonus range until your shield is destroyed. The bonus returns once your shield has regenerated to full strength.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/3d2e945cc3d38e88c87ee3e2687b612a.png",
                        "hashID": 2451262963,
                        "weaponHash": 2778013407,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Focused Fury",
                        "description": "Dealing half of the magazine as precision damage grants this weapon bonus damage. The shot count is reset whenever the weapon is reloaded or stowed.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/15fb47018719c99ae37d10f794bc957e.png",
                        "hashID": 2896038713,
                        "weaponHash": 2778013407,
                        "isPerk": true,
                        "isFavorablePerk": true
                    },
                    {
                        "name": "Extrovert",
                        "description": "Final blows while near multiple combatants or near Nightmares restores health.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0e8f9374f41cca37c52fce1695184e18.png",
                        "hashID": 1250481499,
                        "weaponHash": 2778013407,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Precision Frame",
                    "description": "This weapon's recoil pattern is more predictably vertical.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e9dd736124e8ef94048901a279a5bb18.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Kinetic",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            },
            {
                "name": "Seventh Seraph SAW",
                "type": "Legendary Machine Gun",
                "description": "",
                "lore": "Chained away long ago; its jaws too eager in times of peace.",
                "ExtLore": null,
                "itemHash": "2582755344",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/29093fbaa9a7a03baa3936a359f85113.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Extended Barrel",
                        "description": "Weighty barrel extension.\n  •  Increases range\n  •  Decreases handling speed\n  •  Moderately controls recoil",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9e5e8fa07a84c29252b78b0e7b3106d.png",
                        "hashID": 1467527085,
                        "weaponHash": 2582755344,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Extended Mag",
                        "description": "This weapon has a greatly increased magazine size, but reloads much slower.\n  •  Greatly increases magazine size\n  •  Greatly decreases reload speed\n  •  Increases airborne effectiveness",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/66cfea124e24e73cca1ce6370b44ca7e.png",
                        "hashID": 2420895100,
                        "weaponHash": 2582755344,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Field Prep",
                        "description": "Increased ammo reserves. Faster reload, stow, and ready when you're crouching.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/4ee1ecaead6fe2de1a2cab07f8b7be3f.png",
                        "hashID": 2869569095,
                        "weaponHash": 2582755344,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Elemental Capacitor",
                        "description": "Increased stats based on the currently equipped subclass.\n• [Solar] increases your reload speed.\n• [Arc] increases handling.\n• [Void] increases stability.\n• [Stasis] moderately controls recoil and increases movement speed when aiming down sights.\n• [Strand] increases airborne effectiveness.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/e455d94dcafdab7a0d5a850712908020.png",
                        "hashID": 3511092054,
                        "weaponHash": 2582755344,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "High-Impact Frame",
                    "description": "Slow firing and high damage. This weapon is more accurate when stationary, moving slowly, and aiming down sights.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/34573143849cf910d2381554bb57a10d.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Reload Speed",
                    "description": "The time it takes to reload this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e3a74e6dd4c520ea17eb1fdaf2128213.jpg",
                    "mwHash": 4283235143
                }
            },
            {
                "name": "Disparity",
                "type": "Legendary Pulse Rifle",
                "description": "",
                "lore": "\"Identify yourself, or be destroyed.\" —Clovis Bray I",
                "ExtLore": "Cadmus Ridge rests within the grip of a storm. Wind-whipped frazil ice scours the exposed superstructure of bygone ambition. Steel crumbles, slowly, to the howling blind; sleet swarms like locusts pecking rust on skeletal decay. A patient war. Inevitable, like entropy.\n\nThe storm halts as if detecting a predator on the wind—quiet settles in the moment. A cloaked Vandal stands, and the silhouette of their camouflage breaks against the stillness. \n\nA cloudburst splits the sky, turning the storm and sleet to a surge of needling rain that perforates the Vandal. Soulfire rifts tear open to expel three gargantuan Hive Tomb Ships. They slowly drift into formation, unthreatened, positioning themselves above Riis-Reborn.\n\nFrom their hulls spew runes of black fire that meet between the ships and ignite into the projection of a bladed terrace, casting House Salvation's new home in shadow. \n\nIt is as night. The distant light of the Sun is choked from the sky.\n\nA voice booms like thunder. \n\nHEAR THE DIN OF RAPTURE. WELCOME ME IN YOUR ARMS. CELEBRATE MY ARRIVAL, AND KNOW ME AGAIN. FOR THIS WORLD HAS ALWAYS BEEN MINE.\n\nDeep within Bray Exoscience Creation, Clovis Bray I rouses from infernal calculous; a maintenance coordination AI has signaled an emergency.\n\n\"What is it?\" Clovis demands.\n\nA monotone version of his own voice responds. \"Unknown craft have entered Europan airspace. How shall I respond?\"\n\n\"Broadcast my voice… and arm the perimeter,\" Clovis orders.\n\n\"Affirmative. Ready upon speaking,\" the AI informs.\n\n\"Alien vessel, this is Clovis Bray. Identify yourself or be destroyed.\"\n\nThe thunder, distant, though no quieter, responds…\n\n\"I AM WAR.\"",
                "itemHash": "1751893422",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/61412a4ba7ca62db0dce0fbc98b7038c.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Arrowhead Brake",
                        "description": "Lightly vented barrel.\n  •  Greatly controls recoil\n  •  Increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8f7fb54687aa52a9c2595d90ce9c9417.png",
                        "hashID": 839105230,
                        "weaponHash": 1751893422,
                        "isPerk": true,
                        "isFavorablePerk": true
                    },
                    {
                        "name": "Accurized Rounds",
                        "description": "This weapon can fire longer distances.\n  •  Increases range",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d85024478504205359c7fb52dbc4f6b6.png",
                        "hashID": 3142289711,
                        "weaponHash": 1751893422,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Heating Up",
                        "description": "Final blows with this weapon increase accuracy and stability while improving vertical recoil.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/39d2032b3c5bc7a5b2fe391c64ccb7db.png",
                        "hashID": 1570042021,
                        "weaponHash": 1751893422,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "One for All",
                        "description": "Hitting three separate targets increases damage for a moderate duration.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/b1bce269c3cd21393131b4f5cffae692.png",
                        "hashID": 4049631843,
                        "weaponHash": 1751893422,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Ambush",
                        "description": "Improves range, handling, and damage against combatants during the opening moments of an engagement.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/a727dccb4a2b0c94bf4eadb8abd5ae95.png",
                        "hashID": 192157151,
                        "weaponHash": 1751893422,
                        "isPerk": true,
                        "isFavorablePerk": true
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Aggressive Burst",
                    "description": "Hard-hitting four-burst fire.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/64209c4fd20513b33109c374179d0958.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Stasis",
                "masterworkData": {
                    "name": "Handling",
                    "description": "The speed with which the weapon can be readied and aimed.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/d2e1ab2542f585d025fb4cc1a3885164.jpg",
                    "mwHash": 518224747
                }
            },
            {
                "name": "Bump in the Night",
                "type": "Legendary Rocket Launcher",
                "description": "",
                "lore": "\"If you hear a noise in the dark, shoot first.\" —Centurion Tuk'rin",
                "ExtLore": "\"I won't go again,\" Gorn'ak says, throwing a chunk of bloody meat to a lounging war beast. It happily devours the meat in one bite and looks expectantly for more. Gorn'ak is seated at a bulky metal table with two fellow Cabal. One is a veteran Phalanx, Ur'Rux, whom Gorn'ak respects deeply. The other is Tal'urn, a scrawny Red Legion defector who had surfaced during a patrol on Nessus last year.\n\n\"Is it true our ancestors appeared on the Leviathan?\" Ur'Rux asks.\n\n\"I have seen their red smoke in many shapes—of a Human, of a Cabal Gladiator, and more,\" Gorn'ak says. \"They carry the voices of traitors, luring Cabal so they may stick knives between our armor. They called me deeper into the ship, but I know they mean to take our names. Spoil our memories.\"\n\n\"Did Gorn lose his musk?\" cracks Tal'urn.\n\nGorn'ak roars at the scrawny Legionary, \"Call me coward again, whelp!\"\n\n\"Tal'urn can call no Cabal a coward. Not when we found him in a hole under Halphas Electus,\" Ur'Rux spits and turns to Gorn'ak. \"Stand with me, and we will survive Calus's horrors.\"\n\nThe door to their barracks chamber opens.\n\n\"You don't understand, Tal. I won't go back. Orders or not.\" Gorn'ak looks him in the eyes. \"You shouldn't go either.\"\n\nA hulking Cabal known as Tuk'rin, with winged armor ornaments steps into the room and removes their helmet. \"The empress won't like that,\" Tuk'rin growls, slamming a Bronto Cannon down on the bulky metal table between Gorn'ak and the others.\n\n\"Tuk'rin? Who died and made you Centurion?\" Gorn'ak asks, shoving the Bronto Cannon aside to cut more meat for his war beast.\n\n\"One last deployment.\"\n\nTuk'rin sees the curiosity building in his new soldiers.\n\n\"My commander went ahead of our squad, scouted the Underbelly. She did not return as… herself.\" Tuk'rin's eyes are lost for a moment in the sights he has seen. \"She was a noble Cabal, but the spirits attacked her mind that night, and she turned this cannon on us.\"\n\nHis soldiers silently contemplate his claim.\n\nTuk'rin continues, \"It was my kill, so now it's my command. If I go back, you go back.\"",
                "itemHash": "1959650777",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/ccc08251c285bb980b1470e384707ef6.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Volatile Launch",
                        "description": "This weapon is optimized for an especially explosive payload.\n  •  Greatly increases blast radius\n  •  Slightly decreases handling speed\n  •  Slightly decreases projectile speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d255c9140cf640cfc820f995d1c1e96a.png",
                        "hashID": 1478423395,
                        "weaponHash": 1959650777,
                        "isPerk": true,
                        "isFavorablePerk": true
                    },
                    {
                        "name": "High-Velocity Rounds",
                        "description": "This weapon's projectiles are particularly light and quick.\n  •  Increases projectile speed\n  •  Increases reload speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/2a2b757cd73305126990cd19ad011a2c.png",
                        "hashID": 2822142346,
                        "weaponHash": 1959650777,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Demolitionist",
                        "description": "Kills with this weapon generate grenade energy. Activating your grenade ability reloads this weapon from reserves.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/da009697110e06b65d6f827b3b6d5f70.png",
                        "hashID": 3523296417,
                        "weaponHash": 1959650777,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Frenzy",
                        "description": "Being in combat for an extended time increases damage, handling, and reload for this weapon until you are out of combat.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/23e06f4ced1b3e6476f342978ff5bb37.png",
                        "hashID": 4104185692,
                        "weaponHash": 1959650777,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Extrovert",
                        "description": "Final blows while near multiple combatants or near Nightmares restores health.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0e8f9374f41cca37c52fce1695184e18.png",
                        "hashID": 1250481499,
                        "weaponHash": 1959650777,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Aggressive Frame",
                    "description": "High damage, high recoil.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/64209c4fd20513b33109c374179d0958.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Stasis",
                "masterworkData": {
                    "name": "Blast Radius",
                    "description": "Increases the explosion radius of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/cb114512a0710cab990fb8d5b4af91c6.jpg",
                    "mwHash": 3928770367
                }
            },
            {
                "name": "Sojourner's Tale",
                "type": "Legendary Shotgun",
                "description": "",
                "lore": "Home is just over the horizon.",
                "ExtLore": "The pipes are silent.  \n\nEther production is paused during batch loading, and in that interstitial time, Spider's lair feels like a tomb. Every creak and groan of his throne becomes excruciatingly pronounced. Spider reclines against one arm, rolling a dead Ghost's shell in one hand, scraping a clawed finger across its gray, lifeless eye. The arrival of a trusted associate pulls Spider from his thoughts. \n\n\"Avrok,\" Spider bellows, turning his attention to the armored Eliksni striding through the doorway, \"what did you find?\" \n\nAvrok approaches Spider's throne, wringing his hands together anxiously. \"Our thief, my lord.\" \n\nSpider leans forward with a groan of the cables suspending his throne. \"And what did you do to them?\" he asks in greedy anticipation. That, however, is where Avrok falters. \n\n\"I did not… catch them, my lord,\" Avrok humbly answers, his much smaller frame eclipsed in Spider's shadow. \"But I have a name.\" \n\n\"Out with it,\" Spider grouses, falling back against his throne with deflated interest. \n\n\"The Crow.\" \n\nSpider's blood turns to fire. His grip tightens on that dead Ghost so hard its shell cracks. Spider continues squeezing it until the glass eye completely pops. \n\nThen he takes a moment to compose himself. \n\n\"Our little bird, come home to the nest so soon? Tell me everything.\" \n\n\"He was able to infiltrate the storehouse,\" Avrok explains, \"and coerced a team of laborers to offload cargo promised to the empress onto a Skiff, which he then… stole. Along with a cache of your more—ah—personal belongings, among which was the quantum opal.\" \n\n Avrok shrinks lower, lower, lower. \"The supplies were delivered to Mithrax. In your name. As a gift.\" \n\n\"And the workers?\" Spider growls. \n\n\"They are gone?\" Avrok doesn't mean to make it sound like a question, and regrets taking the tone immediately. \n\n\"To where, exactly?\" \n\n\"They…\" Avrok takes a small step back from Spider's throne. \"Left.\" He clenches his jaws. \"With the Crow.\" \n\nSpider slowly leans forward again. \n\n\"For Earth,\" Avrok concludes. \n\nThe Ether pipes begin to hum and rattle as a new batch begins production elsewhere in the complex. The noises rise in intensity, turning into the familiar hissing wail that joins with the uncomfortable sound of Spider. Laughing. \n\nThe Baron of the Shore throws his dead Ghost at Avrok who ducks away from it, covering his head with his hands. \n\n\"He's taking them to Mithrax,\" Spider says between fitful chuckles and wheezing coughs. \"He steals—from me—and gives it to the House of Light? Unbelievable.\" Though behind the laughter and coughs, there is a hint of appreciation in his tone. \"The kid's grown a spine.\" \n\n\"There is,\" Avrok starts, offering Spider a folded piece of paper, \"one more thing. He left this behind.\" Spider's seal is scribbled on one side. \"For you.\" \n\nAs Spider unfolds the note, Avrok creeps further away from the throne. Inside is nothing more than a crude drawing and a rude missive. \n\n \"That little sh— \"\n\nThe pipes are howling.",
                "itemHash": "599895591",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/7d4dd4ca8f6336b7400746f0ad017351.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Extended Barrel",
                        "description": "Weighty barrel extension.\n  •  Increases range\n  •  Decreases handling speed\n  •  Moderately controls recoil",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9e5e8fa07a84c29252b78b0e7b3106d.png",
                        "hashID": 1467527085,
                        "weaponHash": 599895591,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Appended Mag",
                        "description": "This weapon's magazine is built for higher capacity.\n  •  Increases magazine size",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9f468cce26fe35d9db413e2f8451127.png",
                        "hashID": 1087426260,
                        "weaponHash": 599895591,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Threat Detector",
                        "description": "Increased reload, stability, and handling when enemies are in close proximity.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/9611bdbc48aff898193fd5f705c7cf30.png",
                        "hashID": 4071163871,
                        "weaponHash": 599895591,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Killing Wind",
                        "description": "Final blows grant increased mobility, weapon range, and handling for a short duration.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/db2aa71ff6d808929bb0e668dcf0822e.png",
                        "hashID": 2450788523,
                        "weaponHash": 599895591,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Pinpoint Slug Frame",
                    "description": "Fires a single-slug round. This weapon's recoil pattern is more predictably vertical.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e9dd736124e8ef94048901a279a5bb18.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Reload Speed",
                    "description": "The time it takes to reload this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e3a74e6dd4c520ea17eb1fdaf2128213.jpg",
                    "mwHash": 4283235143
                }
            },
            {
                "name": "Seventh Seraph SI-2",
                "type": "Legendary Sidearm",
                "description": "",
                "lore": "Kept in holster as the last line. Known for its reliability.",
                "ExtLore": null,
                "itemHash": "3937866388",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/71ad178e3d2087197b59f97a25af8de8.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Extended Barrel",
                        "description": "Weighty barrel extension.\n  •  Increases range\n  •  Decreases handling speed\n  •  Moderately controls recoil",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9e5e8fa07a84c29252b78b0e7b3106d.png",
                        "hashID": 1467527085,
                        "weaponHash": 3937866388,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Extended Mag",
                        "description": "This weapon has a greatly increased magazine size, but reloads much slower.\n  •  Greatly increases magazine size\n  •  Greatly decreases reload speed\n  •  Increases airborne effectiveness",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/66cfea124e24e73cca1ce6370b44ca7e.png",
                        "hashID": 2420895100,
                        "weaponHash": 3937866388,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Field Prep",
                        "description": "Increased ammo reserves. Faster reload, stow, and ready when you're crouching.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/4ee1ecaead6fe2de1a2cab07f8b7be3f.png",
                        "hashID": 2869569095,
                        "weaponHash": 3937866388,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Dragonfly",
                        "description": "Precision kills create an elemental damage explosion.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/c87b03bb6d56b393f8582e128b337332.png",
                        "hashID": 2848615171,
                        "weaponHash": 3937866388,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Lightweight Frame",
                    "description": "Superb handling. Move faster with this weapon equipped.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/6db8cd21c2b3e6fffeb6f111d6c70dd2.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Void",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            },
            {
                "name": "Outlast",
                "type": "Legendary Pulse Rifle",
                "description": "",
                "lore": "No such word as extinction.",
                "ExtLore": null,
                "itemHash": "1678205741",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/e5f126d88e6a20c2106fbee02777a6df.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Arrowhead Brake",
                        "description": "Lightly vented barrel.\n  •  Greatly controls recoil\n  •  Increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8f7fb54687aa52a9c2595d90ce9c9417.png",
                        "hashID": 839105230,
                        "weaponHash": 1678205741,
                        "isPerk": true,
                        "isFavorablePerk": true
                    },
                    {
                        "name": "Ricochet Rounds",
                        "description": "Rounds ricochet off hard surfaces. \n  •  Increases stability \n  •  Slightly increases range",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0a494d0442b32aff8c30d8b2b53561bd.png",
                        "hashID": 1885400500,
                        "weaponHash": 1678205741,
                        "isPerk": true,
                        "isFavorablePerk": true
                    },
                    {
                        "name": "Outlaw",
                        "description": "Precision kills greatly decrease reload time.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/382df469a091c33e190ee583b64923e8.png",
                        "hashID": 1168162263,
                        "weaponHash": 1678205741,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Snapshot Sights",
                        "description": "Faster time to aim down sights.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/ce16c9e2cbd73bb548af3e15bdfc7177.png",
                        "hashID": 957782887,
                        "weaponHash": 1678205741,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Disaster Plan",
                        "description": "Picking up ammunition increases this weapon's flinch resistance and range, which lasts until it is fired again.\n\nSwords gain a large increase to charge rate instead.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/32fd1da58165d07b35d320e2bd6f0de5.png",
                        "hashID": 1004814308,
                        "weaponHash": 1678205741,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Rapid-Fire Frame",
                    "description": "Deeper ammo reserves. Slightly faster reload when magazine is empty.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/801d62d1f9783bee81d5700c54c24fda.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            }
        ],
        "Warlock": {
            "Helmet": {
                "name": "Opulent Scholar Hood",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"I have foreseen the victories that your wisdom shall win in my name. Over and over.\" —Emperor Calus",
                "ExtLore": "MCXXVI, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth recommend to the Emperor Calus a new Shadow of the Hive.\n\nThe Shadow of Earth came to the Emperor and said: \"Your laughing majesty, you have said that the Hive would cast a weak Shadow, and you were, as in all things, correct. But what if I told you that there is one who could cast a Hive-like shadow, with all its attendant majesty, but who is not herself Hive and therefore free of their tragic hunger?\"\n\nThe Emperor said, \"Show me this person, and I will lavish upon her all the gifts of the Shadows.\"\n\nSo the Shadow of Earth sought out Eris Morn, a Human with Acolyte eyes and the majesty of a Hive Queen in her calcified heart, and said: \"Eris Morn, True Queen of the Hive, I know one who can reteach you how to feel joy.\"\n\nEris Morn said, \"What are you saying? I am no Queen of the Hive. My sworn purpose is to defeat the Hive and the progenitors which spawned them.\"\n\nThe Shadow said, \"But what of your Acolyte eyes?\"\n\nAnd Eris Morn said, \"In my darkest hours I had no choice but to avail myself of my enemy's tools.\"\n\nThe Shadow said, \"So you are neither Hive Queen nor Hive God?\"\n\nEris Morn said, \"Neither am I.\"\n\nAnd the Shadow said, \"But could you be?\"\n\nAnd Eris Morn said, \"Yea, could I.\"^\n\n\n\n^ Note to Underscribe Shipal: While the broad arc and shape of time's arrow is known only to our revelatory majesty, and our humble duty merely to add texture to its form, I do enjoin upon you to make more effort than you are showing here. The characterization seems suspect and the dialogue is grossly wanting. Delete this footnote upon the rectification of this error. +\n\n+ Note from Scribe Savat: I see no reason for Scribe Shagac's harshness. I have closely studied the texts of the Sol System and of the Hive, and in my halls of learning Eris Morn's villainy is widely accepted. Therefore I deem this prediction's accuracy to be unimpeachable.",
                "itemHash": "164194947",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/a3b2fbc6933915736ed76f94b2d25482.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    64,
                    2,
                    12,
                    20,
                    2,
                    14,
                    14
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Opulent Scholar Gloves",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"I have foreseen the work that will bring this system together. I'll need your wisdom.\" —Emperor Calus",
                "ExtLore": "MCXIX, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth recommend to the Emperor Calus a Shadow of the Exo.\n\nThe Shadow of Earth went to the Emperor and said, \"My good and bountiful pater, I am your Shadow of Earth, and my companion Petra Venj is the Shadow of the Awoken. Yet the Awoken trace their distant origins to Earth.\"\n\nThe Emperor said, \"My good Shadow, you are right,\" and he cut down Petra Venj where she stood.\n\nThen the Shadow said: \"My luxuriant majesty, I meant to increase your Shadows, not decrease them. For as the Awoken hail from Earth but are their own people, so are the ones called the Exo. I wished to nominate to you a Shadow of the Exo.\"\n\nThe Emperor said, \"Ah, now I understand you.\"\n\nThe Shadow said: \"The one I nominate is called Failsafe-0.^ She is a malicious and humorless being, despised by all. She would make a worthy Shadow of the Exo.\"\n\nSaid the Emperor: \"Thus will it be done.\"\n\n\n\n^ Note to Underscribe Shipal: My own independent research into the Sol System leads me to believe, with weighty certainty, that the ones called Exodus Black and Failsafe are, in fact, the same being. Thus, your supplementals contradict each other. Delete this footnote upon the rectification of this error.",
                "itemHash": "1301733714",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/a40c9fddce9533c838f3370c79b8332f.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    64,
                    2,
                    28,
                    2,
                    10,
                    20,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Opulent Scholar Robes",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"I have foreseen what must fall so the Empire may rise. Your mastery of knowledge apocryphal shall make true Cabal of us all.\" —Emperor Calus",
                "ExtLore": "MCXIV, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the sentience known as Exodus Black.\n\nAmong the insurgents of the impudent Sol System there was one called Exodus Black, who was the first in the Sol System to be born into the digital aether. Because she spoke well and was beloved by all, Exodus Black was a hero among the insurgents. So the Shadow of Earth knew what must be done.\n\nUsing the knowledge gathered in the Athenaeum, the Shadow ripped Exodus Black from her starship body and, rending her consciousness in half, placed each piece in an Exo body.\n\nWhen the two came online, Exodus and Black turned quickly upon each other, and each perished by her other half's hand.",
                "itemHash": "3981949974",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/d95bfb7440bac4ba3eb895ea1e08aec2.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    65,
                    12,
                    18,
                    2,
                    7,
                    12,
                    14
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Opulent Scholar Boots",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"I have foreseen the apex of your heuristic potential. Should you wish it, this system shall collapse from the ideas you've made into weapons. And make way for what's coming. O champion mine.\" —Emperor Calus",
                "ExtLore": "MCXXVII, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the Rogue Lightbearer known to some as Dredgen Hope.\n\nWith the help of Brighus, the Emperor's personal chef, the Shadow of Earth prepared a splendid feast, and then went to the rogue and said, \"Brother, come with me.\"\n\nHow marvelously they dined, upon soft-fleshed brackenclams and salty fruitmeats! The Shadow partook with the stamina of a great Cabal primus, but the rogue ate even better, so well that even the generous Emperor, watching through his Shadow's eyes, was impressed.\n\nFinally, the last course was served: a flaky pastry the size of a human's fist. The rogue bit into it, and winced at the crunch, for the pastry was filled with metal and paint and the taste of vanilla.\n\nThe rogue ate it all.\n\nThen, wiping his lips, the rogue asked what was in the pastry. And the Shadow told him: \"Your Ghost.\"\n\nAnd before he could respond, the Shadow leapt up and, seizing more food and drink, forced it upon the rogue called Dredgen Hope in such generous quantities that the rogue could not endure his own gratitude. Thus was the rogue's hunger sated.",
                "itemHash": "1702972140",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/da139676047b7c662fe8cd2bfe9b7020.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    65,
                    12,
                    2,
                    18,
                    17,
                    14,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Opulent Scholar Bond",
                "type": "Legendary Warlock Bond",
                "description": "",
                "lore": "\"I have foreseen the end of all things. The novenary, the Awoken Queen, the sad, strange little man on his rickety boat. They believe they've seen the same. What they don't know will destroy them.\" —Emperor Calus",
                "ExtLore": "MCXXIX, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay Cayde-7.\n\nThen a visitor approached the throne of the Joyous Emperor and proffered himself before the Generous Host. He was Cayde-7, whose origins are recounted in MCXXXVII. ^\n\nCayde-7 knelt at the Emperor's feet, and kissed his boots, saying: \"Your truest servant is here.\"\n\nAnd the Emperor was pleased, for he thought that this one would make a very fine Shadow.\n\nBut the true Shadow of Earth, jealous of the Emperor's love, cut down Cayde-7 where he stood in the Emperor's throne room, and then dealt with his ruins in such a way as to ensure that there would never be a Cayde-8.\n\nThe Emperor was pleased, and that night there was a great feast aboard the Leviathan.\n\n\n\n^ A note to Underscribe Shipal: Entry MCXXXVII appears to be missing. Please reattach it to this account, and delete this footnote upon rectifying this error.",
                "itemHash": "3311577151",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/e189f0456c32a48af29b647a0e3f7616.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Hunter": {
            "Helmet": {
                "name": "Opulent Stalker Mask",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"I have foreseen the victories that your cunning shall win in my name. Over and over.\" —Emperor Calus",
                "ExtLore": "MCXX-I, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the Warlock Vanguard Ikora Rey.\n\nAs recorded by the enshrined Scribe Shagac, the Vanguard of Earth requested mercy, and their request was denied. Thus the Warlock Ikora was permitted a final day to consider her perfidy before her death.\n\nTo this generosity Ikora Rey said, \"I do not need a day. Let us end this now.\"\n\nAnd she unleashed from her fingertips a Nova Bomb of such proportions that it shook Mars to its foundations and made the stars weep for envy. And the Shadow answered her with the strength of a god-killer.\n\nAlight with the power of a hollow god, Ikora Rey let loose such torrents of Arc and Solar and the most majestic Void that the sands of Mars turned to glass and shattered. And the Shadow matched her blow for blow. No greater battle has ever been enshrined in the Emperor's Glorious accounts, and none ever will be again, for at the last of it, Mars's orbit was forever altered, and the mighty Ikora Rey was no more.",
                "itemHash": "1440812312",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/0cf1497f34949c4669e0daf035905bd8.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    66,
                    10,
                    22,
                    2,
                    2,
                    7,
                    23
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Opulent Stalker Grips",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"I have foreseen the work that will bring this system together. I'll need your cunning.\" —Emperor Calus",
                "ExtLore": "MCXXI, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the shipwright Amanda Holliday.\n\nThere was among Earth's people a pilot to rival Jarrus the Ace-Defiant. Her name was Amanda Holliday, and when the Emperor saw her fly, he was pleased; when he saw her destroy his pleasure-vessel, he was thrilled; when he saw her shoot down the Shadow of Earth, he exulted.\n\nAnd so, when the Shadow of Earth recovered from death, the Emperor said, \"Bring me the Ace-Resistant.\"\n\nSo the Shadow landed upon Earth and sought Amanda Holliday on foot, for even an Ace must return to land sometimes. The Shadow found her camp, and approached her, and put up no defense when the Ace-Resistant drew an Auto Rifle. The Ace-Resistant killed the Shadow many times, until she had no ammo left, and then the Shadow beseeched her, for the sake of their friendship, to speak as they once did.\n\nThe Shadow held out a hand, and Amanda Holliday, the Ace-Resistant, took it in her own.\n\nThen the Shadow slew her, and brought her body to the Emperor saying, \"I have brought you the Ace-Resistant.\"\n\nAnd the Emperor laughed, for his Shadow was a clever and a covetous soul.",
                "itemHash": "1904615913",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/5848db2334725312db7130f6a45f4d06.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    65,
                    15,
                    16,
                    2,
                    10,
                    20,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Opulent Stalker Vest",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"I have foreseen what must fall so the Empire may rise. Your mastery of silent slaughter shall make true Cabal of us all.\" —Emperor Calus",
                "ExtLore": "MCXIII, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the Warlock Osiris.\n\nThere was a Guardian named Osiris who defied the Shadow of Earth, saying: \"If you are really the mightiest that Earth has to offer, then I challenge you in a battle of wits.\"\n\nThen Osiris disappeared into the Infinite Forest, scattering his Reflections about him so as to mask himself.\n\nBut the Shadow of Earth went to the First Vex, and said to it: \"My love for you is as rational as the ratio of a circle's circumference to its diameter.\"\n\nThe Vex, faced with an impossible problem, promptly perished, and with it, all Vex and all their workings crumbled into empty chassis and chalky cubes.\n\nThus Osiris, deprived of his Reflections, was exposed, and the Shadow of Earth slew him easily.",
                "itemHash": "3258844783",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/29ea40caf9ac7112b41f42fad6cf1d52.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    63,
                    15,
                    7,
                    10,
                    2,
                    6,
                    23
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Opulent Stalker Strides",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"I have foreseen the apex of your slaying potential. Should you wish it, this system shall die—from the inside—and make way for what's coming. O champion mine.\" —Emperor Calus",
                "ExtLore": "MCXXII, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the master of ceremonies.\n\nAfter the Vanguard's passing, the Earth was in lamentation, and their sorrows fell upon their Shadow's ears. The Shadow of Earth went to the Emperor and said, \"When the Earth grieves, its Shadow grieves.\"\n\nThe Emperor said, \"Your generous heart overflows. Go, take my joy to your people.\"\n\nSo the Shadow went to Earth, to the master of ceremonies, and said, \"Eva Levante, the days of the Dawning and Crimson Days, of Revelry and Festival of the Lost are over. From now on, it is your jubilant task to fete his Grandiose Majesty, the Father of Satisfaction.\"\n\nBut Eva Levante refused, for she had no kindness or generosity in her heart. So the Shadow of Earth slew her and appointed Lord Shaxx the new master of ceremonies. And Lord Shaxx feted the emperor with a serene and gentle joy.",
                "itemHash": "2196557755",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/7c4e02f03b0549bdbafe93369f4ec87c.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    64,
                    10,
                    15,
                    7,
                    6,
                    12,
                    14
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Opulent Stalker Cloak",
                "type": "Legendary Hunter Cloak",
                "description": "",
                "lore": "\"I have foreseen the end of all things. The novenary, the Awoken Queen, the sad, strange little man on his rickety boat. They believe they've seen the same. What they don't know shall destroy them.\" —Emperor Calus",
                "ExtLore": "MCXX-II, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the Titan Vanguard Zavala.\n\nAs recorded by the enshrined Scribe Shagac, the Vanguard of Earth requested mercy, and their request was denied. Thus the Titan Zavala was permitted a final day to consider his perfidy before his death.\n\nSo the Titan Zavala went to the Human known as Suraya Hawthorne and said, \"Suraya Hawthorne, will you play a game of checkers with me?\"\n\nSuraya Hawthorne agreed, and so the two played twenty-seven games of checkers, and listened to the music of bagpipes and synthesizers, and dined upon Earth delicacies such as nuggets of chicken and the beer of roots.\n\n \"Titan Zavala,\" said Suraya Hawthorne as Earth's sun rose upon their latitude, \"There will never again be a checkersmaster of your like.\"\n\n\"No, Suraya,\" said Titan Zavala. \"You must become a greater checkersmaster than even me, if you are to lead the resistance.\"\n\nThus the Titan Vanguard did not meet his final death alone. And Suraya Hawthorne was slain at a later date.\n\n\n\n^ Note to Underscribe Shipal: Very good. This is entirely credible.",
                "itemHash": "211036158",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/d49894a907102e485b6bdca528d02a0f.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Titan": {
            "Helmet": {
                "name": "Opulent Duelist Helm",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"I have foreseen the victories that your strength shall win in my name. Over and over.\" —Emperor Calus",
                "ExtLore": "MCXVIII, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay Variks, the Betrayer.\n\nAfter the much-mourned death of Mithrax, Shadow of the Eliksni, there was one who sought to inherit this exalted title. He was Variks, the Judgment Kell, who was never where his allies wanted him to be.\n\nThe Emperor was displeased, and said, \"From each species of being there can be only one Shadow. That is my decree. To do otherwise would be to drink bitter juice, and I drink only what pleases me.\"\n\nThen, at a nod from the Emperor, the Shadow of Earth cut down Variks the Judgment Kell. The Eliksni people called this the Second Scatter, but this name was short-lived, for so were they.",
                "itemHash": "2450046452",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/10e148da14a27a3dde99681819a0951c.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    64,
                    2,
                    12,
                    18,
                    15,
                    10,
                    7
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Opulent Duelist Gauntlets",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"I have foreseen the work that will bring this system together. I'll need your strength.\" —Emperor Calus",
                "ExtLore": "MCXV, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay Toland, the Shattered.\n\nEmperor Calus tasked his Shadows with this command above all others: to safeguard the Emperor's right to be the Last Being at the End. One being threatened that above all, one who was pinned against the quiddity of death and exchanged one definition for another. This being the Shadows named Toland.\n\nSo the Shadows of Earth and the Awoken and the Hive entered the Deep Places and recovered an essence of the Deathsinger Ir Yût. From her, they learned the Deathsong. By then manipulating the mind Quria, now bound to the Shadow of the Hive, they reversed the Deathsong, and sang Toland back to life.\n\nNow alive, Toland was once more weak against the powers of death, and he died in the mind and in the body. ^\n\nThus the Emperor's right was ensured.\n\n\n\n^A note to Underscribe Shipal: Please reverify your Hive sources. This account is riddled with paradoxes so extreme as to prompt hilarity, and such a mood, while beloved to our Joyous Leader, is inappropriate in a chronicle of this significance.",
                "itemHash": "1322451469",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/2be62a84444e9f0d0caa19ae9b987cef.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    62,
                    12,
                    18,
                    2,
                    6,
                    18,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Opulent Duelist Plate",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"I have foreseen what must fall so the Empire may rise. Your mastery of war shall make true Cabal of us all.\" —Emperor Calus",
                "ExtLore": "MCXXVIII, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the betrayer Uldren Sov.\n\nThen the Shadow of Earth went to the Emperor and said: \"My wise and mirthful host, those toward whom you pointed me, I have slain. Now I crave your permission and your blessing to point myself toward one in whose death I would take great delight.\"\n\nThe generous Emperor, pleased to no end with his bright Shadow of Shadows, said: \"Say no more. It is granted.\"\n\nGiving great and proper thanks, the Shadow of Earth went away and found the Guardian whose name was once Uldren Sov. The Shadow of Earth slew him, but spared his hateful little companion-soul so that the well of pleasure that was Uldren's death should never run dry.\n\nSo many times did the Shadow of Earth slay the one called Uldren Sov that no chronicler could ever record the exact number. At last, when the Shadow's appetite was whetted, Uldren Sov met his final death.",
                "itemHash": "2821102771",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/d03111c9a454610ca43141e2dc29d72f.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    63,
                    10,
                    18,
                    2,
                    14,
                    17,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Opulent Duelist Greaves",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"I have foreseen the apex of your fighting potential. Should you wish it, this system shall fall and make way for what's coming. O champion mine.\" —Emperor Calus",
                "ExtLore": "MCXLII-I, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay their companion-soul.\n\nAnd then the end was nigh, and the Shadow of Earth, thinking upon the Emperor's most indefatigable desire, knew that his Joyous Majesty wished to partake in the greatest share of the apocalypse's pleasures, and that the only way to ensure that was for the Shadow of Earth to take the honor of the second-greatest share.\n\nTo that end, the Shadow of Earth extended a hand, and into it flew the Shadow's companion-soul, who had spoken not a word for many ages.\n\nThe Shadow bade the companion-soul to speak, and the companion-soul obliged:\n\n\"I love you.\"\n\nWith that, the Shadow's fist closed, and the companion-soul was no more.\n\nAnd then there were two.",
                "itemHash": "1993250511",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/2cca743c4fed3092fbd3a39a8d5babd5.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    67,
                    7,
                    14,
                    12,
                    2,
                    22,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Opulent Duelist Mark",
                "type": "Legendary Titan Mark",
                "description": "",
                "lore": "\"I have foreseen the end of all things. The novenary, the Awoken Queen, the sad, strange little man on his rickety boat. They believe they've seen the same. What they don't know will destroy them.\" —Emperor Calus",
                "ExtLore": "MCXLII-II, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Emperor of All Joys tenderly slay his beloved Shadow of Earth.\n\nAnd in the End of All Things, there remained only Emperor Calus and the Shadow of Earth in the Eye of the Storm that was Nothing. The neutrinos left in the hourphase could be counted upon one Human hand.\n\nThen the Shadow of Earth knelt before the Emperor, and with great courage and loving dignity said to the Emperor: \"My good and generous host, what you have longed for has come to pass. Do me the honor of letting me grant your last and truest wish.\"\n\nWith tears in his eyes, Emperor Calus spoke the last words that a living being will ever say to another living being: \"This I grant you.\" +\n\nAnd our merciful emperor slew his Shadow of Shadows, the Young Wolf, the Slayer of Oryx, the Shadow of Earth.\n\nThuswise did the Emperor reserve the right to be the last. And when the end came, he met it with the body of the Shadow in his arms, his belly rumbling with joyous laughter.\n\n+ As there will be no scribe employed at this future date, the last Scribe shall consult with Emperor Calus as to our sovereign's planned remarks. Delete this footnote as close to the actualization of this history as possible.",
                "itemHash": "731561450",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/8a72ec3b1a34282a2faa0680231e7564.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        }
    }
}