{
    "Location": "European Dead Zone",
    "Planet": "Earth",
    "Landing Zone": "Winding Cove",
    "Week": "November 24, 2023",
    "Exotics": {
        "Exotic Engram": {
            "name": "Exotic Engram",
            "type": "Exotic Engram",
            "description": "An engram with a predestined outcome.\n\nContains a new Exotic if any of the possible rewards remain to be collected. Preview contents for possible rewards.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "3875551374",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/ee21b5bc72f9e48366c9addff163a187.png",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Quest": {
            "name": "Xenology",
            "type": "Exotic Quest Step",
            "description": "Complete Vanguard playlist activities, or win matches in Crucible or Gambit.\n\nExtra progress is awarded for more challenging activities and for succeeding with clanmates.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "2125848607",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/7f9e6e79bb7a8ce59de9258a7d674af2.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Weapon": {
            "name": "Tractor Cannon",
            "type": "Exotic Shotgun",
            "description": "",
            "lore": "Property of Ishtar Collective. WARNING: Gravity propulsor beam can cause serious injury or even death.",
            "ExtLore": "Chioma Esi met Maya in their undergraduate gym. They got into an argument about deadlifting: was it necessary, was it practical, why was Chioma making so much noise? Maya Sundaresh just couldn't stand the notion that some things were done for their own sake, not because they had any use. \n\nDecades later they joined the Ishtar Collective on Venus to study the enigmatic ruins unearthed by the Traveler's terraforming. The first time it happened—Vex code leaping across an airgap, surfing the quantum vacuum from simulation to reality, infecting a utility frame—Chioma pulled an alarm while Maya tried to grab the precious frame with a cargo-grade gravity grapple. She couldn't lift the grapple. Chioma grabbed it, pinned the frame to the wall, and won the argument.",
            "itemHash": "3580904581",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/6afd31f787ff68d32e1f574686494606.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Repulsor Force",
                    "description": "This weapon emits a powerful impulse that pushes enemies away, suppresses their abilities, and makes them more vulnerable to all incoming damage.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/3f3df3c22d73b93477546e17defc04e4.png",
                    "hashID": 1210807262,
                    "weaponHash": 3580904581,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Extended Barrel",
                    "description": "Weighty barrel extension.\n  •  Increases range\n  •  Decreases handling speed\n  •  Moderately controls recoil",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9e5e8fa07a84c29252b78b0e7b3106d.png",
                    "hashID": 1467527085,
                    "weaponHash": 3580904581,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Particle Repeater",
                    "description": "Improves stability. \n  •  Increases stability",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8a273117023794757631a34803314351.png",
                    "hashID": 3868766766,
                    "weaponHash": 3580904581,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "The Scientific Method",
                    "description": "Damaging an opponent temporarily increases speed and handling.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/c329e8bf3a787a9e3933ca87afafb463.png",
                    "hashID": 25692695,
                    "weaponHash": 3580904581,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Composite Stock",
                    "description": "This weapon has a versatile dual-purpose stock.\n  •  Slightly increases stability\n  •  Slightly increases handling speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7c616b3d2d0e97bf8948b1371b3007bb.png",
                    "hashID": 3465198467,
                    "weaponHash": 3580904581,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Power",
            "legendWeaponDamageElement": "Void",
            "masterworkData": null
        },
        "Hawkmoon": {
            "name": "Hawkmoon",
            "type": "Exotic Hand Cannon",
            "description": "",
            "lore": "Stalk thy prey and let loose thy talons upon the Darkness.",
            "ExtLore": "What is this feeling?\n\nI did not ask for it. I do not understand it. I do not want it.\n\nThe Crow is so carefree in his ignorance. The bonfire's glow lights up his pale features and I am drawn to the hope in his gold eyes. Where is the despairing child I anticipated?\n\nHe drinks from an open bottle of wine against the recommendation of his Ghost. The Guardian encourages him and they are laughing. This celebration is maddening; neither have reason to be so jubilant. Their world is ending and they thrash like dying creatures in the final light of collapsing stars. They do not seem to acknowledge the futility of their existence, the impermanence of it in the face of cosmic annihilation.\n\nNow the Guardian is drinking, standing close to the fire. Their Ghost, too, encourages them not to partake. They poison themselves for the enjoyment of it.\n\nI am reminded of my sisters. Of moments spent by lapping shores, gazing up at infinite stars full of possibilities and wonder. I am left yearning.\n\nWhat is this feeling?\n\nI do not understand it. I do not want it.\n\nThey are celebrating their victory over the Taken. The Crow is making a gun shape with his hand, swinging the nearly empty bottle of wine around in the other like a Sword. The Guardian looks pensive, sitting on a rock by the fire, contemplating the secret they are keeping. The Crow notices, but tries not to show it. He wants the Guardian's spirits to be lifted. He wants to be supportive, so that they may share in their triumphs together.\n\nAs equals.\n\nI am reminded of my home. I am reminded of the warmth of the sun and the embrace of my family. I am reminded of my father's face. I am reminded of everyone I betrayed. All the blood spilled in the name of immortality. The warmth of the sun burns me with its memory.\n\nWhat is this feeling?\n\nI do not want it.\n\nThe fire has nearly died. The Crow fell over and cannot stand, though he insists he is fine. The Guardian is turning the embers with the tip of their Sword. The Ghosts are talking to one another in quiet conspiracy. The celebration has ended, but I can sense their emotions are mixed: complex and myriad things, when a simple, singular focus would suffice.\n\nThere is a growing kinship here. Against better judgment.\n\nWhat is this feeling?",
            "itemHash": "3856705927",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/cef1290d58a2d94d1437e1e569fa7996.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Paracausal Shot",
                    "description": "Final blows and precision hits with Hawkmoon grant stacks of Paracausal Charge. The final round in the magazine deals bonus damage based on the number of stacks. Stowing Hawkmoon on the final round removes this bonus.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/243f5529bbd845871803181958599473.png",
                    "hashID": 213689231,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Corkscrew Rifling",
                    "description": "Balanced barrel. \n  •  Slightly increases range and stability\n  •  Slightly increases handling speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7730e1732ed7ef91afce50277639c493.png",
                    "hashID": 4090651448,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Alloy Magazine",
                    "description": "Faster reloads when the magazine is empty.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/069170916c98748b7b3e33b80bd7d689.png",
                    "hashID": 1431678320,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Killing Wind",
                    "description": "Final blows grant increased mobility, weapon range, and handling for a short duration.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/db2aa71ff6d808929bb0e668dcf0822e.png",
                    "hashID": 2450788523,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Textured Grip",
                    "description": "The friction on this weapon's grip is particularly strong.\n  •  Greatly increases handling speed\n  •  Slightly decreases stability",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/f1a31e1710aac5b4fb1715d174093199.png",
                    "hashID": 3917450714,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Kinetic",
            "legendWeaponDamageElement": "Kinetic",
            "masterworkData": null
        },
        "Warlock Exotic": {
            "name": "Phoenix Protocol",
            "type": "Exotic Chest Armor",
            "description": "",
            "lore": "Do not grieve the dying star. Its death kindles newer life, and thus the wheel turns again.",
            "ExtLore": "\"Warlocks are edging in on Titan territory, I tell you.\"\n\n\"What do you mean?\"\n\n\"Well, first I started losing fistfights with them in the Crucible. That's an affront to everything Titans stand for. If Wei-Ning were here, she'd die of shame!\"\n\n\"I'm sure she'd be thrilled, honestly.\"\n\n\"That's beside the point. This thing with the fancy rift? It's basically Ward of Dawn.\"\n\n\"It doesn't block ballistics.\"\n\n\"But it does everything else! It's the same thing as the Ward we had before the Red Legion! It's outright plagiaristic!\"\n\n\"It doesn't blind people either.\"\n\n\"Won't you just let me have my outrage?\"",
            "itemHash": "4057299719",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/5ab8760ee8ef440f317ae4a95d047d07.jpg",
            "rarity": "Exotic",
            "class": 2,
            "statRolls": [
                68,
                24,
                2,
                11,
                2,
                19,
                10
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Battle-Hearth",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/6985c5f8dbe4d38b0702df7f55d50172.png",
                    "desc": "Kills and assists you make while standing in your Well of Radiance return Super energy."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Hunter Exotic": {
            "name": "Gemini Jester",
            "type": "Exotic Leg Armor",
            "description": "",
            "lore": "\"I love making people laugh. And by 'people,' I mean me. Haha!\" \"Haha! Me!\"",
            "ExtLore": "He quietly giggled as he stood blocking my exit, almost as if to taunt me. I start to push my way past but the blasted fool pulls hard on my ear, swiftly takes a step back, and presents his rump in a jesting dance. Not willing to get pulled into his game, I ignore his blatant attempts at a farce and continue forward. Abrupt shrills of frenzied laughter break out as I feel the full force of his boot on my backside. I cannot ignore his flagrant mockery. I reel around, take hold of his collar and clock him full force. Behind me, in the distance, I hear hysterical laughter. Confused, I whirl my head back to see a jaunty man skipping off. I look back at my hands to find them empty. That jester has taken me for a fool.",
            "itemHash": "1163283805",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/9b9cf3c53c26c364532bfda3dd372827.jpg",
            "rarity": "Exotic",
            "class": 1,
            "statRolls": [
                66,
                15,
                8,
                12,
                6,
                15,
                10
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Misdirection",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/ec0f49f1d1ac107ff075d74f710153f9.png",
                    "desc": "Dodging disorients nearby enemies and temporarily removes their radar."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Titan Exotic": {
            "name": "Peregrine Greaves",
            "type": "Exotic Leg Armor",
            "description": "",
            "lore": "Victory from on high.",
            "ExtLore": "From: Jagi\nTo: Saint-14\nCategory: 8-sat bounce\nPriority: 3\n\nActing on intel from Hunter Vanguard Aparajita-4, my host made contact with the Lightbearer inhabiting the ruins of Caer Lerion. Recommend classification of said Lightbearer as \"Warlord.\"\n\nMy host engaged, but the target occupied advantageous terrain and our Ghosts' resurrection times have increased by another 2.8 percent, a 0.6 increase from my last report. Further analysis is attached to this report.\n\nAfter several waves, a retreat seemed the only tactical option left to us. Before I could issue the command, a new variable entered the field from above.\n\nAt first I believed it to be a Warsat. My initial assessment proved incorrect; the variable was a Titan who deployed himself from high ground to deliver an aerial melee assault upon the target.\n\nThis proved a turning point in the battle, and we were soon able to incapacitate the Warlord and prepare him for return to the Tower. I have asked the Titan to file his own report, which is also attached.\n\nEND MESSAGE\n\n\nBEGIN ATTACHMENT\n\nFrom: Vell Tarlowe\nTo: Saint-14\nCategory: 8-sat bounce\nPriority: 1\n\nI just had the best. Day. Of. My. Life. Get ready for this…",
            "itemHash": "2255796155",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/49750e0306908fb302124ba9cab65606.jpg",
            "rarity": "Exotic",
            "class": 0,
            "statRolls": [
                62,
                11,
                11,
                10,
                8,
                7,
                15
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Peregrine Strike",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/7713596356b90eec06db4b7c50523685.png",
                    "desc": "All shoulder charge abilities (Seismic Strike, Hammer Strike, or Shield Bash) deal bonus damage when activated in the air. Provides a small benefit to the airborne effectiveness stat of all weapons."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        }
    },
    "Legendaries": {
        "Legendary weapons": [
            {
                "name": "Wolftone Draw",
                "type": "Legendary Combat Bow",
                "description": "",
                "lore": "\"Keep the string a little loose. It's supposed to sound like that.\" —Petra Venj",
                "ExtLore": "The slithering dark is cold against my face.\n\nI cannot speak, cannot breathe, I reach for Sagira but then I remember… I form a fist but feel nothing, I am bound, and as I thrash the images cut fissures through my mind—\n\nSomeone… the Awoken prince? He helps me to my feet… but still I struggle in the dark, and now SHE is standing, thanking him, but she uses my voice, MY voice—\n\nShe has stolen my form, my voice, but someone will see my failure and cast her out… they MUST—\n\nA glimmer of sunlight… how long has it been? Zavala looks at me—at her, considers her words, poison cloaked in wisdom. I cry out, he must know. Zavala, listen, LISTEN, you KNOW me, you know not to—\n\nThe smell of night flowers… I am walking—SHE is walking through a moonlit garden, and there is Ikora, speaking, laughing, nodding… Look, Ikora, LOOK AT ME, DON'T YOU SEE IT—\n\nPay attention, pay ATTENTION, I taught you better than this—\n\nA woman—an Exo—sits before me and sways, eyes vacant, but inside she is sinking as well… now her voice, her TRUE voice, humming, a gyre of sound, and the Exo sways faster and faster—\n\nI hear his voice and push to the surface. Saint. No no NO I scream but there is no sound. He looks into her eyes, he smiles, he reaches for me but it is not me, Saint, that is not ME, PLEASE, please—\n\nI am weeping but I cannot weep. I am nothing, only heat and hate, only sickness and shame.\n\n\"Trust me,\" I hear my voice say, and I drown again.",
                "itemHash": "3472875143",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/5f9ef662f62e33de2a7b9b314e262394.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Elastic String",
                        "description": "Excellent snapback.\n  •  Decreases accuracy\n  •  Faster draw time\n  •  Slightly increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7ac5f641c349090716f486180d57b0af.png",
                        "hashID": 2801223209,
                        "weaponHash": 3472875143,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Helical Fletching",
                        "description": "Aerodynamic and light. \n  •  Slightly increases accuracy\n  •  Slightly increases stability",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/2f3417365352f6368bad28daab355c2c.png",
                        "hashID": 3311977193,
                        "weaponHash": 3472875143,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Sneak Bow",
                        "description": "Increases hold time and reload speed, and prevents radar pings from shooting while crouched.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/5e220246d771906f714ea0f89f83260d.png",
                        "hashID": 908147344,
                        "weaponHash": 3472875143,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Harmony",
                        "description": "Final blows with other weapons improve this weapon's damage and performance for a short duration.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/37f787e53bf9589f03c0e2f7e18b3736.png",
                        "hashID": 438098033,
                        "weaponHash": 3472875143,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Precision Frame",
                    "description": "Compound Bow. Longer draw time optimized for damage. \n[Reload]  : Use while drawn to cancel the shot.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/db45b9d8b807d52fab288e8c04733065.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Draw Time",
                    "description": "The time in milliseconds it takes to draw an arrow. Release an arrow when fully drawn for maximum damage and speed.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/2609297fc7fc32156373e1f539bf5f96.jpg",
                    "mwHash": 2203506848
                }
            },
            {
                "name": "Timelines' Vertex",
                "type": "Legendary Fusion Rifle",
                "description": "",
                "lore": "\"I give you this, to be sure that we meet again.\" —Lakshmi-2",
                "ExtLore": null,
                "itemHash": "3055192515",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/397159323a6b39ae40f2631df9b2b9ff.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Transmission MS7",
                        "description": "Omolon ocular technology. Long zoom.\n  •  Increases range\n  •  Slightly decreases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/df172a148d2ce7b9d41dd76665748fc1.png",
                        "hashID": 194952921,
                        "weaponHash": 3055192515,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Accelerated Coils",
                        "description": "Speeds up charge.\n  •  Faster charge time\n  •  Decreases impact damage",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/a51d91da9fb0a4c8f45b2ffa89e51ad7.png",
                        "hashID": 689005463,
                        "weaponHash": 3055192515,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Auto-Loading Holster",
                        "description": "The holstered weapon is automatically reloaded after a short period of time.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/e4262099a1c2cea78b48a6680c5248c9.png",
                        "hashID": 3300816228,
                        "weaponHash": 3055192515,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Demolitionist",
                        "description": "Kills with this weapon generate grenade energy. Activating your grenade ability reloads this weapon from reserves.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/da009697110e06b65d6f827b3b6d5f70.png",
                        "hashID": 3523296417,
                        "weaponHash": 3055192515,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Adaptive Frame",
                    "description": "A well-rounded grip, reliable and sturdy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/967fb4abc6ab98f74639d6c08e5f56ee.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            },
            {
                "name": "Judgment of Kelgorath",
                "type": "Legendary Glaive",
                "description": "",
                "lore": "\"CARVE UNTO ME A TRIBUTE OF WAILING PRAYERS\" —Xivu Arath, Hive God of War",
                "ExtLore": "*****\n\nHäkke Foundry Rebuild-001 \n\nDesignation: Experimental Project–Vanguard Clearance Approved \n\nWork: New haft, bound in dampening weave. Blade reset with reinforced tang, sharpening not needed. Emitter fitted and recalibrated, grip and housing reconstructed to meet Human anatomy.\n\n\"Darkblade core - 1\" retrieved from onsite by Guardian operator.\n\nHive inscriptions decoded by operator, Osiris. Translation of experiential record imprint as follows:\n\n*****\n\nThe black-flame projection of Xivu Arath fills the Martian cavern. Below her, Kelgorath's broken blade rests atop a ritual altar—both are inlaid with runes caked in dried blood layered like stratum.  \n\nAn ornately adorned Wizard presides over the communal ceremony. They motion to the blade.\n\n\"This one has failed you many times.\"\n\nThe cavern quakes with Xivu's whispered reply.\n\nRUIN BIRTHS RENEWAL\n\nShe reaches through her projection and coaxes the blade into the air, then cleaves hefts of the heavy Hive metal from the weapon. What remains is a dark sliver. An imitation of Xivu's black edge.\n\nAS VICTORY'S HAMMER SHAPES, SO DOES FAILURE'S CHISEL\n\nThe blade is reforged, a razor of painless edge and subtle ends.\nWORTH SHALL BE MEASURED…\n\nXivu Arath twists her claws. A haft condenses from swirling soulfire into solid stone and bonds to the blade. By her voice, the weapon is anointed. \n\n…AND JUDGMENT PASSED\n\nAt her command, a tear into the Ascendant Plane bursts open before her. Kelgorath steps from the portal. \n\n\"What can this humble servant offer Death?\"\n\nThe cavern fills with her answer.\n\nCLAIM MARS; POSSESS THE WARMIND\n\nKelgorath barely recognizes the blade he once pledged to Savathûn, now remade as he has been. He grips it, and in his grasp, it sprouts into a wicked axe, cored by a sliver of Xivu Arath's might.\n\nRISE, KELGORATH, DARKBLADE",
                "itemHash": "2978226043",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/b39435ee9222e753432df78ed31f91c4.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Supercooled Accelerator",
                        "description": "Optimized for extended range.\n  •  Increases range\n  •  Slightly decreases reload speed\n  •  Slightly decreases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/a5baa71112f0616ff78bbeacad7b10b2.png",
                        "hashID": 1934171651,
                        "weaponHash": 2978226043,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Swap Mag",
                        "description": "Increases this weapon's ready and stow speed.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/189373621216db573964bfc8a3632999.png",
                        "hashID": 3721627275,
                        "weaponHash": 2978226043,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Overflow",
                        "description": "Picking up Special or Heavy ammo automatically loads this weapon beyond normal capacity.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/3165fec56b59363fa974a11f5730f4ec.png",
                        "hashID": 3643424744,
                        "weaponHash": 2978226043,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Harmony",
                        "description": "Final blows with other weapons improve this weapon's damage and performance for a short duration.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/37f787e53bf9589f03c0e2f7e18b3736.png",
                        "hashID": 438098033,
                        "weaponHash": 2978226043,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Ambush",
                        "description": "Improves range, handling, and damage against combatants during the opening moments of an engagement.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/a727dccb4a2b0c94bf4eadb8abd5ae95.png",
                        "hashID": 192157151,
                        "weaponHash": 2978226043,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Aggressive Glaive",
                    "description": "Hard-hitting, slow melee/ranged polearm with a frontal shield.\nGenerates energy on dealing ranged damage.\n\n[Aim Down Sights]  : Raise shield, depleting energy over time\n[Melee]  : Kinetic melee combo",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/64209c4fd20513b33109c374179d0958.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Shield Duration",
                    "description": "How long this weapon's shield can be raised.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/f89f1b51230bcc8029d8c435b711d10f.jpg",
                    "mwHash": 3673787993
                }
            },
            {
                "name": "Blast Battue",
                "type": "Legendary Grenade Launcher",
                "description": "",
                "lore": "\"Yes, you got the kill, but the pelt is ruined.\" —Devrim Kay",
                "ExtLore": "Rc-9: This is Vanguard Militia Scout-ship: Recon-9, making my report via VanNet proxy satellite. I have completed my sweep through the Reef and am filing an incident report hence forth referred to as Inc-01, should it be referenced.\n\nShuffling is heard as the speaker adjusts. Papers sift and the microphone crackles slightly. \n\nRc-9: The basis of my visit to the Tangled Shore was to conduct routine Vanguard/Reef security sweeps, as agreed upon since the day of incursion. I was escorted most of the way to the Shore by Awoken gunships, and only landed once my long-range scanner picked up a sub-audio reading emanating from the underbelly of one of the larger asteroid landmasses. \n\nThe speaker clears their throat. \n\nRc-9: I called in the disturbance to a nearby Awoken vessel and was told to, and I quote, \"Mind my own business and be on my way,\" so naturally, I thanked them for their assistance, feigned departure, and landed to check it out. They didn't seem to notice the signal. At the signal's source, I discovered a small camp of what I initially thought were Scorn. Upon further observation, I found that these were not Scorn but Fallen afflicted with some kind of flesh deformity and mental degradation. Shot one dead and the others just looked at me. They didn't fight back. Fired a few cesium charges into the asteroid hole and watched 'em burn. Just sat there. I didn't hear it clearly, but they were chanting something. I don't know. Hard to hear over the fire. \n\nThe speaker laughs to themselves and emulates popping noises. \n\nRc-9: I heard more of them whispering a little deeper in, so I waited for the area to burn out and continued inside. I found one structure of apparent Hive architecture, though it did not appear to have been constructed in any traditional sense… but then again, I don't know what I should even expect from the Hive at this point. A single Fallen was inside, became violent when I approached and brandished a weapon. The weapon was not loaded, and I put them down. \n\nRc-9: My logs will show a few recovered pieces of equipment that I will list now. One presumably organic section of the Hive structure. It is perpetually wet, just… great job on that, and causes dizziness and blurred vision when held with ungloved hands. It also has the unnerving ability to project dysphoria or general unease. I was asked to collect a sample for study by my CO. I've done that. Put it in a lead box all the way in the back of the cargo hold. Yeah. Eternal tithings to Xivu Arath. Whatever. Um… as I was saying. \n\nA tin is heard being unlatched. \n\nRc-9: Also recovered: one tube-style Grenade Launcher. It has no foundry markings. Definitely not Fallen, and I don't think the Scorn even know how to make weapons. Do the Awoken make Grenade Launchers? Always struck me as a Human weapon. Beautiful weapon. The thing wants to be used. Maybe I'll get an opportunity to use it before I get back to the Tower. Lastly, I recovered a locational tracker from one of the Fallen. Following it back to someplace else in the Reef. Little remote. I'll call in my findings once I've finished there. \n\nRc-9: Beautiful weapon. \n\nThe recording cuts.",
                "itemHash": "2453357042",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/9b3326bd83ea56e3e85c6139404e0bfd.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Linear Compensator",
                        "description": "This weapon's launch barrel is well-balanced.\n  •  Slightly increases projectile speed\n  •  Slightly increases blast radius\n  •  Slightly increases stability",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/5059f4059a4c59d0003f8fedf8987b78.png",
                        "hashID": 1441682018,
                        "weaponHash": 2453357042,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Alloy Casing",
                        "description": "Reduces weight for faster reloads.\n  •  Greatly increases reload speed\n  •  Decreases stability",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/e02a542e5162c002112c21b6fdf2e86b.png",
                        "hashID": 2985827016,
                        "weaponHash": 2453357042,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Threat Detector",
                        "description": "Increased reload, stability, and handling when enemies are in close proximity.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/9611bdbc48aff898193fd5f705c7cf30.png",
                        "hashID": 4071163871,
                        "weaponHash": 2453357042,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Auto-Loading Holster",
                        "description": "The holstered weapon is automatically reloaded after a short period of time.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/e4262099a1c2cea78b48a6680c5248c9.png",
                        "hashID": 3300816228,
                        "weaponHash": 2453357042,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Adaptive Frame",
                    "description": "A well-rounded grip, reliable and sturdy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/967fb4abc6ab98f74639d6c08e5f56ee.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Reload Speed",
                    "description": "The time it takes to reload this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e3a74e6dd4c520ea17eb1fdaf2128213.jpg",
                    "mwHash": 4283235143
                }
            },
            {
                "name": "IKELOS_SMG_v1.0.3",
                "type": "Legendary Submachine Gun",
                "description": "",
                "lore": "Subroutine IKELOS: Status=reinitiated.\nAPOTHEOSIS: Status=active…",
                "ExtLore": null,
                "itemHash": "2149683300",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/f12d04f740f02f82958233a55fa259f5.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Arrowhead Brake",
                        "description": "Lightly vented barrel.\n  •  Greatly controls recoil\n  •  Increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8f7fb54687aa52a9c2595d90ce9c9417.png",
                        "hashID": 839105230,
                        "weaponHash": 2149683300,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Accurized Rounds",
                        "description": "This weapon can fire longer distances.\n  •  Increases range",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d85024478504205359c7fb52dbc4f6b6.png",
                        "hashID": 3142289711,
                        "weaponHash": 2149683300,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Perpetual Motion",
                        "description": "This weapon gains bonus stability, handling, and reload speed while the wielder is in motion.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8b9a4582016210723532907414759e69.png",
                        "hashID": 1428297954,
                        "weaponHash": 2149683300,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Surrounded",
                        "description": "This weapon gains bonus damage when three or more enemies are in close proximity.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/979881b68ca7839267c9aef5aea2b0ce.png",
                        "hashID": 3708227201,
                        "weaponHash": 2149683300,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Aggressive Frame",
                    "description": "High damage, high recoil.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/64209c4fd20513b33109c374179d0958.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Handling",
                    "description": "The speed with which the weapon can be readied and aimed.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/d2e1ab2542f585d025fb4cc1a3885164.jpg",
                    "mwHash": 518224747
                }
            },
            {
                "name": "Blood Feud",
                "type": "Legendary Submachine Gun",
                "description": "",
                "lore": "Thicker than water.",
                "ExtLore": "Tagh'al and Thagh'urn circled one another, their blades gleaming wickedly, even in the sickly glow of the cave. They eyed each other warily, waiting for the other to strike.\n\nThe encircling throng of onlookers and bettors jostled unsteadily. Those at the back surged forward recklessly for a better view, while those in front struggled against the swell, afraid of being pushed into the path of the gladiators' swords. Audience casualties were common at such affairs.\n\nTagh'al suddenly broke the stalemate with a massive cleave, aimed at his opponent's helmeted head. Thagh'urn sidestepped it with ease. His ferocious counter-slice raked across Tagh'al's armored breastplate, leaving a thick gouge in the metal. The crowd roared.\n\nFor several minutes, the massive warriors clashed. Their swords clanged in fury, scraping off one another's armor. All the while, the crowd's furor grew, held in suspense by the certainty of bloodshed.\n\nThen it happened. As the two Cabal locked blades, Thagh'urn unholstered a concealed submachine gun. He unleashed a burst of small caliber bullets into Tagh'al's abdomen at point-blank range, sending the warrior staggering backward. Those who had bet on Tagh'al howled in indignation.\n\nTagh'al pulled off his breastplate to reveal several bullet holes in his thick hide, a gout of blood spurting from one of the wounds. He looked down at the damage…\n\n…And let out a deep, barking laugh. Thagh'urn joined in, and soon, both gladiators were laughing uproariously amidst a spreading pool of blood.\n\nEventually, Tagh'al's laugh slowed to a chuckle. \"Well played, brother,\" he said. \"I suppose we're even now.\"",
                "itemHash": "1509167284",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/df104328e75f159373626e1a5ead783d.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Corkscrew Rifling",
                        "description": "Balanced barrel. \n  •  Slightly increases range and stability\n  •  Slightly increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7730e1732ed7ef91afce50277639c493.png",
                        "hashID": 4090651448,
                        "weaponHash": 1509167284,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Tactical Mag",
                        "description": "This weapon has multiple tactical improvements.\n  •  Slightly increases stability\n  •  Increases reload speed\n  •  Slightly increases magazine size",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/f0e309a267b25279a871d182f8910bcc.png",
                        "hashID": 106909392,
                        "weaponHash": 1509167284,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Pugilist",
                        "description": "Final blows with this weapon generate melee energy. \nDealing melee damage briefly improves this weapon's handling.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/93bb6bb34fb0616805ba2a7181ab386c.png",
                        "hashID": 691659142,
                        "weaponHash": 1509167284,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Focused Fury",
                        "description": "Dealing half of the magazine as precision damage grants this weapon bonus damage. The shot count is reset whenever the weapon is reloaded or stowed.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/15fb47018719c99ae37d10f794bc957e.png",
                        "hashID": 2896038713,
                        "weaponHash": 1509167284,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Right Hook",
                        "description": "Dealing melee damage gives this weapon increased target acquisition and range for a short period of time.\nDealing melee damage again extends the effect.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/067828985c3d34507def4eb53b12cf4e.png",
                        "hashID": 3907865655,
                        "weaponHash": 1509167284,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Aggressive Frame",
                    "description": "High damage, high recoil.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/64209c4fd20513b33109c374179d0958.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Stasis",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            },
            {
                "name": "Eternity's Edge",
                "type": "Legendary Sword",
                "description": "",
                "lore": "\"A sword is a wand that casts two spells: parry and cut.\" —Tarsem Sauer",
                "ExtLore": null,
                "itemHash": "2782325301",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/db84dfbb8cc5045c401583367df23276.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Enduring Blade",
                        "description": "Greatly increased sword ammo at the cost of damage.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/1478f8a31179ca5306f1316e4018f9bd.png",
                        "hashID": 1261178282,
                        "weaponHash": 2782325301,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Infinite Guard",
                        "description": "Sword Guard has balanced defenses and maximized endurance.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/6aef1709498dad9c61e2d85874f34c8b.png",
                        "hashID": 2363751990,
                        "weaponHash": 2782325301,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Thresh",
                        "description": "Killing combatants with this weapon generates a small amount of Super energy.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7f9dcf3bd4a8a4e0d2d0922827f038c9.png",
                        "hashID": 2726471870,
                        "weaponHash": 2782325301,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Flash Counter",
                        "description": "Melee blocked immediately after guarding disorients and weakens the attacker.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/fb749a0428f9b1a7296d3671425264f9.png",
                        "hashID": 2244851822,
                        "weaponHash": 2782325301,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Vortex Frame",
                    "description": "[Heavy Attack]  : Launch a heavy spin attack.\nHeavy attacks are stronger with full energy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/23e50e126159f0f22983f73d6a246f0d.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Impact",
                    "description": "Increases the damage inflicted by each round.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/f2354558ad75fb2527155f0f58c2dcc3.jpg",
                    "mwHash": 1486919755
                }
            }
        ],
        "Warlock": {
            "Helmet": {
                "name": "Ketchkiller's Hood",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"Every crew needs a captain. Otherwise, who'd take all the credit?\" —Drifter",
                "ExtLore": "The Ether Tank, Eliksni Quarter, Last City\n——\n\nWhat's that, Guardian? You want to hear about the old crews from someone who was there?\n\nYou think I was around for the Whirlwind? Ha! I'm a few molts shy. No, I hatched into the House of Wolves. You know the story—and if not, I don't have the time to explain it to you.\n\nBut I trade in information. I ran with some tough crowds in the past, maybe knew someone who knew someone… you get the idea. So I know a fair bit about those crews.\n\nFor them, every puff of Ether came at someone's expense. Your best bet was to be stronger than the next crew over—and when things were especially bad, stronger than whoever was in the cot next to yours.\n\nSo they got strong. And remember, they didn't have Void or Solar like you do; they had claws. Blades. When they killed, it was without hesitation, and when they died, there was no coming back. \n\nYou Guardians, with your little Ghosts hovering nearby, you have the luxury of kindness—that was never an option for the old crews. They were like anyone else; they were cruel, but you needed to be cruel to survive in those days.\n\nAnd they're not \"back,\" like I hear Misraaks saying; they never left. You're up against the ones who stayed alive all this time. The ones who learned how to survive. How to sacrifice. How to take what they need, whatever the cost.\n\n…and speaking of cost, I'm not seeing any more Glimmer in your account. I think we're done talking.",
                "itemHash": "738153648",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/13149c273506ee426d066ba2ee82af46.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    55,
                    13,
                    14,
                    2,
                    6,
                    6,
                    14
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Ketchkiller's Gloves",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"Those other fellas got more hands than you, so make sure you're holdin' bigger guns.\" —Drifter",
                "ExtLore": "Eliksni Quarter, Last City\n——\n\nThe old crews! Yes, I have gathered much information about them in the past weeks. In fact, I have just finished going over my notes!\n\nThe old crews rose in the wake of the Whirlwind, during what we Eliksni refer to as the Long Drift—the span of time between the fall of Riis and our arrival in the Sol system. I believe the equivalent period would be your Dark Ages, though Riis did not have Risen, or Iron Lords. Instead, we had the crews. As you can imagine, this period was quite lawless, as the stability and abundance of Riis was no more. This resulted in what I believe is called a zero-sum game: a situation in which every gain or advantage is earned at the expense of another. \n\nSeveral fearsome individuals rose to great power and authoritative prominence at that time; the Eliksni word for them translates to \"Ketchkiller,\" meaning one who boards and wrests control of enemy ships. These Ketchkillers commanded great fleets and raided many supply routes, procuring objects of historic or intrinsic value along the way. It is exciting to wonder what treasures they accumulated beyond those we've recovered already!\n\nMany crews were abolished or disbanded over time, but those that survived did so through great hardship—they are formidable indeed. But then, so is the Vanguard, and its Guardians.\n\nThank you for asking about my research into the old crews and their significance. It is always a pleasure to talk about it. After all, what use is knowledge if it is not shared?",
                "itemHash": "535937281",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/88e131846c3b5623ef0f10a67b210f63.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    50,
                    2,
                    12,
                    12,
                    6,
                    12,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Ketchkiller's Robes",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"Sail quick so you don't get caught… and have a thick hull if you do.\" —Drifter",
                "ExtLore": "The Annex, Last City\n——\n\nThe old crews? Ain't much I can tell you that you couldn't get from Rahool, but I can't blame you if you'd rather stay awake for the whole story, heheh. C'mon, loosen up, hero! If you think a grim expression is all it takes to move up through the Vanguard… well, you may have something there.\n\nOkay, I'll start at the beginning. The Traveler chose the Eliksni and everything was great over in Riis, until it wasn't. The Whirlwind happened, the Pyramids showed up, the Traveler took off through space, and from what I gather, it wasn't a pretty scene. \n\nEramis was there for it. And—credit where it's due—she picked herself up, grabbed a crew, and went after the Traveler. She cut through everything in her way, dead set on hunting it down. \n\nAnd she wasn't the only one with that idea. Whole fleets of ships chased the Traveler. Lawless days. Hopeless days. \n\n…See, I was here for the Dark Ages. And when there's nothing but loss around you planetside, you can still find a rooftop, sit in a snowfield. You can go into a forest and find a moment of quiet—a little scrap of peace.\n\nAin't like that on a ship. Things go from bad to worse, you just have to face it. And Eramis did. That takes a gutful of grit.\n\nNow, don't think I'm writin' love poems to the Shipstealer over here—we find her, I'm drawing down quick as you are. \n\nBut if the big old Traveler blasted outta the sky tomorrow? You bet your entire vault we'd chase after it. We'd be the new crews, going after something we knew in our bones was ours, not stopping for anyone or anything that got in our way.\n\nAnd we'd still think of ourselves as heroes, wouldn't we?",
                "itemHash": "3833868247",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/cd3a96232f4a597f1c0d84459ac5b067.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    56,
                    2,
                    26,
                    2,
                    14,
                    6,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Ketchkiller's Boots",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"Cut anchor if things get messy. There's always another score.\" —Drifter",
                "ExtLore": "House Salvation Ketch, Themis Cluster\n——\n\nWe are raiders and cutthroats, killing each other for bare survival. But what else could we have become? You can't speak of us—the old crews and their infamy—without speaking of the Whirlwind.\n\nLike hatchlings chittering for their mother, we were abandoned. Weak. Left to die. You all know what came after. We lived. We lived, and all we had were our lives. \n\nGreat Houses fell, and from their ruins rose the crews. We followed the traitor Machine to this system and found the Humans just as soft and weak as we had been; as reliant, helpless, and blind as the Machine had made us. But the Humans had taken it from us, and so they would pay with everything they had.\n\nAnd now? Now we remain where others have failed. Enemy ships quaver at the sight of our banners. They break against our hulls. And when we pick them clean of all they have, we find other prey and do the same.\n\nWe know the truth in this system: we are only as strong as those we kill.",
                "itemHash": "2030782835",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/28e82bd8b50c785413e25fa2486cce6b.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    53,
                    2,
                    12,
                    12,
                    2,
                    18,
                    7
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Ketchkiller's Bond",
                "type": "Legendary Warlock Bond",
                "description": "",
                "lore": "\"The pirates hold nothin' back when they fight. Can you match that?\" —Drifter",
                "ExtLore": "Eliksni Quarter, Last City\n——\n\nWhat makes a House? It is a good question, and one that many Eliksni do not think on often enough.\n\nFor Humans, a house is a place. But for Eliksni, a House is a family. It has a culture. A philosophy of living, shared by all.\n\nThat is why the House of Light survived, even when we fled Europa. Even after the Shipstealer took all we had. We were bound not by place or possessions, but as family.\n\nCryptarch Matsuo asked me why the old crews are not considered Houses. It is a wise question. One that, perhaps, does not have a singular answer. \n\nI think it is because those who lead the old crews do not wish to be true Kells. A Kell is responsible for the safety and prosperity of their House. It is an honor, and a burden.\n\nThose you call Pirate Lords wish only to take—they give nothing, even to their own people. Each raider is responsible only for themselves. A crew is expendable… a family is not.\n\nThe old crews live a sad life. One best left in the past.",
                "itemHash": "1667220390",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/78ffb1aaa9fe8c9ce444c34ea43b0642.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Hunter": {
            "Helmet": {
                "name": "Ketchkiller's Mask",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"A smart captain keeps one eye on their own back.\" —Spider",
                "ExtLore": "The Ether Tank, Eliksni Quarter, Last City\n——\n\nWhat's that, Guardian? You want to hear about the old crews from someone who was there?\n\nYou think I was around for the Whirlwind? Ha! I'm a few molts shy. No, I hatched into the House of Wolves. You know the story—and if not, I don't have the time to explain it to you.\n\nBut I trade in information. I ran with some tough crowds in the past, maybe knew someone who knew someone… you get the idea. So I know a fair bit about those crews.\n\nFor them, every puff of Ether came at someone's expense. Your best bet was to be stronger than the next crew over—and when things were especially bad, stronger than whoever was in the cot next to yours.\n\nSo they got strong. And remember, they didn't have Void or Solar like you do; they had claws. Blades. When they killed, it was without hesitation, and when they died, there was no coming back. \n\nYou Guardians, with your little Ghosts hovering nearby, you have the luxury of kindness—that was never an option for the old crews. They were like anyone else; they were cruel, but you needed to be cruel to survive in those days.\n\nAnd they're not \"back,\" like I hear Misraaks saying; they never left. You're up against the ones who stayed alive all this time. The ones who learned how to survive. How to sacrifice. How to take what they need, whatever the cost.\n\n…and speaking of cost, I'm not seeing any more Glimmer in your account. I think we're done talking.",
                "itemHash": "1095145125",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/779bb71087bc382dd6894e485c278469.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    51,
                    12,
                    2,
                    10,
                    2,
                    6,
                    19
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Ketchkiller's Grips",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"Being captain just means everyone has a reason to want you gone.\" —Spider",
                "ExtLore": "Eliksni Quarter, Last City\n——\n\nThe old crews! Yes, I have gathered much information about them in the past weeks. In fact, I have just finished going over my notes!\n\nThe old crews rose in the wake of the Whirlwind, during what we Eliksni refer to as the Long Drift—the span of time between the fall of Riis and our arrival in the Sol system. I believe the equivalent period would be your Dark Ages, though Riis did not have Risen, or Iron Lords. Instead, we had the crews. As you can imagine, this period was quite lawless, as the stability and abundance of Riis was no more. This resulted in what I believe is called a zero-sum game: a situation in which every gain or advantage is earned at the expense of another. \n\nSeveral fearsome individuals rose to great power and authoritative prominence at that time; the Eliksni word for them translates to \"Ketchkiller,\" meaning one who boards and wrests control of enemy ships. These Ketchkillers commanded great fleets and raided many supply routes, procuring objects of historic or intrinsic value along the way. It is exciting to wonder what treasures they accumulated beyond those we've recovered already!\n\nMany crews were abolished or disbanded over time, but those that survived did so through great hardship—they are formidable indeed. But then, so is the Vanguard, and its Guardians.\n\nThank you for asking about my research into the old crews and their significance. It is always a pleasure to talk about it. After all, what use is knowledge if it is not shared?",
                "itemHash": "1834245236",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/d9878c7f0881c21ec5af2afcd808c241.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    50,
                    10,
                    10,
                    2,
                    6,
                    16,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Ketchkiller's Vest",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"Make sure any flag you fight under is worth dying for.\" —Spider",
                "ExtLore": "The Annex, Last City\n——\n\nThe old crews? Ain't much I can tell you that you couldn't get from Rahool, but I can't blame you if you'd rather stay awake for the whole story, heheh. C'mon, loosen up, hero! If you think a grim expression is all it takes to move up through the Vanguard… well, you may have something there.\n\nOkay, I'll start at the beginning. The Traveler chose the Eliksni and everything was great over in Riis, until it wasn't. The Whirlwind happened, the Pyramids showed up, the Traveler took off through space, and from what I gather, it wasn't a pretty scene. \n\nEramis was there for it. And—credit where it's due—she picked herself up, grabbed a crew, and went after the Traveler. She cut through everything in her way, dead set on hunting it down. \n\nAnd she wasn't the only one with that idea. Whole fleets of ships chased the Traveler. Lawless days. Hopeless days. \n\n…See, I was here for the Dark Ages. And when there's nothing but loss around you planetside, you can still find a rooftop, sit in a snowfield. You can go into a forest and find a moment of quiet—a little scrap of peace.\n\nAin't like that on a ship. Things go from bad to worse, you just have to face it. And Eramis did. That takes a gutful of grit.\n\nNow, don't think I'm writin' love poems to the Shipstealer over here—we find her, I'm drawing down quick as you are. \n\nBut if the big old Traveler blasted outta the sky tomorrow? You bet your entire vault we'd chase after it. We'd be the new crews, going after something we knew in our bones was ours, not stopping for anyone or anything that got in our way.\n\nAnd we'd still think of ourselves as heroes, wouldn't we?",
                "itemHash": "92499596",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/7d0a7e92d4f3d071dddc3ea54c877d29.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    53,
                    12,
                    12,
                    2,
                    12,
                    9,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Ketchkiller's Strides",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"Keep two knives in your belt, in case you can't get your point across with one.\" —Spider",
                "ExtLore": "House Salvation Ketch, Themis Cluster\n——\n\nWe are raiders and cutthroats, killing each other for bare survival. But what else could we have become? You can't speak of us—the old crews and their infamy—without speaking of the Whirlwind.\n\nLike hatchlings chittering for their mother, we were abandoned. Weak. Left to die. You all know what came after. We lived. We lived, and all we had were our lives. \n\nGreat Houses fell, and from their ruins rose the crews. We followed the traitor Machine to this system and found the Humans just as soft and weak as we had been; as reliant, helpless, and blind as the Machine had made us. But the Humans had taken it from us, and so they would pay with everything they had.\n\nAnd now? Now we remain where others have failed. Enemy ships quaver at the sight of our banners. They break against our hulls. And when we pick them clean of all they have, we find other prey and do the same.\n\nWe know the truth in this system: we are only as strong as those we kill.",
                "itemHash": "2121983870",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/459b5f4d5bbf4c5dd0028b366be79068.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    49,
                    12,
                    6,
                    7,
                    12,
                    2,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Ketchkiller's Cloak",
                "type": "Legendary Hunter Cloak",
                "description": "",
                "lore": "\"Keep a radio hidden on you… and hope you never need it.\" —Spider",
                "ExtLore": "Eliksni Quarter, Last City\n——\n\nWhat makes a House? It is a good question, and one that many Eliksni do not think on often enough.\n\nFor Humans, a house is a place. But for Eliksni, a House is a family. It has a culture. A philosophy of living, shared by all.\n\nThat is why the House of Light survived, even when we fled Europa. Even after the Shipstealer took all we had. We were bound not by place or possessions, but as family.\n\nCryptarch Matsuo asked me why the old crews are not considered Houses. It is a wise question. One that, perhaps, does not have a singular answer. \n\nI think it is because those who lead the old crews do not wish to be true Kells. A Kell is responsible for the safety and prosperity of their House. It is an honor, and a burden.\n\nThose you call Pirate Lords wish only to take—they give nothing, even to their own people. Each raider is responsible only for themselves. A crew is expendable… a family is not.\n\nThe old crews live a sad life. One best left in the past.",
                "itemHash": "2325223873",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/3232ea73e486a2e740ef30462d63f3ec.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Titan": {
            "Helmet": {
                "name": "Ketchkiller's Helmet",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"Even from the deck of a Ketch, your Light can shatter the stars.\" —Mithrax",
                "ExtLore": "The Ether Tank, Eliksni Quarter, Last City\n——\n\nWhat's that, Guardian? You want to hear about the old crews from someone who was there?\n\nYou think I was around for the Whirlwind? Ha! I'm a few molts shy. No, I hatched into the House of Wolves. You know the story—and if not, I don't have the time to explain it to you.\n\nBut I trade in information. I ran with some tough crowds in the past, maybe knew someone who knew someone… you get the idea. So I know a fair bit about those crews.\n\nFor them, every puff of Ether came at someone's expense. Your best bet was to be stronger than the next crew over—and when things were especially bad, stronger than whoever was in the cot next to yours.\n\nSo they got strong. And remember, they didn't have Void or Solar like you do; they had claws. Blades. When they killed, it was without hesitation, and when they died, there was no coming back. \n\nYou Guardians, with your little Ghosts hovering nearby, you have the luxury of kindness—that was never an option for the old crews. They were like anyone else; they were cruel, but you needed to be cruel to survive in those days.\n\nAnd they're not \"back,\" like I hear Misraaks saying; they never left. You're up against the ones who stayed alive all this time. The ones who learned how to survive. How to sacrifice. How to take what they need, whatever the cost.\n\n…and speaking of cost, I'm not seeing any more Glimmer in your account. I think we're done talking.",
                "itemHash": "859087913",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/7aaf2f87d0ad3cf4627bcfad2b7e3e97.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    52,
                    10,
                    2,
                    10,
                    21,
                    2,
                    7
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Ketchkiller's Gauntlets",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"Steer your ship true, as trust is rare among the deep stars.\" —Mithrax",
                "ExtLore": "Eliksni Quarter, Last City\n——\n\nThe old crews! Yes, I have gathered much information about them in the past weeks. In fact, I have just finished going over my notes!\n\nThe old crews rose in the wake of the Whirlwind, during what we Eliksni refer to as the Long Drift—the span of time between the fall of Riis and our arrival in the Sol system. I believe the equivalent period would be your Dark Ages, though Riis did not have Risen, or Iron Lords. Instead, we had the crews. As you can imagine, this period was quite lawless, as the stability and abundance of Riis was no more. This resulted in what I believe is called a zero-sum game: a situation in which every gain or advantage is earned at the expense of another. \n\nSeveral fearsome individuals rose to great power and authoritative prominence at that time; the Eliksni word for them translates to \"Ketchkiller,\" meaning one who boards and wrests control of enemy ships. These Ketchkillers commanded great fleets and raided many supply routes, procuring objects of historic or intrinsic value along the way. It is exciting to wonder what treasures they accumulated beyond those we've recovered already!\n\nMany crews were abolished or disbanded over time, but those that survived did so through great hardship—they are formidable indeed. But then, so is the Vanguard, and its Guardians.\n\nThank you for asking about my research into the old crews and their significance. It is always a pleasure to talk about it. After all, what use is knowledge if it is not shared?",
                "itemHash": "2945464224",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/2b7d488d9c583483d1a099215ac263e3.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    53,
                    10,
                    2,
                    14,
                    6,
                    19,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Ketchkiller's Plate",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"You will face cutlass and cannon fire… nothing you need fear.\" —Mithrax",
                "ExtLore": "The Annex, Last City\n——\n\nThe old crews? Ain't much I can tell you that you couldn't get from Rahool, but I can't blame you if you'd rather stay awake for the whole story, heheh. C'mon, loosen up, hero! If you think a grim expression is all it takes to move up through the Vanguard… well, you may have something there.\n\nOkay, I'll start at the beginning. The Traveler chose the Eliksni and everything was great over in Riis, until it wasn't. The Whirlwind happened, the Pyramids showed up, the Traveler took off through space, and from what I gather, it wasn't a pretty scene. \n\nEramis was there for it. And—credit where it's due—she picked herself up, grabbed a crew, and went after the Traveler. She cut through everything in her way, dead set on hunting it down. \n\nAnd she wasn't the only one with that idea. Whole fleets of ships chased the Traveler. Lawless days. Hopeless days. \n\n…See, I was here for the Dark Ages. And when there's nothing but loss around you planetside, you can still find a rooftop, sit in a snowfield. You can go into a forest and find a moment of quiet—a little scrap of peace.\n\nAin't like that on a ship. Things go from bad to worse, you just have to face it. And Eramis did. That takes a gutful of grit.\n\nNow, don't think I'm writin' love poems to the Shipstealer over here—we find her, I'm drawing down quick as you are. \n\nBut if the big old Traveler blasted outta the sky tomorrow? You bet your entire vault we'd chase after it. We'd be the new crews, going after something we knew in our bones was ours, not stopping for anyone or anything that got in our way.\n\nAnd we'd still think of ourselves as heroes, wouldn't we?",
                "itemHash": "130618344",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/1e27ae58f2f2b67d941e00299c8ac166.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    52,
                    12,
                    2,
                    12,
                    6,
                    9,
                    11
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Ketchkiller's Greaves",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"Tread your path with honor, as a true Lightbearer.\" —Mithrax",
                "ExtLore": "House Salvation Ketch, Themis Cluster\n——\n\nWe are raiders and cutthroats, killing each other for bare survival. But what else could we have become? You can't speak of us—the old crews and their infamy—without speaking of the Whirlwind.\n\nLike hatchlings chittering for their mother, we were abandoned. Weak. Left to die. You all know what came after. We lived. We lived, and all we had were our lives. \n\nGreat Houses fell, and from their ruins rose the crews. We followed the traitor Machine to this system and found the Humans just as soft and weak as we had been; as reliant, helpless, and blind as the Machine had made us. But the Humans had taken it from us, and so they would pay with everything they had.\n\nAnd now? Now we remain where others have failed. Enemy ships quaver at the sight of our banners. They break against our hulls. And when we pick them clean of all they have, we find other prey and do the same.\n\nWe know the truth in this system: we are only as strong as those we kill.",
                "itemHash": "1640403802",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/2d9e2a3fdeaf2bce46c2a0401215adda.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    56,
                    7,
                    9,
                    11,
                    2,
                    6,
                    21
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Ketchkiller's Mark",
                "type": "Legendary Titan Mark",
                "description": "",
                "lore": "\"Not all deserve your protection, but all will have it.\" —Mithrax",
                "ExtLore": "Eliksni Quarter, Last City\n——\n\nWhat makes a House? It is a good question, and one that many Eliksni do not think on often enough.\n\nFor Humans, a house is a place. But for Eliksni, a House is a family. It has a culture. A philosophy of living, shared by all.\n\nThat is why the House of Light survived, even when we fled Europa. Even after the Shipstealer took all we had. We were bound not by place or possessions, but as family.\n\nCryptarch Matsuo asked me why the old crews are not considered Houses. It is a wise question. One that, perhaps, does not have a singular answer. \n\nI think it is because those who lead the old crews do not wish to be true Kells. A Kell is responsible for the safety and prosperity of their House. It is an honor, and a burden.\n\nThose you call Pirate Lords wish only to take—they give nothing, even to their own people. Each raider is responsible only for themselves. A crew is expendable… a family is not.\n\nThe old crews live a sad life. One best left in the past.",
                "itemHash": "1832715717",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/e6a0427545d77a5f8c1783680ed4ed7d.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        }
    }
}