{
    "Location": "European Dead Zone",
    "Planet": "Earth",
    "Landing Zone": "Winding Cove",
    "Week": "November 03, 2023",
    "Exotics": {
        "Exotic Engram": {
            "name": "Exotic Engram",
            "type": "Exotic Engram",
            "description": "An engram with a predestined outcome.\n\nContains a new Exotic if any of the possible rewards remain to be collected. Preview contents for possible rewards.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "3875551374",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/ee21b5bc72f9e48366c9addff163a187.png",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Quest": {
            "name": "Xenology",
            "type": "Exotic Quest Step",
            "description": "Complete Vanguard playlist activities, or win matches in Crucible or Gambit.\n\nExtra progress is awarded for more challenging activities and for succeeding with clanmates.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "2125848607",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/7f9e6e79bb7a8ce59de9258a7d674af2.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Weapon": {
            "name": "Arbalest",
            "type": "Exotic Linear Fusion Rifle",
            "description": "",
            "lore": "\"We didn't have linear fusions in the Dark Age. But we made it work.\" —The Drifter",
            "ExtLore": "\"Nah. Dark Age version was better.\"\n\n\"You and I remember the Dark Age differently.\"\n\n\"I'll take a hard projectile over energy any day. No better way to make sure the target is dead.\"\n\n\"Energy is for silencing barriers. Fists are all I need to administer blunt-force trauma.\"\n\n\"I forget you used to be a Warlord.\"\n\n\"What do you mean 'used to?'\"\n\n\"I thought you'd thrown in with Saladin and Felwinter.\"\n\n\"I did. But I never stopped being me.\"\n\n\"Then why—\"\n\n\"'Warlord' is too many syllables.\"\n\n\"Gambit needs more candidates like you. Should stop by sometime. Whatever you want to call yourself.\"\n\n\"Thank you. You're a liar and a cheat. Stay out of my Crucible.\"",
            "itemHash": "2130065553",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/c95ea75fe09d9f090a88d5322923d07a.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Compounding Force",
                    "description": "Fires slugs that cause massive damage to combatant shields. Strong against [Shield-Piercing] Barrier Champions.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/de617622ec896db7e2e79a2b2cdcb24e.png",
                    "hashID": 2564164194,
                    "weaponHash": 2130065553,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Extended Barrel",
                    "description": "Weighty barrel extension.\n  •  Increases range\n  •  Decreases handling speed\n  •  Moderately controls recoil",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9e5e8fa07a84c29252b78b0e7b3106d.png",
                    "hashID": 1467527085,
                    "weaponHash": 2130065553,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Projection Fuse",
                    "description": "Distance optimizations.\n  •  Increases range",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/eaa6fcec699a88e768782068d5e509e1.png",
                    "hashID": 2969185026,
                    "weaponHash": 2130065553,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Disruption Break",
                    "description": "Breaking an enemy's shield with this weapon makes them more vulnerable to Kinetic damage for a brief period.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/45b57ce27fa0213218c7cb8f2253c517.png",
                    "hashID": 1683379515,
                    "weaponHash": 2130065553,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Composite Stock",
                    "description": "This weapon has a versatile dual-purpose stock.\n  •  Slightly increases stability\n  •  Slightly increases handling speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7c616b3d2d0e97bf8948b1371b3007bb.png",
                    "hashID": 3465198467,
                    "weaponHash": 2130065553,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Kinetic",
            "legendWeaponDamageElement": "Kinetic",
            "masterworkData": null
        },
        "Hawkmoon": {
            "name": "Hawkmoon",
            "type": "Exotic Hand Cannon",
            "description": "",
            "lore": "Stalk thy prey and let loose thy talons upon the Darkness.",
            "ExtLore": "What is this feeling?\n\nI did not ask for it. I do not understand it. I do not want it.\n\nThe Crow is so carefree in his ignorance. The bonfire's glow lights up his pale features and I am drawn to the hope in his gold eyes. Where is the despairing child I anticipated?\n\nHe drinks from an open bottle of wine against the recommendation of his Ghost. The Guardian encourages him and they are laughing. This celebration is maddening; neither have reason to be so jubilant. Their world is ending and they thrash like dying creatures in the final light of collapsing stars. They do not seem to acknowledge the futility of their existence, the impermanence of it in the face of cosmic annihilation.\n\nNow the Guardian is drinking, standing close to the fire. Their Ghost, too, encourages them not to partake. They poison themselves for the enjoyment of it.\n\nI am reminded of my sisters. Of moments spent by lapping shores, gazing up at infinite stars full of possibilities and wonder. I am left yearning.\n\nWhat is this feeling?\n\nI do not understand it. I do not want it.\n\nThey are celebrating their victory over the Taken. The Crow is making a gun shape with his hand, swinging the nearly empty bottle of wine around in the other like a Sword. The Guardian looks pensive, sitting on a rock by the fire, contemplating the secret they are keeping. The Crow notices, but tries not to show it. He wants the Guardian's spirits to be lifted. He wants to be supportive, so that they may share in their triumphs together.\n\nAs equals.\n\nI am reminded of my home. I am reminded of the warmth of the sun and the embrace of my family. I am reminded of my father's face. I am reminded of everyone I betrayed. All the blood spilled in the name of immortality. The warmth of the sun burns me with its memory.\n\nWhat is this feeling?\n\nI do not want it.\n\nThe fire has nearly died. The Crow fell over and cannot stand, though he insists he is fine. The Guardian is turning the embers with the tip of their Sword. The Ghosts are talking to one another in quiet conspiracy. The celebration has ended, but I can sense their emotions are mixed: complex and myriad things, when a simple, singular focus would suffice.\n\nThere is a growing kinship here. Against better judgment.\n\nWhat is this feeling?",
            "itemHash": "3856705927",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/cef1290d58a2d94d1437e1e569fa7996.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Paracausal Shot",
                    "description": "Final blows and precision hits with Hawkmoon grant stacks of Paracausal Charge. The final round in the magazine deals bonus damage based on the number of stacks. Stowing Hawkmoon on the final round removes this bonus.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/243f5529bbd845871803181958599473.png",
                    "hashID": 213689231,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Polygonal Rifling",
                    "description": "Barrel optimized for recoil reduction.\n  •  Increases stability",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7d7aaccee29cf450d4057a9de871cdc8.png",
                    "hashID": 1392496348,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Alloy Magazine",
                    "description": "Faster reloads when the magazine is empty.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/069170916c98748b7b3e33b80bd7d689.png",
                    "hashID": 1431678320,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Quickdraw",
                    "description": "This weapon can be drawn unbelievably fast.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/6893bb2c7ec7d13cb0d91ec9dd8b6500.png",
                    "hashID": 706527188,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Polymer Grip",
                    "description": "This weapon's grip is made of lighter material.\n  •  Increases handling speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/c7111f59ce527eefed89ea29359b2960.png",
                    "hashID": 862848869,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Kinetic",
            "legendWeaponDamageElement": "Kinetic",
            "masterworkData": null
        },
        "Warlock Exotic": {
            "name": "Transversive Steps",
            "type": "Exotic Leg Armor",
            "description": "",
            "lore": "Your relationship with consistent spacetime is...tenuous at best.",
            "ExtLore": "Tell me where you are! Account for Earth's rotation—more than 1000 kilometers per hour—your orbital velocity of 107,000 kph, your local stellar drift of 70,000 kph, your galactic orbital velocity of 792,000 kph, and our galactic drift relative to the cosmic microwave background of 1,300,000 kph. Also, account for your motion relative to me due to the accelerating expansion of space-time. \n\nDifficult, isn't it? But with the help of these handsome noetic devices you will find yourself deliciously and maddeningly aware of your ley velocities! Fired from an existence cannon through a whirling void the size of everything! \n\nAnd like any line of force, these vectors may be tapped, their obscene speeds diverted for your own use, although we recommend swapping them for comfortable boots before you socialize with the Merely Stationary.",
            "itemHash": "138282166",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/5c188812dc0dca96e015d2876e900637.jpg",
            "rarity": "Exotic",
            "class": 2,
            "statRolls": [
                64,
                11,
                2,
                19,
                2,
                16,
                14
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Strange Protractor",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/381a293f45eb74cdd7d4444a3c7ce7ed.png",
                    "desc": "Sprint speed increased. After a short time sprinting, your currently equipped weapon is automatically reloaded."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Hunter Exotic": {
            "name": "Mechaneer's Tricksleeves",
            "type": "Exotic Gauntlets",
            "description": "",
            "lore": "\"This won't end well for one of us. And darling, it won't be me.\" —Self-styled \"Lady\" Olu Alderdice",
            "ExtLore": "Attention, esteemed patrons of the Seven Stars! We are a semi-respectable business here. Until now, we've only had three or four rules, barring any newly invented misdeeds of which we are yet to be made aware. Unfortunately, we are forced to increase our rules by two. \n\nFour (or five): Olu Alderdice is heretofore banned from our establishment. \nFive (or six, who's counting): Alderdice's inventions are also forbidden. Anyone found to be in possession of devices such as, but not limited to, spring-razor petticoats, electrified fascinators, sidearm tricksleeves, or arsenic lipstick will be introduced to our bouncer. Who is a Titan. A very big one. Named Karl. \n\nThank you for your understanding, and please enjoy your stay. Unless you're Olu Alderdice. Go away, Olu.",
            "itemHash": "1734144409",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/cec0919e3c95d134d82f701f2f6b87dd.jpg",
            "rarity": "Exotic",
            "class": 1,
            "statRolls": [
                67,
                4,
                22,
                10,
                15,
                10,
                6
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Spring-Loaded Mounting",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/cbea782469054e260fd336b5222adc23.png",
                    "desc": "Increases Sidearm airborne effectiveness, ready speed, and reload speed. While you're critically wounded, swapping to a Sidearm reloads it and increases its damage. While this effect is active, Sidearm final blows reload the weapon and extend the effect's duration."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Titan Exotic": {
            "name": "Wormgod Caress",
            "type": "Exotic Gauntlets",
            "description": "",
            "lore": "\"Have you ever stared into the green soulfire flame? There is terror, but also… something warm.\"\n—Eris Morn",
            "ExtLore": "II: COMMUNION \n\nHe stood before his gods, humbled. \n\nAn audacious gesture, to seek the deepest knowledge. To know the unknowable, the origin of all things. \n\nThe worms turned, rejecting the disowned son. All but one. \n\n\"In you, I see myself.\" \n\nXol, the Will of the Thousands. Lesser than his kin, but full of dark wisdom. \n\n\"You seek power? I will give you power beyond measure. The power of life renewed.\" \n\nThe glow of soulfire in his eyes, Nokris bowed before the worm. In his fire, he felt embrace. He felt home. \n\n\"Do you pledge yourself to me? Will you accept my unholy power?\" \n\nNokris nodded and smiled. \n\nHe replied, \"Yes, my lord. And together, we will take the stars.\" \n\nXol was pleased.",
            "itemHash": "1734844651",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/3baea5888219c87acd58d177ae70f2c2.jpg",
            "rarity": "Exotic",
            "class": 0,
            "statRolls": [
                63,
                18,
                3,
                11,
                10,
                19,
                2
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Burning Fists",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/89777d9b91d348fc8d24e24edca139ae.png",
                    "desc": "Melee kills increase melee damage for a period of time. Additional kills extend duration and increase effects."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        }
    },
    "Legendaries": {
        "Legendary weapons": [
            {
                "name": "Canis Major",
                "type": "Legendary Grenade Launcher",
                "description": "",
                "lore": "\"The stars roar with violent destruction. Channel their astral rage.\" —Ylaia, Awoken Techeun",
                "ExtLore": "Petra Venj and Ylaia sat together in a courtyard as the waning dusk of the Dreaming City settled in around them.\n\n\"I began the training first,\" Petra explained, \"but I found it—difficult. It didn't come naturally to me. Not like this.\" She nodded toward the grenade launcher sitting beside her. \n\n\"Imar didn't make it any easier. He was one of the oldest, and the only male Techeun I ever met. I never felt like he gave me an honest chance.\" Petra paused to consider. \"Maybe he'd already looked in the future and saw that I'd washed out.\" \n\n\"I didn't know exactly how unsuited I was until my sister started her training,\" Petra continued. \"Right away, Pinar and I began having long conversations inside our dreams. We'd talk all night and wake up with full memories of what we'd said. That was the first time I realized how powerful she'd become.\" \n\nPetra lowered her eyes. \"Of course, Pinar was Imar's favorite. And the more quickly she progressed, the stronger our shared dreams became. It didn't take long before it was more than just talking.\" \n\n\"She began to manipulate the dreams—changing locations or her shape. I couldn't keep up. It was like being a passenger in my own head. Her dreams became my nightmares.\" Petra shook her head, as if dislodging an unwelcome memory. \"That's when I quit the training and the dreams stopped.\" \n\n\"Eventually I found my place in the Corsairs,\" Petra mused, \"but part of me wishes I had finished my training as a Techeun. If I had, maybe I could still find Pinar out there, in a dream somewhere.\" She plucked a blade of grass from between the paving stones and tossed it into the breeze. \n\nAfter a pensive moment, Petra focused again on Ylaia. \"So, my suggestion is to give the training a chance. If it takes, you'll know. And if not,\" she patted the grenade launcher at her side, \"we've got plenty of other jobs for you.\"",
                "itemHash": "2066434718",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/cc48d0afb44de5a61bc9cc44bbc8897e.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Volatile Launch",
                        "description": "This weapon is optimized for an especially explosive payload.\n  •  Greatly increases blast radius\n  •  Slightly decreases handling speed\n  •  Slightly decreases projectile speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d255c9140cf640cfc820f995d1c1e96a.png",
                        "hashID": 1478423395,
                        "weaponHash": 2066434718,
                        "isPerk": true,
                        "isFavorablePerk": true
                    },
                    {
                        "name": "Proximity Grenades",
                        "description": "Grenades fired from this weapon have increased proximity detection but a decreased blast radius.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/2102943d96718ba437952118be346b1b.png",
                        "hashID": 409831596,
                        "weaponHash": 2066434718,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Surplus",
                        "description": "Increases handling, reload speed, and stability for each fully charged ability.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/a4c054c3547840300b9ce7ef11b7b6fc.png",
                        "hashID": 3436462433,
                        "weaponHash": 2066434718,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Adagio",
                        "description": "After defeating a target, this weapon fires, charges, or draws more slowly and deals increased damage for a brief time.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/b344c34bf750a840b24ff5d2f8fe4507.png",
                        "hashID": 3673922083,
                        "weaponHash": 2066434718,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Rapid-Fire Frame",
                    "description": "Deeper ammo reserves. Slightly faster reload when magazine is empty.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/801d62d1f9783bee81d5700c54c24fda.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Blast Radius",
                    "description": "Increases the explosion radius of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/cb114512a0710cab990fb8d5b4af91c6.jpg",
                    "mwHash": 3928770367
                }
            },
            {
                "name": "Jian 7 Rifle",
                "type": "Legendary Pulse Rifle",
                "description": "",
                "lore": "Come, brothers and sisters! Let us make way for the new ruler!",
                "ExtLore": null,
                "itemHash": "1162247618",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/ba32a8a560bc8626723c2a273764a980.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "SRO-37 Ocular",
                        "description": "SUROS ranged combat scope. Long zoom.\n  •  Increases range\n  •  Slightly decreases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/4fda4ccd8f1c5a50af8d45e32f1c6091.png",
                        "hashID": 360593483,
                        "weaponHash": 1162247618,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Extended Mag",
                        "description": "This weapon has a greatly increased magazine size, but reloads much slower.\n  •  Greatly increases magazine size\n  •  Greatly decreases reload speed\n  •  Increases airborne effectiveness",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/66cfea124e24e73cca1ce6370b44ca7e.png",
                        "hashID": 2420895100,
                        "weaponHash": 1162247618,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Grave Robber",
                        "description": "Melee final blows reload this weapon's magazine from reserves.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/043d100167af67d6041719044a033221.png",
                        "hashID": 1631667848,
                        "weaponHash": 1162247618,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Outlaw",
                        "description": "Precision kills greatly decrease reload time.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/382df469a091c33e190ee583b64923e8.png",
                        "hashID": 1168162263,
                        "weaponHash": 1162247618,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Adaptive Frame",
                    "description": "A well-rounded grip, reliable and sturdy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/967fb4abc6ab98f74639d6c08e5f56ee.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            },
            {
                "name": "First In, Last Out",
                "type": "Legendary Shotgun",
                "description": "",
                "lore": "\"I don't know how it works. You just keep taking damage and keep firing.\"",
                "ExtLore": null,
                "itemHash": "3616586446",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/fca47056a3826dcb977a53877c8e9a33.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Full Bore",
                        "description": "Barrel optimized for distance.\n  •  Greatly increases range\n  •  Decreases stability\n  •  Slightly decreases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/40a4bdcf0f5a4e492927f9569eaf529d.png",
                        "hashID": 202670084,
                        "weaponHash": 3616586446,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Assault Mag",
                        "description": "This shotgun's magazine is optimized for quick combat.\n  •  Greatly increases stability\n  •  Increases rate of fire",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/953cfdeb2703978b1ab449b991b98989.png",
                        "hashID": 791862061,
                        "weaponHash": 3616586446,
                        "isPerk": true,
                        "isFavorablePerk": true
                    },
                    {
                        "name": "Hip-Fire Grip",
                        "description": "Increases accuracy, stability, and precision hit targeting when firing from the hip.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/e0265e60a4e29a96adf47a35b898fad4.png",
                        "hashID": 1866048759,
                        "weaponHash": 3616586446,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Opening Shot",
                        "description": "Improved accuracy and range on the opening shot of attack.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/276e8ce23910c6ee2a6b88b076a2004c.png",
                        "hashID": 47981717,
                        "weaponHash": 3616586446,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Pinpoint Slug Frame",
                    "description": "Fires a single-slug round. This weapon's recoil pattern is more predictably vertical.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e9dd736124e8ef94048901a279a5bb18.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Stability",
                    "description": "How much or little recoil you will experience while firing the weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/c345c1b985997a4e2730ea3919b45359.jpg",
                    "mwHash": 1590375901
                }
            },
            {
                "name": "Farewell",
                "type": "Legendary Sidearm",
                "description": "",
                "lore": "\"A peace born from violence is no peace at all.\" —Lady Efrideet",
                "ExtLore": "FLIGHT_RECORDER_LOG // VG777-T // L-221\n\nHG01: —took heavy fire! Jax and Klaid are gone! Cabal dropped out of nowhere; they must have our transponder signals!\n\nVSYS: Vanguard ship, ID code is scrambled. Please reauthenticate.\n\nHG01: We need to make an emergency landing at Venus FOB!\n\nVSYS: Please reauthenticate.\n\nHG01: Five times! I tried reauth five times! Look, I have a damaged jumpship, and I'm escorting a frigate of civilians! Clear me for landing!\n\nVSYS: Clearance denied. Venus Forward Operating Base automated orbital defenses now online. \n\nHG01: No! Turn 'em off!\n\nVSYS: I cannot comply.\n\nHG01: Worthless piece of scrap!\n\nHG01: New plan! Captain Hennek, you still with us?\n\nCC03: Reading you loud and clear, Guardian! What's the plan? Those Cabal cruisers are right behind us!\n\nHG01: I'm sending you new coordinates! We'll make a few short jumps; try to lose them in the Re—\n\nFLIGHT_RECORDER_LOG // VG777-T // L-236\n\nHG01: —still work. Ah, see! Green blinking light means power.\n\nUNK1: This ship will never fly again, Human. What value is there in a flight recorder?\n\nHG01: You never write a journal before?\n\nUNK1: I have. But I fail to see the value.\n\nHG01: Well my options here are to talk to you—and no offense, but you Reefborn are an acquired taste—or talk to that one, and I don't speak Fallen.\n\nUNK2: [untranslated]\n\nHG01: You see what I mean?\n\nUNK1: So you would rather… talk to yourself.\n\nHG01: Now you got it. C'mon, help me disconnect the primary power coupli—\n\nFLIGHT_RECORDER_LOG // VG777-T // L-238\n\nHG01: Been trying to figure out how to word this. Don't know if I'll ever make it back to Earth. The thought of not saying goodbye to you keeps eating away at me.\n\nHG01: I don't know if you're safe. Don't know if you made it out of the City. \n\nHG01: Comms are down, Cabal control the channels. Been trying to get the Awoken to help, but after the whoopin' Oryx gave them, they're reluctant to get between us and the Cabal.\n\nHG01: I miss you so damn much.\n\nHG01: If we see each other again, none of this will matter. I'll complain about Reef cuisine, you'll criticize all my tactical choices, and I'll fall asleep in your arms… None of this'll matter.\n\nHG01: But in case it does, I just—I want you to know I love you. That, even out here beyond the light, I never forgot you.\n\nFLIGHT_RECORDER_LOG // VG777-T // L-239\n\nHG01: We got the old Dead Orbit ship set up as a shelter. Atmospheric controls are still working, heat, radiation shielding seems good. The friendly Fallen out here are real helpful. I thought they were slaves of the Awoken at first, but it's… not like that at all.\n\nHG01: Captain Hennek finally succumbed to his injuries. I was with him when he went. Last thing he said to me was, \"I guess, right now, we're not all that different.\"\n\nHG01: [long silence]\n\nHG01: I wish you were here.\n\nFLIGHT_RECORDER_LOG // VG777-T // L-240\n\n[ENTRY DELETED]\n\nFLIGHT_RECORDER_LOG // VG777-T // L-241\n\n[ENTRY DELETED]\n\nFLIGHT_RECORDER_LOG // VG777-T // L-242\n\nHG01: A Fallen named Kesk is helping me hardwire a linguistic modulator his people built into the flight recorder. Should translate their speech back to me in something I can understand, and then I can run it through the vocal processing heuristics onboard my jumpship to speak back.\n\nHG01: Faster than learning a language I don't have the mouth parts to speak.\n\nFLIGHT_RECORDER_LOG // VG777-T // L-243\n\nHG01: Today was our anniversary. I hope we were looking at the same stars.\n\nFLIGHT_RECORDER_LOG // VG777-T // L-244\n\nHG01: Traveler.\n\nUNK2: <<Great Machine.>>\n\nHG01: Huh. Okay.\n\nHG01: Family.\n\nUNK2: <<Ketch.>>\n\nHG01: Okay, that's where we're hitting a wall. Can we try some root words? We need to build the Fallen database.\n\nUNK2: <<Eliksni.>>\n\nHG01: Right, sorry. Eliksni.\n\nFLIGHT_RECORDER_LOG // VG777-T // L-245\n\n[ENTRY DELETED]\n\nFLIGHT_RECORDER_LOG // VG777-T // L-246\n\nHG01: I had this dream… like a memory of a memory, you know? But I swear, I heard your laugh when I woke up.\n\nHG01: Being Lightless is hard, but it's… it's these little phantom pains that are the hardest.\n\nHG01: I feel like my whole life is a phantom limb. \n\nFLIGHT_RECORDER_LOG // VG777-T // L-247\n\nHG01: Light.\n\nUNK2: Light.\n\nHG01: I'm not sure why I'm surprised by that.\n\nUNK2: <<We are all forged in the Light. It is what we lost.>>\n\nHG01: Yeah.\n\nUNK2: <<We are not all that different now, you and I.>>\n\nHG01: W-why do you say that?\n\nUNK2: <<When we live, it is in the shadow of the life we once had. When we die, it is the end of our story.>>\n\n[Long Silence]\n\nHG01: That… makes sense.\n\nUNK2: <<Many things do, when you take the time to stop and listen. To hear.>>\n\n[Long Silence]\n\nHG01: Dig.\n\nUNK2: <<Dig.>>\n\nFLIGHT_RECORDER_LOG // VG777-T // L-248\n\n[ENTRY DELETED]\n\nFLIGHT_RECORDER_LOG // VG777-T // L-250\n\nHG01: I'm heading back to Earth. The locals agreed to take care of the civilians.\n\nHG01: I don't know if I'll find you, but I can't sit here anymore.\n\nHG01: If I find you, you'll never hear this. But if I don't, and I live… Being here has opened my eyes to a lot of things and I just—I can't fight like this anymore. Not without you. There's an enclave out past the Jovians; pacifists. You'll find me there.\n\nHG01: Kesk will have my Sidearm. I told him to give it to you if you come looking for me. Or… if he finds out you're—gone—to send it to the Vanguard.\n\nHG01: I won't need it anymore.\n\nHG01: All I need is you.\n\n// End Logs",
                "itemHash": "541188001",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/a806e99524f2c9e465aacafb93940e13.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Full Bore",
                        "description": "Barrel optimized for distance.\n  •  Greatly increases range\n  •  Decreases stability\n  •  Slightly decreases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/40a4bdcf0f5a4e492927f9569eaf529d.png",
                        "hashID": 202670084,
                        "weaponHash": 541188001,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Appended Mag",
                        "description": "This weapon's magazine is built for higher capacity.\n  •  Increases magazine size",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9f468cce26fe35d9db413e2f8451127.png",
                        "hashID": 1087426260,
                        "weaponHash": 541188001,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Subsistence",
                        "description": "Defeating targets partially reloads the magazine from reserves.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/eaa8f4295a71bf47df7ffd8599f7af4d.png",
                        "hashID": 1820235745,
                        "weaponHash": 541188001,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Vorpal Weapon",
                        "description": "Increased damage against bosses, vehicles, and Guardians with their Super active.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/bc5130b227ee577f2678ec2d2c97bf4a.png",
                        "hashID": 1546637391,
                        "weaponHash": 541188001,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Lightweight Frame",
                    "description": "Superb handling. Move faster with this weapon equipped.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/6db8cd21c2b3e6fffeb6f111d6c70dd2.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Kinetic",
                "masterworkData": {
                    "name": "Handling",
                    "description": "The speed with which the weapon can be readied and aimed.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/d2e1ab2542f585d025fb4cc1a3885164.jpg",
                    "mwHash": 518224747
                }
            },
            {
                "name": "Honor's Edge",
                "type": "Legendary Sword",
                "description": "",
                "lore": "\"Good leadership requires discernment: the art of finely dividing one subtle thing from another.\" —Executor Hideo",
                "ExtLore": null,
                "itemHash": "2857348871",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/16c176622dfa89b9e79c068dedf4d53c.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Jagged Edge",
                        "description": "Increased damage at the cost of sword ammo.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9a508b43ae6935d68fc5030c90b5b4a.png",
                        "hashID": 3666208348,
                        "weaponHash": 2857348871,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Burst Guard",
                        "description": "Sword Guard has high resistance, but low endurance.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d182dd5e1da7a10583dfb9f65ff026bc.png",
                        "hashID": 3625355092,
                        "weaponHash": 2857348871,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Relentless Strikes",
                        "description": "[Light Attack]  : Landing three light-attack hits within a short time grants Sword ammo.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/ad4bb4c9e36674ca879310b733a6e6a3.png",
                        "hashID": 1749209109,
                        "weaponHash": 2857348871,
                        "isPerk": true,
                        "isFavorablePerk": true
                    },
                    {
                        "name": "En Garde",
                        "description": "Quick attacks immediately after swapping to this sword do additional damage.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7d9da904045e346588634a7b3b82e3f8.png",
                        "hashID": 1685431615,
                        "weaponHash": 2857348871,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Adaptive Frame",
                    "description": "[Heavy Attack]  : Launch a heavy uppercut attack.\nHeavy attacks are stronger with full energy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/967fb4abc6ab98f74639d6c08e5f56ee.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Impact",
                    "description": "Increases the damage inflicted by each round.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/f2354558ad75fb2527155f0f58c2dcc3.jpg",
                    "mwHash": 1486919755
                }
            },
            {
                "name": "Spare Rations",
                "type": "Legendary Hand Cannon",
                "description": "",
                "lore": "Whether times are lean or fat.",
                "ExtLore": null,
                "itemHash": "3236112986",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/1a65db38cd29ed8a340a802642f7e641.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Arrowhead Brake",
                        "description": "Lightly vented barrel.\n  •  Greatly controls recoil\n  •  Increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8f7fb54687aa52a9c2595d90ce9c9417.png",
                        "hashID": 839105230,
                        "weaponHash": 3236112986,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Appended Mag",
                        "description": "This weapon's magazine is built for higher capacity.\n  •  Increases magazine size",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9f468cce26fe35d9db413e2f8451127.png",
                        "hashID": 1087426260,
                        "weaponHash": 3236112986,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Subsistence",
                        "description": "Defeating targets partially reloads the magazine from reserves.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/eaa8f4295a71bf47df7ffd8599f7af4d.png",
                        "hashID": 1820235745,
                        "weaponHash": 3236112986,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Kill Clip",
                        "description": "Reloading after a kill grants increased damage.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0afd4799427004b2d8170ab213a2ef0c.png",
                        "hashID": 1015611457,
                        "weaponHash": 3236112986,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Disaster Plan",
                        "description": "Picking up ammunition increases this weapon's flinch resistance and range, which lasts until it is fired again.\n\nSwords gain a large increase to charge rate instead.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/32fd1da58165d07b35d320e2bd6f0de5.png",
                        "hashID": 1004814308,
                        "weaponHash": 3236112986,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Adaptive Frame",
                    "description": "A well-rounded grip, reliable and sturdy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/967fb4abc6ab98f74639d6c08e5f56ee.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Kinetic",
                "masterworkData": {
                    "name": "Handling",
                    "description": "The speed with which the weapon can be readied and aimed.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/d2e1ab2542f585d025fb4cc1a3885164.jpg",
                    "mwHash": 518224747
                }
            },
            {
                "name": "Outlast",
                "type": "Legendary Pulse Rifle",
                "description": "",
                "lore": "No such word as extinction.",
                "ExtLore": null,
                "itemHash": "1678205741",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/e5f126d88e6a20c2106fbee02777a6df.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Chambered Compensator",
                        "description": "Stable barrel attachment.\n  •  Increases stability\n  •  Moderately controls recoil\n  •  Slightly decreases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0b451cbccc7f11f6aec9c153e59474cb.png",
                        "hashID": 3661387068,
                        "weaponHash": 1678205741,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "High-Caliber Rounds",
                        "description": "Shots from this weapon knock the target back farther.\n  •  Slightly increases range",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/9d1c49edb2d2b24c74067742c09fd5a5.png",
                        "hashID": 1561002382,
                        "weaponHash": 1678205741,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Encore",
                        "description": "Final blows grant a stacking stability, range, and accuracy bonus to this weapon. Precision final blows grant more stacks.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/857b00161b9794fdd62261adf02c6a5e.png",
                        "hashID": 1195158366,
                        "weaponHash": 1678205741,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "High-Impact Reserves",
                        "description": "Rounds at the end of the magazine deal more damage.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/33ed859a08f2ccf643a1ac3c7f201966.png",
                        "hashID": 2213355989,
                        "weaponHash": 1678205741,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Disaster Plan",
                        "description": "Picking up ammunition increases this weapon's flinch resistance and range, which lasts until it is fired again.\n\nSwords gain a large increase to charge rate instead.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/32fd1da58165d07b35d320e2bd6f0de5.png",
                        "hashID": 1004814308,
                        "weaponHash": 1678205741,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Rapid-Fire Frame",
                    "description": "Deeper ammo reserves. Slightly faster reload when magazine is empty.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/801d62d1f9783bee81d5700c54c24fda.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            }
        ],
        "Warlock": {
            "Helmet": {
                "name": "Tusked Allegiance Hood",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"They have succeeded, somehow. But they will succeed no longer.\" —Empress Caiatl",
                "ExtLore": "AGAIN.\n\nSok'tol, Fifth of the Light, felt flame surge through his body as he was resurrected. \n\nHe became aware of many things at once: the altar beneath him. The roaring of Acolytes. The powerful grip on his shoulders, which even now began to crack under the pressure. \n\nAbove him, a trio of Wizards held his Ghost tight, its bleached shell ensnared by ebony tendrils of controlling spellcraft. It pulled against the bonds but could do nothing but look down at him helplessly.\n\nSING OF HER LIES. SPEAK OF HER TRUTHS.\n\nThe voice was everywhere. As Sok'tol strained to sit up, something slammed him down, pounding his chitinous skull into the stone again and again. He screeched as the bony frill surrounding his face splintered and snapped loose. He felt his jaw dislodge, felt his own teeth crush against his face, felt himself crack and shatter.\n\nBlackness. And then—\n\nAGAIN.\n\nAs his shell knit and restored soulfire flowed anew, Sok'tol, Fifth of the Light, shuddered awake. \n\nThe Acolytes roared again. They crowded the altar, surrounded by a haze of green. Sok'tol peered upward at the Ogre pinning him against the altar. \n\nIt tightened its grip on his shoulders, claws crackling with wrathful energy. It shook its massive head, crowned in an emerald corona, and bellowed in a voice that was not its own:\n\nYOUR STRENGTH BECOMES MINE. AS WILL HERS. SPEAK.\n\nSok'tol concentrated the Light in his armored hand and began to form a grenade, but the shrieking Acolytes reached forward and tore his fingers apart in their claws. \n\nSok'tol bared his teeth and hissed up at the Ogre, whose eyes rolled with fury as a blast of soulfire erupted from its mouth. Sok'tol opened his jaws to howl as he was obliterated.\n\nBlackness. And then—\n\nAGAIN.",
                "itemHash": "849255710",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/e7097b6ea281566e88650f842cdf8503.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    50,
                    12,
                    12,
                    2,
                    2,
                    6,
                    16
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Tusked Allegiance Gloves",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"Bonds are forged on the battlefield and broken at the War Table.\" —Empress Caiatl",
                "ExtLore": "Crow was already reloading when the strange Hive's lifeless body crashed to the forest floor.\n\nGlint flew toward the corpse without a word. Crow pretended not to notice and kept walking through the woods. He's been in a mood all day, Glint thought with a static sigh. He could use some time alone.\n\nWhen he reached the Hive, Glint resisted the absurd reflex to scan it for compatibility. Instead, he simply assessed, noting the strong arms that could handle the recoil from heavy weapons; the thick shell, built to absorb all manner of firepower; the remains of a bony shield that sizzled nearby, powerful enough to protect—\n\nThe space next to Glint fluctuated as a bone-white Hive Ghost appeared. \n\nThe two froze warily in midair.\n\n\"Hey,\" the Hive Ghost whispered after a moment. \"It's okay.\" Its voice was surprisingly soft. \n\nIts green eye flickered reassuringly and it began to focus Light.\n\nGlint bobbed unsteadily. Crow was fifty yards off, moving carefully through the trees. \"You shouldn't—\"\n\n\"It'll be all right,\" it said and hovered lower to the ground, pouring Light into the fallen Hive. The surrounding ferns trembled with the sudden flow of energy.\n\n\"Wait,\" Glint pressed. But the Ghost ignored him as the thick armor of the Hive began to reform. \n\n\"Crow!\" Glint screamed, \"Crow, here!\" And he flew to him without turning back.",
                "itemHash": "119228495",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/3e0ff00101a33efc01a3f2a566ba7967.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    51,
                    13,
                    14,
                    2,
                    2,
                    10,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Tusked Allegiance Robes",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"Were the Light a glory to be earned, the Cabal would have claimed it long ago.\" —Empress Caiatl",
                "ExtLore": "Mithrax delicately pushed the low curtain aside as he entered the bedroom.\n\nTall shelves crowded him, cluttered with relics from Mercury and beyond: piles of intricate scrolls, silver hourglasses that turned of their own accord, ceramic pots of red soil sprouting delicate metallic vines beneath glass domes. An enormous feathered mantle was mounted carefully on a wooden stand and crowned with a birdlike cowl.\n\nThe hulking form of Saint-14 sat in a wooden chair facing the bed where, impossibly small beneath the blankets, rested the man known as Osiris.\n\nMithrax rapped politely on the doorframe.\n\n\"My friend,\" Saint-14 said. \"It is good of you to come.\"\n\nMithrax approached Saint and bowed. \"It is an honor to be invited,\" he said. \"These visits are pleasant to me.\" \n\nHe held out the covered dish he was carrying in his lower arms, but Saint's eyes remained fixed on Osiris. \n\nThe Titan took a ragged breath. His voice was a hoarse whisper: \"Could the Psion machine… connect my mind with his? So that I might share his dreams?\"\n\nMithrax felt useless. He spoke softly: \"The Psion tells me the subject must have residual activity for a reading, and Osiris has been asleep very long. Besides, the connection you seek joins the Light of one being to the Light of another, and Osiris is—\"\n\n\"Lightless, yes,\" Saint finished flatly. He leaned forward in his chair, his elbows on his knees, hands clasped before him. He was silent for some time.\n\n\"I will let him sleep alone,\" Saint finally said, and caressed Osiris's hand with impossible tenderness. \"When he wakes, we will dream together once more.\"\n\nHe adjusted the blankets, stood, and nodded toward the covered dish Mithrax still clutched awkwardly.\n\n\"I am hoping that is not more eggplant,\" he said.\n\nMithrax coughed on his Ether. \"The eggplant is most nourishing,\" he protested weakly, and Saint groaned.",
                "itemHash": "3465627817",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/4f759538d3ba46c507322c1815dd600c.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    49,
                    12,
                    10,
                    2,
                    13,
                    6,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Tusked Allegiance Boots",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"We stand with the Vanguard. No outside force will break what we have wrought.\" —Empress Caiatl",
                "ExtLore": "Bask materialized near a low wall and zipped to where Jolur had collapsed. The Ghost began to focus his Light when incoming fire sent him spinning to the ground.\n\n\"What did I tell you about dying in the open?\" the little Ghost cried in frustration. Determined, he rose into the air, but the Hive Knight was already charging across the Trostland cobblestones.\n\nA sudden explosion of Void energy took the Knight by surprise, but it dodged the pulsing shockwaves of a Vortex Grenade. A tall Warlock in a worn green robe loped from the treeline and slid to a stop before Bask. She hastily formed a ball of Light in her palm and slammed it into the ground. Delicate wisps of energy began to rise from the soil.\n\n\"That's not gonna help!\" Bask whirred angrily.\n\nThe Warlock stood, sheltering Bask with her body as he resumed his focus on Jolur. The Knight screeched and resumed fire. A volley of Shredder bolts doubled the Warlock over, but the energy seeping from the rift gave her the strength to keep standing. \n\n\"Thanks,\" said Bask sheepishly.\n\n\"Don't mention it,\" she said, gritting her teeth through the gunfire. \n\nA blinding burst of energy surged as Jolur rose to his feet, body shimmering with Light. He braced himself and lobbed an orb of unstable energy that reduced the Knight to howling ash on impact. \n\n\"Appreciate the assist,\" Jolur said to Bask and the Warlock as he brushed dirt from his decrepit boots. \"These guys are stronger than I thought, but it's nothing a Nova Bomb can't handle.\"\n\nThe Warlock inspected the damage to her robe. \"What's going on with these Hive?\"\n\n\"I don't know,\" Jolur said. \"Lord Saladin sent a group of us down to figure out—\"\n\nAnother blinding burst of energy surged nearby. The Knight rose to its feet, body shimmering with Light. \n\nThe Guardians stood frozen in horror. \n\n\"Since when can they do that?\" Bask squeaked, and the fight began in earnest.",
                "itemHash": "693728753",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/f7638b226147c43475a06cc6e1f003d2.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    58,
                    2,
                    16,
                    16,
                    6,
                    6,
                    12
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Tusked Allegiance Bond",
                "type": "Legendary Warlock Bond",
                "description": "",
                "lore": "\"I do not sit and theologize my enemies. I crush them.\" —Empress Caiatl",
                "ExtLore": "The huddled Guardians fell into shocked silence as Commander Zavala's silhouette loomed over the table.\n\nA hooded figure sat, suddenly enveloped by the shadow, and leaned backward until his head bumped against Zavala's chestplate. He tilted his chin up and craned his neck to fix Zavala with an upside-down smile. \n\nHis hood fell back. \"What's with the face, Big Blue?\" Drifter said. \"Somebody's gotta teach 'em how to play offense.\"\n\n\"Get this out of my Tower.\" There was iron in the Titan's voice. \n\nAn old fear split Drifter's face. He leaned forward, swept the contents of the table into his knapsack—tangled cables, a red lens, shards of bone, a green eye spinning madly in a jar of thick fluid—and left without a word.",
                "itemHash": "950963812",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/457b307063a9288302b412ea4765aaa5.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Hunter": {
            "Helmet": {
                "name": "Tusked Allegiance Mask",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"When I look at them, I see myself staring back.\" —Crow",
                "ExtLore": "AGAIN.\n\nSok'tol, Fifth of the Light, felt flame surge through his body as he was resurrected. \n\nHe became aware of many things at once: the altar beneath him. The roaring of Acolytes. The powerful grip on his shoulders, which even now began to crack under the pressure. \n\nAbove him, a trio of Wizards held his Ghost tight, its bleached shell ensnared by ebony tendrils of controlling spellcraft. It pulled against the bonds but could do nothing but look down at him helplessly.\n\nSING OF HER LIES. SPEAK OF HER TRUTHS.\n\nThe voice was everywhere. As Sok'tol strained to sit up, something slammed him down, pounding his chitinous skull into the stone again and again. He screeched as the bony frill surrounding his face splintered and snapped loose. He felt his jaw dislodge, felt his own teeth crush against his face, felt himself crack and shatter.\n\nBlackness. And then—\n\nAGAIN.\n\nAs his shell knit and restored soulfire flowed anew, Sok'tol, Fifth of the Light, shuddered awake. \n\nThe Acolytes roared again. They crowded the altar, surrounded by a haze of green. Sok'tol peered upward at the Ogre pinning him against the altar. \n\nIt tightened its grip on his shoulders, claws crackling with wrathful energy. It shook its massive head, crowned in an emerald corona, and bellowed in a voice that was not its own:\n\nYOUR STRENGTH BECOMES MINE. AS WILL HERS. SPEAK.\n\nSok'tol concentrated the Light in his armored hand and began to form a grenade, but the shrieking Acolytes reached forward and tore his fingers apart in their claws. \n\nSok'tol bared his teeth and hissed up at the Ogre, whose eyes rolled with fury as a blast of soulfire erupted from its mouth. Sok'tol opened his jaws to howl as he was obliterated.\n\nBlackness. And then—\n\nAGAIN.",
                "itemHash": "2516879931",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/f7f72ef0ff0d0c30ea5e969a14255989.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    50,
                    22,
                    2,
                    2,
                    6,
                    12,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Tusked Allegiance Grips",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"I don't think any of us will be the same when this is over.\" —Crow",
                "ExtLore": "Crow was already reloading when the strange Hive's lifeless body crashed to the forest floor.\n\nGlint flew toward the corpse without a word. Crow pretended not to notice and kept walking through the woods. He's been in a mood all day, Glint thought with a static sigh. He could use some time alone.\n\nWhen he reached the Hive, Glint resisted the absurd reflex to scan it for compatibility. Instead, he simply assessed, noting the strong arms that could handle the recoil from heavy weapons; the thick shell, built to absorb all manner of firepower; the remains of a bony shield that sizzled nearby, powerful enough to protect—\n\nThe space next to Glint fluctuated as a bone-white Hive Ghost appeared. \n\nThe two froze warily in midair.\n\n\"Hey,\" the Hive Ghost whispered after a moment. \"It's okay.\" Its voice was surprisingly soft. \n\nIts green eye flickered reassuringly and it began to focus Light.\n\nGlint bobbed unsteadily. Crow was fifty yards off, moving carefully through the trees. \"You shouldn't—\"\n\n\"It'll be all right,\" it said and hovered lower to the ground, pouring Light into the fallen Hive. The surrounding ferns trembled with the sudden flow of energy.\n\n\"Wait,\" Glint pressed. But the Ghost ignored him as the thick armor of the Hive began to reform. \n\n\"Crow!\" Glint screamed, \"Crow, here!\" And he flew to him without turning back.",
                "itemHash": "4017738218",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/21463c93480b72d7f14fa70d115a6d96.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    53,
                    2,
                    26,
                    2,
                    7,
                    6,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Tusked Allegiance Vest",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"If they're truly worthy, if it's something they deserve, let them prove it.\" —Crow",
                "ExtLore": "Mithrax delicately pushed the low curtain aside as he entered the bedroom.\n\nTall shelves crowded him, cluttered with relics from Mercury and beyond: piles of intricate scrolls, silver hourglasses that turned of their own accord, ceramic pots of red soil sprouting delicate metallic vines beneath glass domes. An enormous feathered mantle was mounted carefully on a wooden stand and crowned with a birdlike cowl.\n\nThe hulking form of Saint-14 sat in a wooden chair facing the bed where, impossibly small beneath the blankets, rested the man known as Osiris.\n\nMithrax rapped politely on the doorframe.\n\n\"My friend,\" Saint-14 said. \"It is good of you to come.\"\n\nMithrax approached Saint and bowed. \"It is an honor to be invited,\" he said. \"These visits are pleasant to me.\" \n\nHe held out the covered dish he was carrying in his lower arms, but Saint's eyes remained fixed on Osiris. \n\nThe Titan took a ragged breath. His voice was a hoarse whisper: \"Could the Psion machine… connect my mind with his? So that I might share his dreams?\"\n\nMithrax felt useless. He spoke softly: \"The Psion tells me the subject must have residual activity for a reading, and Osiris has been asleep very long. Besides, the connection you seek joins the Light of one being to the Light of another, and Osiris is—\"\n\n\"Lightless, yes,\" Saint finished flatly. He leaned forward in his chair, his elbows on his knees, hands clasped before him. He was silent for some time.\n\n\"I will let him sleep alone,\" Saint finally said, and caressed Osiris's hand with impossible tenderness. \"When he wakes, we will dream together once more.\"\n\nHe adjusted the blankets, stood, and nodded toward the covered dish Mithrax still clutched awkwardly.\n\n\"I am hoping that is not more eggplant,\" he said.\n\nMithrax coughed on his Ether. \"The eggplant is most nourishing,\" he protested weakly, and Saint groaned.",
                "itemHash": "4144240158",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/57a1ac7b1e162af422488d4971c5636b.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    56,
                    2,
                    2,
                    24,
                    2,
                    6,
                    20
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Tusked Allegiance Strides",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"Glint says to keep moving. That's how you know something's wrong.\" —Crow",
                "ExtLore": "Bask materialized near a low wall and zipped to where Jolur had collapsed. The Ghost began to focus his Light when incoming fire sent him spinning to the ground.\n\n\"What did I tell you about dying in the open?\" the little Ghost cried in frustration. Determined, he rose into the air, but the Hive Knight was already charging across the Trostland cobblestones.\n\nA sudden explosion of Void energy took the Knight by surprise, but it dodged the pulsing shockwaves of a Vortex Grenade. A tall Warlock in a worn green robe loped from the treeline and slid to a stop before Bask. She hastily formed a ball of Light in her palm and slammed it into the ground. Delicate wisps of energy began to rise from the soil.\n\n\"That's not gonna help!\" Bask whirred angrily.\n\nThe Warlock stood, sheltering Bask with her body as he resumed his focus on Jolur. The Knight screeched and resumed fire. A volley of Shredder bolts doubled the Warlock over, but the energy seeping from the rift gave her the strength to keep standing. \n\n\"Thanks,\" said Bask sheepishly.\n\n\"Don't mention it,\" she said, gritting her teeth through the gunfire. \n\nA blinding burst of energy surged as Jolur rose to his feet, body shimmering with Light. He braced himself and lobbed an orb of unstable energy that reduced the Knight to howling ash on impact. \n\n\"Appreciate the assist,\" Jolur said to Bask and the Warlock as he brushed dirt from his decrepit boots. \"These guys are stronger than I thought, but it's nothing a Nova Bomb can't handle.\"\n\nThe Warlock inspected the damage to her robe. \"What's going on with these Hive?\"\n\n\"I don't know,\" Jolur said. \"Lord Saladin sent a group of us down to figure out—\"\n\nAnother blinding burst of energy surged nearby. The Knight rose to its feet, body shimmering with Light. \n\nThe Guardians stood frozen in horror. \n\n\"Since when can they do that?\" Bask squeaked, and the fight began in earnest.",
                "itemHash": "3056950148",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/03ee144f86b30edff12b0145369ecf7d.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    48,
                    2,
                    12,
                    12,
                    6,
                    6,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Tusked Allegiance Cloak",
                "type": "Legendary Hunter Cloak",
                "description": "",
                "lore": "\"You'd think I'd understand it better than anyone, right? But I don't understand anything anymore.\" —Crow",
                "ExtLore": "The huddled Guardians fell into shocked silence as Commander Zavala's silhouette loomed over the table.\n\nA hooded figure sat, suddenly enveloped by the shadow, and leaned backward until his head bumped against Zavala's chestplate. He tilted his chin up and craned his neck to fix Zavala with an upside-down smile. \n\nHis hood fell back. \"What's with the face, Big Blue?\" Drifter said. \"Somebody's gotta teach 'em how to play offense.\"\n\n\"Get this out of my Tower.\" There was iron in the Titan's voice. \n\nAn old fear split Drifter's face. He leaned forward, swept the contents of the table into his knapsack—tangled cables, a red lens, shards of bone, a green eye spinning madly in a jar of thick fluid—and left without a word.",
                "itemHash": "3473867303",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/134b2ae9d4b66556fcfd2c99818a3b33.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Titan": {
            "Helmet": {
                "name": "Tusked Allegiance Helmet",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"They are an insult, a stain that's our duty to wash away.\" —Lord Saladin",
                "ExtLore": "AGAIN.\n\nSok'tol, Fifth of the Light, felt flame surge through his body as he was resurrected. \n\nHe became aware of many things at once: the altar beneath him. The roaring of Acolytes. The powerful grip on his shoulders, which even now began to crack under the pressure. \n\nAbove him, a trio of Wizards held his Ghost tight, its bleached shell ensnared by ebony tendrils of controlling spellcraft. It pulled against the bonds but could do nothing but look down at him helplessly.\n\nSING OF HER LIES. SPEAK OF HER TRUTHS.\n\nThe voice was everywhere. As Sok'tol strained to sit up, something slammed him down, pounding his chitinous skull into the stone again and again. He screeched as the bony frill surrounding his face splintered and snapped loose. He felt his jaw dislodge, felt his own teeth crush against his face, felt himself crack and shatter.\n\nBlackness. And then—\n\nAGAIN.\n\nAs his shell knit and restored soulfire flowed anew, Sok'tol, Fifth of the Light, shuddered awake. \n\nThe Acolytes roared again. They crowded the altar, surrounded by a haze of green. Sok'tol peered upward at the Ogre pinning him against the altar. \n\nIt tightened its grip on his shoulders, claws crackling with wrathful energy. It shook its massive head, crowned in an emerald corona, and bellowed in a voice that was not its own:\n\nYOUR STRENGTH BECOMES MINE. AS WILL HERS. SPEAK.\n\nSok'tol concentrated the Light in his armored hand and began to form a grenade, but the shrieking Acolytes reached forward and tore his fingers apart in their claws. \n\nSok'tol bared his teeth and hissed up at the Ogre, whose eyes rolled with fury as a blast of soulfire erupted from its mouth. Sok'tol opened his jaws to howl as he was obliterated.\n\nBlackness. And then—\n\nAGAIN.",
                "itemHash": "2240729575",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/23954718ed9aa6ba9492681459c14ee8.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    54,
                    2,
                    7,
                    18,
                    2,
                    6,
                    19
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Tusked Allegiance Gauntlets",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"If this is a test, we shall not fail.\" —Lord Saladin",
                "ExtLore": "Crow was already reloading when the strange Hive's lifeless body crashed to the forest floor.\n\nGlint flew toward the corpse without a word. Crow pretended not to notice and kept walking through the woods. He's been in a mood all day, Glint thought with a static sigh. He could use some time alone.\n\nWhen he reached the Hive, Glint resisted the absurd reflex to scan it for compatibility. Instead, he simply assessed, noting the strong arms that could handle the recoil from heavy weapons; the thick shell, built to absorb all manner of firepower; the remains of a bony shield that sizzled nearby, powerful enough to protect—\n\nThe space next to Glint fluctuated as a bone-white Hive Ghost appeared. \n\nThe two froze warily in midair.\n\n\"Hey,\" the Hive Ghost whispered after a moment. \"It's okay.\" Its voice was surprisingly soft. \n\nIts green eye flickered reassuringly and it began to focus Light.\n\nGlint bobbed unsteadily. Crow was fifty yards off, moving carefully through the trees. \"You shouldn't—\"\n\n\"It'll be all right,\" it said and hovered lower to the ground, pouring Light into the fallen Hive. The surrounding ferns trembled with the sudden flow of energy.\n\n\"Wait,\" Glint pressed. But the Ghost ignored him as the thick armor of the Hive began to reform. \n\n\"Crow!\" Glint screamed, \"Crow, here!\" And he flew to him without turning back.",
                "itemHash": "187431790",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/0f07426e4f17715342eecb3b574d41f1.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    51,
                    18,
                    2,
                    6,
                    6,
                    13,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Tusked Allegiance Plate",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"I believed not that the Light was good, but that there is goodness in those who defend it. I still do.\" —Lord Saladin",
                "ExtLore": "Mithrax delicately pushed the low curtain aside as he entered the bedroom.\n\nTall shelves crowded him, cluttered with relics from Mercury and beyond: piles of intricate scrolls, silver hourglasses that turned of their own accord, ceramic pots of red soil sprouting delicate metallic vines beneath glass domes. An enormous feathered mantle was mounted carefully on a wooden stand and crowned with a birdlike cowl.\n\nThe hulking form of Saint-14 sat in a wooden chair facing the bed where, impossibly small beneath the blankets, rested the man known as Osiris.\n\nMithrax rapped politely on the doorframe.\n\n\"My friend,\" Saint-14 said. \"It is good of you to come.\"\n\nMithrax approached Saint and bowed. \"It is an honor to be invited,\" he said. \"These visits are pleasant to me.\" \n\nHe held out the covered dish he was carrying in his lower arms, but Saint's eyes remained fixed on Osiris. \n\nThe Titan took a ragged breath. His voice was a hoarse whisper: \"Could the Psion machine… connect my mind with his? So that I might share his dreams?\"\n\nMithrax felt useless. He spoke softly: \"The Psion tells me the subject must have residual activity for a reading, and Osiris has been asleep very long. Besides, the connection you seek joins the Light of one being to the Light of another, and Osiris is—\"\n\n\"Lightless, yes,\" Saint finished flatly. He leaned forward in his chair, his elbows on his knees, hands clasped before him. He was silent for some time.\n\n\"I will let him sleep alone,\" Saint finally said, and caressed Osiris's hand with impossible tenderness. \"When he wakes, we will dream together once more.\"\n\nHe adjusted the blankets, stood, and nodded toward the covered dish Mithrax still clutched awkwardly.\n\n\"I am hoping that is not more eggplant,\" he said.\n\nMithrax coughed on his Ether. \"The eggplant is most nourishing,\" he protested weakly, and Saint groaned.",
                "itemHash": "438108034",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/4762f1467aece59fc478edfa285144cc.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    53,
                    2,
                    2,
                    22,
                    15,
                    6,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Tusked Allegiance Greaves",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"Meet them head-on. Let us see whose Light burns more brightly.\" —Lord Saladin",
                "ExtLore": "Bask materialized near a low wall and zipped to where Jolur had collapsed. The Ghost began to focus his Light when incoming fire sent him spinning to the ground.\n\n\"What did I tell you about dying in the open?\" the little Ghost cried in frustration. Determined, he rose into the air, but the Hive Knight was already charging across the Trostland cobblestones.\n\nA sudden explosion of Void energy took the Knight by surprise, but it dodged the pulsing shockwaves of a Vortex Grenade. A tall Warlock in a worn green robe loped from the treeline and slid to a stop before Bask. She hastily formed a ball of Light in her palm and slammed it into the ground. Delicate wisps of energy began to rise from the soil.\n\n\"That's not gonna help!\" Bask whirred angrily.\n\nThe Warlock stood, sheltering Bask with her body as he resumed his focus on Jolur. The Knight screeched and resumed fire. A volley of Shredder bolts doubled the Warlock over, but the energy seeping from the rift gave her the strength to keep standing. \n\n\"Thanks,\" said Bask sheepishly.\n\n\"Don't mention it,\" she said, gritting her teeth through the gunfire. \n\nA blinding burst of energy surged as Jolur rose to his feet, body shimmering with Light. He braced himself and lobbed an orb of unstable energy that reduced the Knight to howling ash on impact. \n\n\"Appreciate the assist,\" Jolur said to Bask and the Warlock as he brushed dirt from his decrepit boots. \"These guys are stronger than I thought, but it's nothing a Nova Bomb can't handle.\"\n\nThe Warlock inspected the damage to her robe. \"What's going on with these Hive?\"\n\n\"I don't know,\" Jolur said. \"Lord Saladin sent a group of us down to figure out—\"\n\nAnother blinding burst of energy surged nearby. The Knight rose to its feet, body shimmering with Light. \n\nThe Guardians stood frozen in horror. \n\n\"Since when can they do that?\" Bask squeaked, and the fight began in earnest.",
                "itemHash": "2270509928",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/2c0d349554351d23362619553233063d.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    50,
                    2,
                    14,
                    10,
                    2,
                    10,
                    12
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Tusked Allegiance Mark",
                "type": "Legendary Titan Mark",
                "description": "",
                "lore": "\"We are what we survive. They will not be the Guardians.\" —Lord Saladin",
                "ExtLore": "The huddled Guardians fell into shocked silence as Commander Zavala's silhouette loomed over the table.\n\nA hooded figure sat, suddenly enveloped by the shadow, and leaned backward until his head bumped against Zavala's chestplate. He tilted his chin up and craned his neck to fix Zavala with an upside-down smile. \n\nHis hood fell back. \"What's with the face, Big Blue?\" Drifter said. \"Somebody's gotta teach 'em how to play offense.\"\n\n\"Get this out of my Tower.\" There was iron in the Titan's voice. \n\nAn old fear split Drifter's face. He leaned forward, swept the contents of the table into his knapsack—tangled cables, a red lens, shards of bone, a green eye spinning madly in a jar of thick fluid—and left without a word.",
                "itemHash": "3957071315",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/651d6c3389e45449d7730702fb9b265a.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        }
    }
}