{
    "Location": "The Last City",
    "Planet": "Earth",
    "Landing Zone": "Tower Hangar",
    "Week": "June 08, 2024",
    "Catalysts": {
        "Primary": {
            "name": "Jötunn Catalyst",
            "type": "Exotic Catalyst",
            "description": "Upgrades this weapon to a Masterwork. Once upgraded, the weapon will obtain enhanced capabilities, such as increased stats and/or additional perks.\n\nDefeat targets using this weapon to unlock this upgrade.",
            "itemHash": "862513617",
            "icon": "https://www.bungie.net/common/destiny2_content/icons/0fe10511fa234ae3432f51d608a6abd2.jpg",
            "rarity": "Exotic"
        },
        "Secondary": {
            "name": "Sunshot Catalyst",
            "type": "Exotic Catalyst",
            "description": "When upgraded to a Masterwork, this weapon will obtain enhanced capabilities, such as increased stats and/or additional perks.",
            "itemHash": "1824496861",
            "icon": "https://www.bungie.net/common/destiny2_content/icons/4a37bd1fc1756b09f509396557937832.jpg",
            "rarity": "Exotic"
        }
    },
    "Exotics": {
        "Exotic Engram": {
            "name": "Exotic Engram",
            "type": "Exotic Engram",
            "description": "An engram with a predestined outcome.\n\nContains a new Exotic if any of the possible rewards remain to be collected. Preview contents for possible rewards.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "3875551374",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/ee21b5bc72f9e48366c9addff163a187.png",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Quest": {
            "name": "Xenology",
            "type": "Exotic Quest Step",
            "description": "Complete Vanguard playlist activities, or win matches in Crucible or Gambit.\n\nExtra progress is awarded for more challenging activities and for succeeding with clanmates.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "2125848607",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/7f9e6e79bb7a8ce59de9258a7d674af2.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Weapon": null,
        "Hawkmoon": null,
        "Warlock Exotic": {
            "name": "Verity's Brow",
            "type": "Exotic Helmet",
            "description": "",
            "lore": "\"The Hive do not see how we see. They look beyond, into the infinite. Into the dark.\"\n\n—Eris Morn",
            "ExtLore": "III: HERETIC \n\nThe Demon King's fury shook the heavens. \n\nIt was unforgivable. Oryx had communed with, consumed the worm. He was king. For Nokris to perform such a ritual was sacrilege. And to defy the Sword Logic? Heresy. \n\nNokris was cast out, his name removed from the World's Grave, the Books of Sorrow. In the king's rage, all memory of the unfavored son was obscured, all but one statue, defiant in its permanence. \n\nYet the unfavored son felt a calm. Removed from his father's kingdom, he was free. He would do what the Demon King could not. He would make his mark upon the universe. \n\nXol turned his dreadful eye to his priest. \n\n“Hear me, o dreadful worm. We will raise an army. We will die and be reborn in your name, feed you the souls of our enemies.\" \n\n\"State your claim.\" \n\n\"We take Mars.\"",
            "itemHash": "2428181146",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/e3a0690cafbf8109a34231f70476c8a0.jpg",
            "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/2428181146.jpg",
            "rarity": "Exotic",
            "class": 2,
            "statRolls": [
                66,
                10,
                12,
                12,
                10,
                20,
                2
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "The Fourth Magic",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/9732f284c71054229671287ab43444b7.png",
                    "desc": "Weapon final blows with a damage type matching your grenade grant Death Throes, which provide a grenade damage bonus and grant you grenade energy. When you have Death Throes and throw a grenade, nearby allies gain greatly increased grenade regeneration for a short time."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Hunter Exotic": {
            "name": "Raiju's Harness",
            "type": "Exotic Chest Armor",
            "description": "",
            "lore": "To tame that which knows no master, one must bear the storm.",
            "ExtLore": "Tohr sat atop a storm-shrouded hill, surrounded in distance by sea and mist. The Maelstrom hung overhead, birthed from Tohr's relinquishment. It had raged for years, just as it did before when Tohr had claimed the reigns and issued his challenge to Raiju's Maelstrom. \n\nClouds trundled at the storm's edge and forked bolts split through a central cumulonimbus supercell. Strikes of gnarled charge nipped scorch into the dirt with terrifying frequency as the sky rippled with lightning. Tohr's withered husk remained in meditative stillness, long dead, basking in the metronomic glow of each flashing termination. The armor around his corpse let slip a glint of light, pulsing like a guiding bannerette for thrill seekers. It had caught Tyv Lucine's eye many times.\n\nShe watched from the base, attempting to establish a safe route through the scattered fulmination. Salt-blasted dirt gave way underfoot, in places, while spindles of thatch-work glass weave held strong against her weight in others. She could feel static flow through the network of crystalline connections like conduits aching to reach out and touch the storm. Her Light shivered, welcoming the Arc surges that leapt up metal clasps on her boots, and she threw herself to another glossy foothold as a bolt dove to meet ground.\n\nThe Maelstrom calmed as she reached Tohr's body. A staff lay at his feet. The air was a screen of charged pressure around him, but Tyv knew how to find gaps. She knew how to bend away the lightning and loop Arc into itself. Lessons the Light had taught her. She slipped her hand through the barrier and lifted the plate from Tohr. She inhaled ozone and humidity and slid the Harness onto her shoulders.\n\nRoars thundered from overhead and bolts scattered across Tohr's hill. Tyv swept the staff off the ground and drove her Arc-Light into its form. The reigns were in hand; the challenge issued. She would bend the storm, and live as lightning made flesh.\n\n\n-Raiju's Legacy",
            "itemHash": "2268523867",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/fdc99d915e90a5992549ebe33c85d2c9.jpg",
            "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/2268523867.jpg",
            "rarity": "Exotic",
            "class": 1,
            "statRolls": [
                62,
                2,
                6,
                25,
                9,
                18,
                2
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Mobius Conduit",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/6db788a7e92c10f7f7ee3daddce16cba.png",
                    "desc": "[Super]  : Deactivate Arc Staff early to create a blinding explosion and gain a temporary boost to Arc weapon damage. Arc Staff consumes energy more slowly when not attacking."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Titan Exotic": {
            "name": "Lion Rampant",
            "type": "Exotic Leg Armor",
            "description": "",
            "lore": "All expect that you should rouse yourself, as did the former lions of your blood.",
            "ExtLore": "\"O, lion! Stretch your wicked claws toward the stars and rend a hole in the sky itself! Let the stars cascade down around you. Leap high and tear again at the night! Rip every fearful comet and burning meteor out of the cosmos and swim in that ocean of light! Drink deep of it. Grow powerful. Carve pathways through the unknown, o defender! O enforcer from on-high!\" \n\n—Traditional Titan meditation",
            "itemHash": "3539357318",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/f649b50eed6a4e4c329ae1667ba6d32b.jpg",
            "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/3539357318.jpg",
            "rarity": "Exotic",
            "class": 0,
            "statRolls": [
                66,
                6,
                8,
                20,
                7,
                10,
                15
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Jump Jets",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/7b334c8fca87e908ccea8fbe4c6af68f.png",
                    "desc": "Provides additional aerial maneuverability and enables accurate hipfire while you're in the air during Lift. Provides a large benefit to the airborne effectiveness stat of all weapons while hipfiring."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        }
    },
    "Legendaries": {
        "Legendary weapons": [],
        "Warlock": {
            "Helmet": {
                "name": "Opulent Scholar Hood",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"I have foreseen the victories that your wisdom shall win in my name. Over and over.\" —Emperor Calus",
                "ExtLore": "MCXXVI, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth recommend to the Emperor Calus a new Shadow of the Hive.\n\nThe Shadow of Earth came to the Emperor and said: \"Your laughing majesty, you have said that the Hive would cast a weak Shadow, and you were, as in all things, correct. But what if I told you that there is one who could cast a Hive-like shadow, with all its attendant majesty, but who is not herself Hive and therefore free of their tragic hunger?\"\n\nThe Emperor said, \"Show me this person, and I will lavish upon her all the gifts of the Shadows.\"\n\nSo the Shadow of Earth sought out Eris Morn, a Human with Acolyte eyes and the majesty of a Hive Queen in her calcified heart, and said: \"Eris Morn, True Queen of the Hive, I know one who can reteach you how to feel joy.\"\n\nEris Morn said, \"What are you saying? I am no Queen of the Hive. My sworn purpose is to defeat the Hive and the progenitors which spawned them.\"\n\nThe Shadow said, \"But what of your Acolyte eyes?\"\n\nAnd Eris Morn said, \"In my darkest hours I had no choice but to avail myself of my enemy's tools.\"\n\nThe Shadow said, \"So you are neither Hive Queen nor Hive God?\"\n\nEris Morn said, \"Neither am I.\"\n\nAnd the Shadow said, \"But could you be?\"\n\nAnd Eris Morn said, \"Yea, could I.\"^\n\n\n\n^ Note to Underscribe Shipal: While the broad arc and shape of time's arrow is known only to our revelatory majesty, and our humble duty merely to add texture to its form, I do enjoin upon you to make more effort than you are showing here. The characterization seems suspect and the dialogue is grossly wanting. Delete this footnote upon the rectification of this error. +\n\n+ Note from Scribe Savat: I see no reason for Scribe Shagac's harshness. I have closely studied the texts of the Sol System and of the Hive, and in my halls of learning Eris Morn's villainy is widely accepted. Therefore I deem this prediction's accuracy to be unimpeachable.",
                "itemHash": "164194947",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/a3b2fbc6933915736ed76f94b2d25482.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/164194947.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    68,
                    16,
                    16,
                    2,
                    6,
                    12,
                    16
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Opulent Scholar Gloves",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"I have foreseen the work that will bring this system together. I'll need your wisdom.\" —Emperor Calus",
                "ExtLore": "MCXIX, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth recommend to the Emperor Calus a Shadow of the Exo.\n\nThe Shadow of Earth went to the Emperor and said, \"My good and bountiful pater, I am your Shadow of Earth, and my companion Petra Venj is the Shadow of the Awoken. Yet the Awoken trace their distant origins to Earth.\"\n\nThe Emperor said, \"My good Shadow, you are right,\" and he cut down Petra Venj where she stood.\n\nThen the Shadow said: \"My luxuriant majesty, I meant to increase your Shadows, not decrease them. For as the Awoken hail from Earth but are their own people, so are the ones called the Exo. I wished to nominate to you a Shadow of the Exo.\"\n\nThe Emperor said, \"Ah, now I understand you.\"\n\nThe Shadow said: \"The one I nominate is called Failsafe-0.^ She is a malicious and humorless being, despised by all. She would make a worthy Shadow of the Exo.\"\n\nSaid the Emperor: \"Thus will it be done.\"\n\n\n\n^ Note to Underscribe Shipal: My own independent research into the Sol System leads me to believe, with weighty certainty, that the ones called Exodus Black and Failsafe are, in fact, the same being. Thus, your supplementals contradict each other. Delete this footnote upon the rectification of this error.",
                "itemHash": "1301733714",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/a40c9fddce9533c838f3370c79b8332f.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/1301733714.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    67,
                    10,
                    12,
                    11,
                    2,
                    16,
                    16
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Opulent Scholar Robes",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"I have foreseen what must fall so the Empire may rise. Your mastery of knowledge apocryphal shall make true Cabal of us all.\" —Emperor Calus",
                "ExtLore": "MCXIV, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the sentience known as Exodus Black.\n\nAmong the insurgents of the impudent Sol System there was one called Exodus Black, who was the first in the Sol System to be born into the digital aether. Because she spoke well and was beloved by all, Exodus Black was a hero among the insurgents. So the Shadow of Earth knew what must be done.\n\nUsing the knowledge gathered in the Athenaeum, the Shadow ripped Exodus Black from her starship body and, rending her consciousness in half, placed each piece in an Exo body.\n\nWhen the two came online, Exodus and Black turned quickly upon each other, and each perished by her other half's hand.",
                "itemHash": "3981949974",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/d95bfb7440bac4ba3eb895ea1e08aec2.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/3981949974.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    64,
                    18,
                    6,
                    7,
                    2,
                    21,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Opulent Scholar Boots",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"I have foreseen the apex of your heuristic potential. Should you wish it, this system shall collapse from the ideas you've made into weapons. And make way for what's coming. O champion mine.\" —Emperor Calus",
                "ExtLore": "MCXXVII, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the Rogue Lightbearer known to some as Dredgen Hope.\n\nWith the help of Brighus, the Emperor's personal chef, the Shadow of Earth prepared a splendid feast, and then went to the rogue and said, \"Brother, come with me.\"\n\nHow marvelously they dined, upon soft-fleshed brackenclams and salty fruitmeats! The Shadow partook with the stamina of a great Cabal primus, but the rogue ate even better, so well that even the generous Emperor, watching through his Shadow's eyes, was impressed.\n\nFinally, the last course was served: a flaky pastry the size of a human's fist. The rogue bit into it, and winced at the crunch, for the pastry was filled with metal and paint and the taste of vanilla.\n\nThe rogue ate it all.\n\nThen, wiping his lips, the rogue asked what was in the pastry. And the Shadow told him: \"Your Ghost.\"\n\nAnd before he could respond, the Shadow leapt up and, seizing more food and drink, forced it upon the rogue called Dredgen Hope in such generous quantities that the rogue could not endure his own gratitude. Thus was the rogue's hunger sated.",
                "itemHash": "1702972140",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/da139676047b7c662fe8cd2bfe9b7020.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/1702972140.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    64,
                    18,
                    6,
                    7,
                    2,
                    21,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Opulent Scholar Bond",
                "type": "Legendary Warlock Bond",
                "description": "",
                "lore": "\"I have foreseen the end of all things. The novenary, the Awoken Queen, the sad, strange little man on his rickety boat. They believe they've seen the same. What they don't know will destroy them.\" —Emperor Calus",
                "ExtLore": "MCXXIX, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay Cayde-7.\n\nThen a visitor approached the throne of the Joyous Emperor and proffered himself before the Generous Host. He was Cayde-7, whose origins are recounted in MCXXXVII. ^\n\nCayde-7 knelt at the Emperor's feet, and kissed his boots, saying: \"Your truest servant is here.\"\n\nAnd the Emperor was pleased, for he thought that this one would make a very fine Shadow.\n\nBut the true Shadow of Earth, jealous of the Emperor's love, cut down Cayde-7 where he stood in the Emperor's throne room, and then dealt with his ruins in such a way as to ensure that there would never be a Cayde-8.\n\nThe Emperor was pleased, and that night there was a great feast aboard the Leviathan.\n\n\n\n^ A note to Underscribe Shipal: Entry MCXXXVII appears to be missing. Please reattach it to this account, and delete this footnote upon rectifying this error.",
                "itemHash": "3311577151",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/e189f0456c32a48af29b647a0e3f7616.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/3311577151.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Hunter": {
            "Helmet": {
                "name": "Opulent Stalker Mask",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"I have foreseen the victories that your cunning shall win in my name. Over and over.\" —Emperor Calus",
                "ExtLore": "MCXX-I, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the Warlock Vanguard Ikora Rey.\n\nAs recorded by the enshrined Scribe Shagac, the Vanguard of Earth requested mercy, and their request was denied. Thus the Warlock Ikora was permitted a final day to consider her perfidy before her death.\n\nTo this generosity Ikora Rey said, \"I do not need a day. Let us end this now.\"\n\nAnd she unleashed from her fingertips a Nova Bomb of such proportions that it shook Mars to its foundations and made the stars weep for envy. And the Shadow answered her with the strength of a god-killer.\n\nAlight with the power of a hollow god, Ikora Rey let loose such torrents of Arc and Solar and the most majestic Void that the sands of Mars turned to glass and shattered. And the Shadow matched her blow for blow. No greater battle has ever been enshrined in the Emperor's Glorious accounts, and none ever will be again, for at the last of it, Mars's orbit was forever altered, and the mighty Ikora Rey was no more.",
                "itemHash": "1440812312",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/0cf1497f34949c4669e0daf035905bd8.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/1440812312.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    66,
                    10,
                    12,
                    10,
                    16,
                    2,
                    16
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Opulent Stalker Grips",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"I have foreseen the work that will bring this system together. I'll need your cunning.\" —Emperor Calus",
                "ExtLore": "MCXXI, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the shipwright Amanda Holliday.\n\nThere was among Earth's people a pilot to rival Jarrus the Ace-Defiant. Her name was Amanda Holliday, and when the Emperor saw her fly, he was pleased; when he saw her destroy his pleasure-vessel, he was thrilled; when he saw her shoot down the Shadow of Earth, he exulted.\n\nAnd so, when the Shadow of Earth recovered from death, the Emperor said, \"Bring me the Ace-Resistant.\"\n\nSo the Shadow landed upon Earth and sought Amanda Holliday on foot, for even an Ace must return to land sometimes. The Shadow found her camp, and approached her, and put up no defense when the Ace-Resistant drew an Auto Rifle. The Ace-Resistant killed the Shadow many times, until she had no ammo left, and then the Shadow beseeched her, for the sake of their friendship, to speak as they once did.\n\nThe Shadow held out a hand, and Amanda Holliday, the Ace-Resistant, took it in her own.\n\nThen the Shadow slew her, and brought her body to the Emperor saying, \"I have brought you the Ace-Resistant.\"\n\nAnd the Emperor laughed, for his Shadow was a clever and a covetous soul.",
                "itemHash": "1904615913",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/5848db2334725312db7130f6a45f4d06.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/1904615913.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    63,
                    6,
                    6,
                    20,
                    15,
                    10,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Opulent Stalker Vest",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"I have foreseen what must fall so the Empire may rise. Your mastery of silent slaughter shall make true Cabal of us all.\" —Emperor Calus",
                "ExtLore": "MCXIII, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the Warlock Osiris.\n\nThere was a Guardian named Osiris who defied the Shadow of Earth, saying: \"If you are really the mightiest that Earth has to offer, then I challenge you in a battle of wits.\"\n\nThen Osiris disappeared into the Infinite Forest, scattering his Reflections about him so as to mask himself.\n\nBut the Shadow of Earth went to the First Vex, and said to it: \"My love for you is as rational as the ratio of a circle's circumference to its diameter.\"\n\nThe Vex, faced with an impossible problem, promptly perished, and with it, all Vex and all their workings crumbled into empty chassis and chalky cubes.\n\nThus Osiris, deprived of his Reflections, was exposed, and the Shadow of Earth slew him easily.",
                "itemHash": "3258844783",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/29ea40caf9ac7112b41f42fad6cf1d52.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/3258844783.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    64,
                    14,
                    7,
                    10,
                    12,
                    15,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Opulent Stalker Strides",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"I have foreseen the apex of your slaying potential. Should you wish it, this system shall die—from the inside—and make way for what's coming. O champion mine.\" —Emperor Calus",
                "ExtLore": "MCXXII, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the master of ceremonies.\n\nAfter the Vanguard's passing, the Earth was in lamentation, and their sorrows fell upon their Shadow's ears. The Shadow of Earth went to the Emperor and said, \"When the Earth grieves, its Shadow grieves.\"\n\nThe Emperor said, \"Your generous heart overflows. Go, take my joy to your people.\"\n\nSo the Shadow went to Earth, to the master of ceremonies, and said, \"Eva Levante, the days of the Dawning and Crimson Days, of Revelry and Festival of the Lost are over. From now on, it is your jubilant task to fete his Grandiose Majesty, the Father of Satisfaction.\"\n\nBut Eva Levante refused, for she had no kindness or generosity in her heart. So the Shadow of Earth slew her and appointed Lord Shaxx the new master of ceremonies. And Lord Shaxx feted the emperor with a serene and gentle joy.",
                "itemHash": "2196557755",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/7c4e02f03b0549bdbafe93369f4ec87c.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/2196557755.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    65,
                    10,
                    21,
                    2,
                    7,
                    7,
                    18
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Opulent Stalker Cloak",
                "type": "Legendary Hunter Cloak",
                "description": "",
                "lore": "\"I have foreseen the end of all things. The novenary, the Awoken Queen, the sad, strange little man on his rickety boat. They believe they've seen the same. What they don't know shall destroy them.\" —Emperor Calus",
                "ExtLore": "MCXX-II, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the Titan Vanguard Zavala.\n\nAs recorded by the enshrined Scribe Shagac, the Vanguard of Earth requested mercy, and their request was denied. Thus the Titan Zavala was permitted a final day to consider his perfidy before his death.\n\nSo the Titan Zavala went to the Human known as Suraya Hawthorne and said, \"Suraya Hawthorne, will you play a game of checkers with me?\"\n\nSuraya Hawthorne agreed, and so the two played twenty-seven games of checkers, and listened to the music of bagpipes and synthesizers, and dined upon Earth delicacies such as nuggets of chicken and the beer of roots.\n\n \"Titan Zavala,\" said Suraya Hawthorne as Earth's sun rose upon their latitude, \"There will never again be a checkersmaster of your like.\"\n\n\"No, Suraya,\" said Titan Zavala. \"You must become a greater checkersmaster than even me, if you are to lead the resistance.\"\n\nThus the Titan Vanguard did not meet his final death alone. And Suraya Hawthorne was slain at a later date.\n\n\n\n^ Note to Underscribe Shipal: Very good. This is entirely credible.",
                "itemHash": "211036158",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/d49894a907102e485b6bdca528d02a0f.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/211036158.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Titan": {
            "Helmet": {
                "name": "Opulent Duelist Helm",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"I have foreseen the victories that your strength shall win in my name. Over and over.\" —Emperor Calus",
                "ExtLore": "MCXVIII, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay Variks, the Betrayer.\n\nAfter the much-mourned death of Mithrax, Shadow of the Eliksni, there was one who sought to inherit this exalted title. He was Variks, the Judgment Kell, who was never where his allies wanted him to be.\n\nThe Emperor was displeased, and said, \"From each species of being there can be only one Shadow. That is my decree. To do otherwise would be to drink bitter juice, and I drink only what pleases me.\"\n\nThen, at a nod from the Emperor, the Shadow of Earth cut down Variks the Judgment Kell. The Eliksni people called this the Second Scatter, but this name was short-lived, for so were they.",
                "itemHash": "2450046452",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/10e148da14a27a3dde99681819a0951c.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/2450046452.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    65,
                    12,
                    14,
                    7,
                    16,
                    2,
                    14
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Opulent Duelist Gauntlets",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"I have foreseen the work that will bring this system together. I'll need your strength.\" —Emperor Calus",
                "ExtLore": "MCXV, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay Toland, the Shattered.\n\nEmperor Calus tasked his Shadows with this command above all others: to safeguard the Emperor's right to be the Last Being at the End. One being threatened that above all, one who was pinned against the quiddity of death and exchanged one definition for another. This being the Shadows named Toland.\n\nSo the Shadows of Earth and the Awoken and the Hive entered the Deep Places and recovered an essence of the Deathsinger Ir Yût. From her, they learned the Deathsong. By then manipulating the mind Quria, now bound to the Shadow of the Hive, they reversed the Deathsong, and sang Toland back to life.\n\nNow alive, Toland was once more weak against the powers of death, and he died in the mind and in the body. ^\n\nThus the Emperor's right was ensured.\n\n\n\n^A note to Underscribe Shipal: Please reverify your Hive sources. This account is riddled with paradoxes so extreme as to prompt hilarity, and such a mood, while beloved to our Joyous Leader, is inappropriate in a chronicle of this significance.",
                "itemHash": "1322451469",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/2be62a84444e9f0d0caa19ae9b987cef.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/1322451469.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    64,
                    2,
                    25,
                    6,
                    15,
                    10,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Opulent Duelist Plate",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"I have foreseen what must fall so the Empire may rise. Your mastery of war shall make true Cabal of us all.\" —Emperor Calus",
                "ExtLore": "MCXXVIII, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay the betrayer Uldren Sov.\n\nThen the Shadow of Earth went to the Emperor and said: \"My wise and mirthful host, those toward whom you pointed me, I have slain. Now I crave your permission and your blessing to point myself toward one in whose death I would take great delight.\"\n\nThe generous Emperor, pleased to no end with his bright Shadow of Shadows, said: \"Say no more. It is granted.\"\n\nGiving great and proper thanks, the Shadow of Earth went away and found the Guardian whose name was once Uldren Sov. The Shadow of Earth slew him, but spared his hateful little companion-soul so that the well of pleasure that was Uldren's death should never run dry.\n\nSo many times did the Shadow of Earth slay the one called Uldren Sov that no chronicler could ever record the exact number. At last, when the Shadow's appetite was whetted, Uldren Sov met his final death.",
                "itemHash": "2821102771",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/d03111c9a454610ca43141e2dc29d72f.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/2821102771.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    66,
                    2,
                    25,
                    6,
                    7,
                    6,
                    20
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Opulent Duelist Greaves",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"I have foreseen the apex of your fighting potential. Should you wish it, this system shall fall and make way for what's coming. O champion mine.\" —Emperor Calus",
                "ExtLore": "MCXLII-I, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Shadow of Earth slay their companion-soul.\n\nAnd then the end was nigh, and the Shadow of Earth, thinking upon the Emperor's most indefatigable desire, knew that his Joyous Majesty wished to partake in the greatest share of the apocalypse's pleasures, and that the only way to ensure that was for the Shadow of Earth to take the honor of the second-greatest share.\n\nTo that end, the Shadow of Earth extended a hand, and into it flew the Shadow's companion-soul, who had spoken not a word for many ages.\n\nThe Shadow bade the companion-soul to speak, and the companion-soul obliged:\n\n\"I love you.\"\n\nWith that, the Shadow's fist closed, and the companion-soul was no more.\n\nAnd then there were two.",
                "itemHash": "1993250511",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/2cca743c4fed3092fbd3a39a8d5babd5.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/1993250511.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    66,
                    10,
                    21,
                    2,
                    7,
                    6,
                    20
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Opulent Duelist Mark",
                "type": "Legendary Titan Mark",
                "description": "",
                "lore": "\"I have foreseen the end of all things. The novenary, the Awoken Queen, the sad, strange little man on his rickety boat. They believe they've seen the same. What they don't know will destroy them.\" —Emperor Calus",
                "ExtLore": "MCXLII-II, forthcoming.\nRecorded by Underscribe Shipal\n\nThus did the Emperor of All Joys tenderly slay his beloved Shadow of Earth.\n\nAnd in the End of All Things, there remained only Emperor Calus and the Shadow of Earth in the Eye of the Storm that was Nothing. The neutrinos left in the hourphase could be counted upon one Human hand.\n\nThen the Shadow of Earth knelt before the Emperor, and with great courage and loving dignity said to the Emperor: \"My good and generous host, what you have longed for has come to pass. Do me the honor of letting me grant your last and truest wish.\"\n\nWith tears in his eyes, Emperor Calus spoke the last words that a living being will ever say to another living being: \"This I grant you.\" +\n\nAnd our merciful emperor slew his Shadow of Shadows, the Young Wolf, the Slayer of Oryx, the Shadow of Earth.\n\nThuswise did the Emperor reserve the right to be the last. And when the end came, he met it with the body of the Shadow in his arms, his belly rumbling with joyous laughter.\n\n+ As there will be no scribe employed at this future date, the last Scribe shall consult with Emperor Calus as to our sovereign's planned remarks. Delete this footnote as close to the actualization of this history as possible.",
                "itemHash": "731561450",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/8a72ec3b1a34282a2faa0680231e7564.jpg",
                "backgroundImage": "https://www.bungie.net/common/destiny2_content/screenshots/731561450.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        }
    }
}