{
    "Location": "European Dead Zone",
    "Planet": "Earth",
    "Landing Zone": "Winding Cove",
    "Week": "September 01, 2023",
    "Exotics": {
        "Exotic Engram": {
            "name": "Exotic Engram",
            "type": "Exotic Engram",
            "description": "An engram with a predestined outcome.\n\nContains a new Exotic if any of the possible rewards remain to be collected. Preview contents for possible rewards.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "3875551374",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/ee21b5bc72f9e48366c9addff163a187.png",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Quest": {
            "name": "Xenology",
            "type": "Exotic Quest Step",
            "description": "Complete Vanguard playlist activities, or win matches in Crucible or Gambit.\n\nExtra progress is awarded for more challenging activities and for succeeding with clanmates.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "2125848607",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/7f9e6e79bb7a8ce59de9258a7d674af2.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Weapon": {
            "name": "Prometheus Lens",
            "type": "Exotic Trace Rifle",
            "description": "",
            "lore": "\"Cryptarchs made a crystal that starts fires? Get me one. I don't care how you do it. Go!\" —Cayde-6",
            "ExtLore": "How's it work? Ha! The underlying principles are quite simple, really. The gun's pyreliophorite crystal—\n\nPyreliophorite? It's an Ionian crystal which bears some resemblance to rudimentary perovskite, which is, as you should know, a crystal with unique photovoltaic properties—\n\nPhotovoltaic? It means \"regarding the conversion of light into electricity.\"\n\nNo, no, the gun doesn't create electricity; the gun induces an external combustion reaction. It's perovskite that—\n\nI just explained the perovskite! If you'd stop interrupting—\n\nWait. I remember you. You're one of Cayde's Hunters! Get out of here! Shoo! The Cryptarchy wants nothing to do with you!",
            "itemHash": "19024058",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/76817c6b9ad482a19a180819fbe85def.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Prismatic Inferno",
                    "description": "Fires a Solar trace beam that creates a field of heat energy that grows as the weapon is fired. Sustained damage applies scorch to the target.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/ea46e3015259c7bc0d98020eb1889c2a.png",
                    "hashID": 571267712,
                    "weaponHash": 19024058,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Chambered Compensator",
                    "description": "Stable barrel attachment.\n  •  Increases stability\n  •  Moderately controls recoil\n  •  Slightly decreases handling speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0b451cbccc7f11f6aec9c153e59474cb.png",
                    "hashID": 3661387068,
                    "weaponHash": 19024058,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Projection Fuse",
                    "description": "Distance optimizations.\n  •  Increases range",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/eaa6fcec699a88e768782068d5e509e1.png",
                    "hashID": 2969185026,
                    "weaponHash": 19024058,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Flame Refraction",
                    "description": "Kills with this weapon return a fraction of the ammo used to the magazine from reserves, extending the beam's duration.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/cea9d1532966f264c68d0e3c59b9eb28.png",
                    "hashID": 3470828242,
                    "weaponHash": 19024058,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Composite Stock",
                    "description": "This weapon has a versatile dual-purpose stock.\n  •  Slightly increases stability\n  •  Slightly increases handling speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7c616b3d2d0e97bf8948b1371b3007bb.png",
                    "hashID": 3465198467,
                    "weaponHash": 19024058,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Energy",
            "legendWeaponDamageElement": "Solar",
            "masterworkData": null
        },
        "Hawkmoon": {
            "name": "Hawkmoon",
            "type": "Exotic Hand Cannon",
            "description": "",
            "lore": "Stalk thy prey and let loose thy talons upon the Darkness.",
            "ExtLore": "What is this feeling?\n\nI did not ask for it. I do not understand it. I do not want it.\n\nThe Crow is so carefree in his ignorance. The bonfire's glow lights up his pale features and I am drawn to the hope in his gold eyes. Where is the despairing child I anticipated?\n\nHe drinks from an open bottle of wine against the recommendation of his Ghost. The Guardian encourages him and they are laughing. This celebration is maddening; neither have reason to be so jubilant. Their world is ending and they thrash like dying creatures in the final light of collapsing stars. They do not seem to acknowledge the futility of their existence, the impermanence of it in the face of cosmic annihilation.\n\nNow the Guardian is drinking, standing close to the fire. Their Ghost, too, encourages them not to partake. They poison themselves for the enjoyment of it.\n\nI am reminded of my sisters. Of moments spent by lapping shores, gazing up at infinite stars full of possibilities and wonder. I am left yearning.\n\nWhat is this feeling?\n\nI do not understand it. I do not want it.\n\nThey are celebrating their victory over the Taken. The Crow is making a gun shape with his hand, swinging the nearly empty bottle of wine around in the other like a Sword. The Guardian looks pensive, sitting on a rock by the fire, contemplating the secret they are keeping. The Crow notices, but tries not to show it. He wants the Guardian's spirits to be lifted. He wants to be supportive, so that they may share in their triumphs together.\n\nAs equals.\n\nI am reminded of my home. I am reminded of the warmth of the sun and the embrace of my family. I am reminded of my father's face. I am reminded of everyone I betrayed. All the blood spilled in the name of immortality. The warmth of the sun burns me with its memory.\n\nWhat is this feeling?\n\nI do not want it.\n\nThe fire has nearly died. The Crow fell over and cannot stand, though he insists he is fine. The Guardian is turning the embers with the tip of their Sword. The Ghosts are talking to one another in quiet conspiracy. The celebration has ended, but I can sense their emotions are mixed: complex and myriad things, when a simple, singular focus would suffice.\n\nThere is a growing kinship here. Against better judgment.\n\nWhat is this feeling?",
            "itemHash": "3856705927",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/cef1290d58a2d94d1437e1e569fa7996.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Paracausal Shot",
                    "description": "Final blows and precision hits with Hawkmoon grant stacks of Paracausal Charge. The final round in the magazine deals bonus damage based on the number of stacks. Stowing Hawkmoon on the final round removes this bonus.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/243f5529bbd845871803181958599473.png",
                    "hashID": 213689231,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Full Bore",
                    "description": "Barrel optimized for distance.\n  •  Greatly increases range\n  •  Decreases stability\n  •  Slightly decreases handling speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/40a4bdcf0f5a4e492927f9569eaf529d.png",
                    "hashID": 202670084,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Alloy Magazine",
                    "description": "Faster reloads when the magazine is empty.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/069170916c98748b7b3e33b80bd7d689.png",
                    "hashID": 1431678320,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Eye of the Storm",
                    "description": "This weapon becomes more accurate and boosts handling as your health gets lower.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8f4755f9068959b26b8829641e5725ad.png",
                    "hashID": 699525795,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Textured Grip",
                    "description": "The friction on this weapon's grip is particularly strong.\n  •  Greatly increases handling speed\n  •  Slightly decreases stability",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/f1a31e1710aac5b4fb1715d174093199.png",
                    "hashID": 3917450714,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Kinetic",
            "legendWeaponDamageElement": "Kinetic",
            "masterworkData": null
        },
        "Warlock Exotic": {
            "name": "Getaway Artist",
            "type": "Exotic Gauntlets",
            "description": "",
            "lore": "Keep the engine running.",
            "ExtLore": "If Thalia is lightning, Ayrin is thunder. You hear him coming, and he likes it that way. He's got a kitbashed heavy bomber that he pulled out of a trash fire. The engine goes THUT-THUT-THUT-THUT, just these big, stupid-sounding percussive booms, and it's like all monsters, man, the noise this thing makes can stop your blood cold.\n\nSo. Otto and I load the supplies into the back, and Thalia hops into the passenger seat.\n\nThe chumps that run out to stop us are babies. That's the kicker with Warlords—other than ours, there's not a Ghost in sight here. Just civilians who can barely hold their guns without wetting their pants, who can't aim worth a damn, who stick their necks out for the bad guys with eternal life. Real geniuses.\n\nBoo-hoo.\n\nGuess what? We got hungry, too. We starved, too. So when there was food, we took it, and if the Warlords put cannon fodder in our way to slow us down, that wasn't my fault. Wasn't our fault.\n\nAnyway, Ayrin. He stands up in the open-roof cockpit and whoops, and the little devil on his shoulder, a crackling ball of Arc energy, spits bullets behind him. Mows down the idiots as they run straight into the line of fire, like lemmings. And Ayrin doesn't need to shoot anything himself, but he does. For fun.\n\nWhen he gets enough target practice, and Otto and I are on board, he lets his little blue buddy handle the rest, and he tears out of there like a bat out of hell.\n\nSee? We were a well-oiled machine. A perfect team. We could've kept on like that for centuries.",
            "itemHash": "3084282676",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/a2350076ae19cf474a88a0c2a440c93f.jpg",
            "rarity": "Exotic",
            "class": 2,
            "statRolls": [
                68,
                10,
                3,
                23,
                15,
                10,
                7
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Dynamic Duo",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/21f908e327196879aaa3f22a42229dc2.png",
                    "desc": "[Grenade]  : Convert your Arc grenade into a Arc Soul and become amplified. The Arc Soul functions as an autonomous turret."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Hunter Exotic": {
            "name": "Orpheus Rig",
            "type": "Exotic Leg Armor",
            "description": "",
            "lore": "Never, ever, look back.",
            "ExtLore": "Quantis Rhee has almost forgotten what colors are. For months, she has prowled the deep, shadowed catacombs of Nessus—the places where the inexorable Vex burrowed into the rogue planet and replaced natural life with a cold, inhuman labyrinth. \n\nLight is scarce in this place. But Quantis knows how to find it—how to feel for the un-ripples of the Void, to draw Light from the infinities between spaces. She knows how to roll black holes between her fingertips, and how to nock her bow with the inescapable gravities of the universe. \n\nSoon Quantis will leave this place, return to the City, report her findings. See colors again. But that won't last long. She is a Nightstalker. Out here—balanced upon the infinitesimal knife's edge—is where she truly belongs.",
            "itemHash": "193869523",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/4abdc33a8ff869fc7bdcbdc83fbaba01.jpg",
            "rarity": "Exotic",
            "class": 1,
            "statRolls": [
                64,
                14,
                14,
                6,
                2,
                14,
                14
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Uncanny Arrows",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/392cc994318808b9f3b2bcbec7f285c3.png",
                    "desc": "Provides ability energy for each target tethered by Deadfall anchors. Moebius Quiver has an additional shot."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Titan Exotic": {
            "name": "Hallowfire Heart",
            "type": "Exotic Chest Armor",
            "description": "",
            "lore": "\"You who seek the Forge: your journey will be long, but your destination is closer than you think.\" —Ouros",
            "ExtLore": "\"Commander, as best we can tell, they're all gone. Somehow the Legion found their outpost, and the Hunters say Centurions still hold the ruins. This was the last text transmission we got before the signal died.\" \n—Sloane \n\n\"The fire burned within us. Not by choice, not because we sought the flame. But because there was no other way. \n\n\"When you stood before the Forge, there was no doubt. No fear. Not even anger. \n\n\"My order stood for generations. We held against the shadow, bearing a weapon that seared flesh and melted bone. \n\n\"And now we stand at the end. May history remember the Forge. Remember the Hammer. Remember the Sunbreakers.\" \n\n—Ouros, Third and Final Empyreal Magistrate of the Sunbreaker",
            "itemHash": "1192890598",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/8aacd27b76e68afe6287a3984adeb601.jpg",
            "rarity": "Exotic",
            "class": 0,
            "statRolls": [
                68,
                4,
                7,
                23,
                16,
                6,
                12
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Sunfire Furnace",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/7066c741806a4c30d4987a63f5b3b2d9.png",
                    "desc": "Solar takedowns while standing in a Sunspot create a Sunspot. Greatly improves recharge rate of your Solar abilities while your Super is charged. Provides a small benefit to the airborne effectiveness stat of all weapons."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        }
    },
    "Legendaries": {
        "Legendary weapons": [
            {
                "name": "Ignition Code",
                "type": "Legendary Grenade Launcher",
                "description": "",
                "lore": "\"I can decode anything with a grenade launcher.\" —Saint-14",
                "ExtLore": "Ahrrha hauled a metal crate from the drop ship toward the haphazard Eliksni settlement. He moved slowly, matching the pace of his malnourished workmates. Though he had fasted during his trip, Ahrrha knew that his solid frame still made him stand out. He feared it would reveal him as the imposter and infiltrator he was, even while dressed as a House Salvation deserter.\n\nDuring the approach to Earth, Ahrrha had been overawed. The Last City looked like a perfect ripple of Light from above, dropped from the impassive form of the Great Machine. Ahrrha wondered for the first time in his life if the Spider was wrong about the Guardians.\n\nBut his misgivings evaporated as soon as he emerged from the drop ship. Rather than living in a gleaming city of crystal, the Eliksni were packed into the bombed-out ruins of a former war zone. The area they'd been \"given\" appeared to be on the verge of collapse. \n\nAhrrha sneered inwardly. Did the Guardians really believe that the Eliksni could be pacified so cheaply? That they were content to live under the boots of the Vanguard, gnawing at scraps? Perhaps it was true for fools like Misraaks, his Awoken-raised hatchling, and cowards like the Empty Weaver. \n\nBut the Spider's acquiescence would not be so easily bought. In fact, Ahrrha thought, the Spider could probably own this settlement within a year. The generosity and goodwill of House Light would soon crumble to greed and hubris, as they all did. And once Spider's syndicate had a foothold, they would make the Vanguard pay. In Glimmer, weapons, Ether, and blood.",
                "itemHash": "304659313",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/42cd2f0993f9bb0f79461aba1801b105.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Countermass",
                        "description": "This weapon is weighted for vertical recoil.\n  •  Greatly controls recoil\n  •  Increases stability\n  •  Increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/6fda396e0f2fa3c2eceac79e39f9c44b.png",
                        "hashID": 3809316345,
                        "weaponHash": 304659313,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Disorienting Grenades",
                        "description": "Detonation has a brief disorienting effect. \n  •  Greatly decreases blast radius",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/f31c68952868e70325b992a4783db908.png",
                        "hashID": 3032599245,
                        "weaponHash": 304659313,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Field Prep",
                        "description": "Increased ammo reserves. Faster reload, stow, and ready when you're crouching.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/4ee1ecaead6fe2de1a2cab07f8b7be3f.png",
                        "hashID": 2869569095,
                        "weaponHash": 304659313,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Vorpal Weapon",
                        "description": "Increased damage against bosses, vehicles, and Guardians with their Super active.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/bc5130b227ee577f2678ec2d2c97bf4a.png",
                        "hashID": 1546637391,
                        "weaponHash": 304659313,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Lightweight Frame",
                    "description": "One-shot handheld Grenade Launcher with remote detonation. \n[Shoot]  : Fire; release to detonate.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/6db8cd21c2b3e6fffeb6f111d6c70dd2.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Kinetic",
                "masterworkData": {
                    "name": "Reload Speed",
                    "description": "The time it takes to reload this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e3a74e6dd4c520ea17eb1fdaf2128213.jpg",
                    "mwHash": 4283235143
                }
            },
            {
                "name": "True Prophecy",
                "type": "Legendary Hand Cannon",
                "description": "",
                "lore": "\"Some claim to know the future better than we do. Listen carefully. Then ask yourself: do their words ring true or false?\" —Lakshmi-2",
                "ExtLore": null,
                "itemHash": "2742838700",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/1a4382dd6c3cbc134f2d276c0ff63c7e.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "TrueSight HCS",
                        "description": "Balanced Hand Cannon sight.\n  •  Slightly increases range\n  •  Slightly increases stability\n  •  Slightly increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/388a2235cfe0a6d9449aec30f8e962cd.png",
                        "hashID": 1926090092,
                        "weaponHash": 2742838700,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Accurized Rounds",
                        "description": "This weapon can fire longer distances.\n  •  Increases range",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d85024478504205359c7fb52dbc4f6b6.png",
                        "hashID": 3142289711,
                        "weaponHash": 2742838700,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Overflow",
                        "description": "Picking up Special or Heavy ammo automatically loads this weapon beyond normal capacity.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/3165fec56b59363fa974a11f5730f4ec.png",
                        "hashID": 3643424744,
                        "weaponHash": 2742838700,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Timed Payload",
                        "description": "Projectiles attached to enemies explode after a short delay.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/1d53281172f2568e4c840409f4151771.png",
                        "hashID": 1954620775,
                        "weaponHash": 2742838700,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Aggressive Frame",
                    "description": "High damage, high recoil. Optimized for long-distance shooting.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/64209c4fd20513b33109c374179d0958.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Kinetic",
                "masterworkData": {
                    "name": "Reload Speed",
                    "description": "The time it takes to reload this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e3a74e6dd4c520ea17eb1fdaf2128213.jpg",
                    "mwHash": 4283235143
                }
            },
            {
                "name": "Corsair's Wrath",
                "type": "Legendary Linear Fusion Rifle",
                "description": "",
                "lore": "\"We are only briefly Awoken. The rest of existence is an eternal dream.\" —Sedia",
                "ExtLore": "The Corsair reloaded behind her improvised barricade as Shredder rounds sizzled overhead. She wished she had better cover. The Hall of Names hadn't been constructed with defense in mind—apparently nobody dreamed the Awoken would be assaulted here. \n\nShe reloaded her fusion rifle and assessed their situation. It was dire. Unless Leona Bryl's team managed to roll up the Hive's southern flank, her squad would be overrun. At least the Hall of Names was a fitting place for a last stand. \n\nShe was six rounds short of a full clip. She turned to her left to ask Lira for extra ammo, only to discover her teammate slumped over, blue skin already going grey. The thick purple ichor of a soulfire round oozed from the hole in her chest. The Corsair gritted her teeth and looted Lira's kit for ammo. \n\nThe Corsair finished reloading and popped her head back over the barricade. She downed three loping Acolytes in quick succession before even noticing the ogre looming in the background. It was enormous—at least seven meters high. She unloaded her fusion rifle into its face, trying to burrow rounds through its armored hide. She managed to blow off a chunk of its upper jaw before her rifle clicked empty. \n\nThe Corsair dove back behind her barricade, ammo spent. She looked around the Hall for the last time, admiring the elegant statues, her chest swelling with bittersweet pride. The faces of her people, Techeuns and Queens, presiding over the battle. She remembered what Sedia had said to her long ago, before things got out of control: \"We are only briefly Awoken. The rest of our existence is an eternal dream. And in that dream, we will all—\"",
                "itemHash": "2714022207",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/b493fc12f672531508a226b7321cba59.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Fluted Barrel",
                        "description": "Ultra-light barrel. \n  •  Greatly increases handling speed\n  •  Slightly increases stability",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/260eba9dd149dbb94b1306c9ed4dd8db.png",
                        "hashID": 1840239774,
                        "weaponHash": 2714022207,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Ionized Battery",
                        "description": "Large heavy battery.\n  •  Greatly increases magazine size\n  •  Greatly decreases reload speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/a278b79aba1d341d2a070c0e48d9129a.png",
                        "hashID": 1483536627,
                        "weaponHash": 2714022207,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "No Distractions",
                        "description": "Aiming this weapon for a short period reduces flinch.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/3f6534e7fd934e0ecfeb1cac9da9c97f.png",
                        "hashID": 2866798147,
                        "weaponHash": 2714022207,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Demolitionist",
                        "description": "Kills with this weapon generate grenade energy. Activating your grenade ability reloads this weapon from reserves.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/da009697110e06b65d6f827b3b6d5f70.png",
                        "hashID": 3523296417,
                        "weaponHash": 2714022207,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Precision Frame",
                    "description": "Fires a long-range precision energy bolt. This weapon's recoil pattern is more predictably vertical.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e9dd736124e8ef94048901a279a5bb18.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Charge Time",
                    "description": "The time in milliseconds before a weapon fires.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/0ab7e72f178dbec85d531cc7eae34571.jpg",
                    "mwHash": 3353797898
                }
            },
            {
                "name": "Sailspy Pitchglass",
                "type": "Legendary Linear Fusion Rifle",
                "description": "",
                "lore": "There are shapes on the horizon not yet meant to be seen.",
                "ExtLore": "Iriks has good eyes, yes. One on top right dull, filmy, not so good. But others very good. Sharp.\n\nIriks waits. Motionless. Tastes the thin wind. Rate of speed. Leads target. Takes the shot.\n\nIriks does not miss. Enemies panic. Again. Again. Quiet.\n\nIriks sends in his crew. Watches through the scope. One claims more than their share.\n\nIriks teaches. Body falls. Lesson learned. Quiet again.\n\nIriks watches his crew open the chest. One holds the treasure high in shaking claws.\n\nIriks sees the dark glass. Sees the object floating inside. Recognizes. Tightens grip. Holds breath.\n\nIriks knows what Eramis seeks. Knows what it is worth. Knows what she will pay.\n\nIriks will take the shot.",
                "itemHash": "1184309824",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/9a5310787d6f53729b0814b9ecfdb487.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Arrowhead Brake",
                        "description": "Lightly vented barrel.\n  •  Greatly controls recoil\n  •  Increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8f7fb54687aa52a9c2595d90ce9c9417.png",
                        "hashID": 839105230,
                        "weaponHash": 1184309824,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Ionized Battery",
                        "description": "Large heavy battery.\n  •  Greatly increases magazine size\n  •  Greatly decreases reload speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/a278b79aba1d341d2a070c0e48d9129a.png",
                        "hashID": 1483536627,
                        "weaponHash": 1184309824,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Rapid Hit",
                        "description": "Rapid precision hits temporarily increase stability and reload speed.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/de22847fa94634a487758041887bcdaa.png",
                        "hashID": 247725512,
                        "weaponHash": 1184309824,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Voltshot",
                        "description": "Reloading this weapon after defeating a target overcharges this weapon for a short period of time, causing it to jolt on its next hit.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/a71ffb1cb221ea64fa77ab473f8a3a61.png",
                        "hashID": 2173046394,
                        "weaponHash": 1184309824,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Right Hook",
                        "description": "Dealing melee damage gives this weapon increased target acquisition and range for a short period of time.\nDealing melee damage again extends the effect.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/067828985c3d34507def4eb53b12cf4e.png",
                        "hashID": 3907865655,
                        "weaponHash": 1184309824,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Precision Frame",
                    "description": "Fires a long-range precision energy bolt. This weapon's recoil pattern is more predictably vertical.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e9dd736124e8ef94048901a279a5bb18.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Reload Speed",
                    "description": "The time it takes to reload this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e3a74e6dd4c520ea17eb1fdaf2128213.jpg",
                    "mwHash": 4283235143
                }
            },
            {
                "name": "Jian 7 Rifle",
                "type": "Legendary Pulse Rifle",
                "description": "",
                "lore": "Come, brothers and sisters! Let us make way for the new ruler!",
                "ExtLore": null,
                "itemHash": "1162247618",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/ba32a8a560bc8626723c2a273764a980.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "SRO-52 Ocular",
                        "description": "SUROS ranged combat scope. Long zoom. \n  •  Greatly increases range\n  •  Decreases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d39e277cab12145e4e1615b00177363e.png",
                        "hashID": 360593481,
                        "weaponHash": 1162247618,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Extended Mag",
                        "description": "This weapon has a greatly increased magazine size, but reloads much slower.\n  •  Greatly increases magazine size\n  •  Greatly decreases reload speed\n  •  Increases airborne effectiveness",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/66cfea124e24e73cca1ce6370b44ca7e.png",
                        "hashID": 2420895100,
                        "weaponHash": 1162247618,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Disruption Break",
                        "description": "Breaking an enemy's shield with this weapon makes them more vulnerable to Kinetic damage for a brief period.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/45b57ce27fa0213218c7cb8f2253c517.png",
                        "hashID": 1683379515,
                        "weaponHash": 1162247618,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Outlaw",
                        "description": "Precision kills greatly decrease reload time.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/382df469a091c33e190ee583b64923e8.png",
                        "hashID": 1168162263,
                        "weaponHash": 1162247618,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Adaptive Frame",
                    "description": "A well-rounded grip, reliable and sturdy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/967fb4abc6ab98f74639d6c08e5f56ee.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            },
            {
                "name": "Gridskipper",
                "type": "Legendary Pulse Rifle",
                "description": "",
                "lore": "\"No stars overhead. Best not to look up.\" —Amanda Holliday",
                "ExtLore": "He heard something and snapped awake. There it was again: the skittering of clawed feet above him. In a moment, he had grabbed the Pulse Rifle from near the door and was outside.\n\nHe saw nothing but the lip of the tar paper roof against the undulating night sky. That didn't mean anything—they could turn invisible. Everyone knew that. They could just be standing there, one or two, or a dozen, staring down at him.\n\nHe looked for shimmering outlines, but his vision was filled by the swaying grid of the dark purple night. He squinted as a ripple rolled high overhead, and the grid seemed to move closer, like an enormous sheet settling over the City.\n\nA wave of pressure pushed down, building in his sinuses. He pressed a hand to his eyes. A deep thrum filled his head, and he heard their claws on the walls all around him, their hissing laughter.\n\nHe turned toward the street, weapon raised. He felt his heart thudding in his chest and sweat beading on his back.\n\nAnother noise: someone pounding on glass behind him.\n\nHe spun and one of them was in his house, looking out at him through the window. His sweaty fingers fumbled to turn the safety off as it opened its mouth—\n\n\"Dad,\" the Fallen shouted, \"you're standing in the garden!\"\n\nHe looked down dumbly. Cherry tomatoes were crushed beneath his bare feet.\n\nHis son yelled again, no longer a Fallen, merely irritated and half asleep. \"Come back inside!\"\n\nHands shaking, he stepped out of the garden. He fought the urge to look into the sky as he walked back to the house.",
                "itemHash": "1621558458",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/dadacb5b9a019bc2c9c639ee00ab2881.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Fluted Barrel",
                        "description": "Ultra-light barrel. \n  •  Greatly increases handling speed\n  •  Slightly increases stability",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/260eba9dd149dbb94b1306c9ed4dd8db.png",
                        "hashID": 1840239774,
                        "weaponHash": 1621558458,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "High-Caliber Rounds",
                        "description": "Shots from this weapon knock the target back farther.\n  •  Slightly increases range",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/9d1c49edb2d2b24c74067742c09fd5a5.png",
                        "hashID": 1561002382,
                        "weaponHash": 1621558458,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Moving Target",
                        "description": "Increased movement speed and target acquisition when moving while aiming down sights.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/40b591eae7f122fdf1cfca21fc6f6c0f.png",
                        "hashID": 588594999,
                        "weaponHash": 1621558458,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Thresh",
                        "description": "Killing combatants with this weapon generates a small amount of Super energy.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7f9dcf3bd4a8a4e0d2d0922827f038c9.png",
                        "hashID": 2726471870,
                        "weaponHash": 1621558458,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Rapid-Fire Frame",
                    "description": "Deeper ammo reserves. Slightly faster reload when magazine is empty.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/801d62d1f9783bee81d5700c54c24fda.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Void",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            },
            {
                "name": "Seventh Seraph CQC-12",
                "type": "Legendary Shotgun",
                "description": "",
                "lore": "Word into law, held at gunpoint.",
                "ExtLore": null,
                "itemHash": "1821724780",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/12b9f844cf2aa0ef460f596cb912ee39.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Rifled Barrel",
                        "description": "Ranged shotgun barrel.\n  •  Increases range\n  •  Greatly decreases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/79d5f1f469d3290cfb849f4b3e6fc16b.png",
                        "hashID": 1332244541,
                        "weaponHash": 1821724780,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Steady Rounds",
                        "description": "This magazine is optimized for recoil control.\n  •  Greatly increases stability \n  •  Slightly decreases range\n  •  Increases airborne effectiveness",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/6c6e1cc341487a8afd0b0c714a229255.png",
                        "hashID": 3177308360,
                        "weaponHash": 1821724780,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Auto-Loading Holster",
                        "description": "The holstered weapon is automatically reloaded after a short period of time.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/e4262099a1c2cea78b48a6680c5248c9.png",
                        "hashID": 3300816228,
                        "weaponHash": 1821724780,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Snapshot Sights",
                        "description": "Faster time to aim down sights.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/ce16c9e2cbd73bb548af3e15bdfc7177.png",
                        "hashID": 957782887,
                        "weaponHash": 1821724780,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Lightweight Frame",
                    "description": "Superb handling. Move faster with this weapon equipped.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/6db8cd21c2b3e6fffeb6f111d6c70dd2.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Reload Speed",
                    "description": "The time it takes to reload this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e3a74e6dd4c520ea17eb1fdaf2128213.jpg",
                    "mwHash": 4283235143
                }
            }
        ],
        "Warlock": {
            "Helmet": {
                "name": "Warmind's Avatar Headpiece",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "Trust him.",
                "ExtLore": "\"He is not compromised!\"\n\nSaint-14's voice echoes off the walls of Ikora's study. It would be hoarse if he weren't an Exo—they've been arguing for over an hour.\n\nIkora crosses her arms over her chest. \"We can't know that for sure.\"\n\n\"You can't,\" Saint fires back, \"but I can. I see it in him. The frustration, the guilt, the pain. Osiris is telling the truth about his visions!\"\n\n\"I don't doubt that he is,\" Ikora replies, a note of frustration creeping into her own voice. \"But my Hidden turned their eyes to Neptune and found nothing. I can't ignore the possibility that Savathûn planted those visions in his head to misdirect us.\"\n\n\"So, you ignore his warnings instead?\" Saint asks pointedly. \"Send your spies for a quick glance and then bury their findings in a drawer? Is every word Osiris speaks forever tainted by the Witch Queen?\"\n\nIkora says nothing in response. The silence drags on until Saint grumbles to himself and turns to leave.\n\n\"Saint,\" Ikora calls after him, warmer than before. \"Osiris needs to rest. Please keep an eye on him.\"\n\n\"Why?\" Saint asks without looking back. \"I'm sure your Hidden have enough eyes on him as it is.\"\n\nHe leaves before Ikora can say another word.\n\nAlone in her study, she reaches into a drawer and pulls out a stack of papers: documents she had once been ordered to destroy but had instead preserved.\n\nOsiris's prophecies, from a time when she trusted his every word.",
                "itemHash": "2974824815",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/edcaaadf8f5fc75ae8e4095e26abbc96.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    51,
                    18,
                    2,
                    6,
                    17,
                    6,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Warmind's Avatar Gloves",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "Caught alone in a tangled web.",
                "ExtLore": "Osiris pulls the hood of his oversized cloak forward. Though he hopes to pass through the Botza District unnoticed, the sharp beak protruding from his shadowy hood betrays his disguise. Eliksni passersby stare at him with suspicion.\n\nThe erstwhile Warlock slips into a darkened corner of The Ether Tank, where the barroom floor bustles with both Human and Eliksni gamblers, who wager whether the Warmind Rasputin will be restored, and how many civilians it will kill if revived. On the far side of the room, Spider lords over the scene with satisfaction. Osiris watches him, intent on finding a way to discretely question him regarding Neptune. The Eliksni crime boss has cultivated a different set of informants than the Hidden, and Osiris needs intel from the widest net possible.\n\nSuddenly, Osiris feels the hair on the back of his neck stand up. Though he no longer has his Light, centuries of training have left his intuition as sharp as ever. He merges into a crowd of karaoke enthusiasts and surveys the room.\n\nStanding just inside the tavern entrance is another cloaked figure. Though their disguise is far more plausible than his own, Osiris can clearly identify the Praxic Warlock, Aunor Mahal. Osiris curses under his breath. \n\nHe retreats through the back entrance into the chill of the night. Osiris feels the darkness close in around him and wonders who among his former allies still trusts him. \n\nGiven everything, he wonders whether he should still trust himself.",
                "itemHash": "1259550198",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/ab0b9286605babb3553f60e3424fb635.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    52,
                    12,
                    8,
                    6,
                    2,
                    22,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Warmind's Avatar Robes",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "Surrounded by shadows.",
                "ExtLore": "Construction scaffolding casts geometric shadows across damp alleyways. Work is still being done to repair the damage caused by Ghaul's invasion, and it is here in this place where rats scurry in the absence of citizens and where Osiris lies in wait. \n\nHe had been here once before, nestled in a crack at the foot of the Schnell building, cupping his hands to his face to hold back the dark tide of necrotic fluid pulsing from his—\n\nNo. That was Savathûn. But still, the shadows remember him, and he remembers their embrace.\n\nOsiris stirs from his reverie the moment his pursuer enters the alley. He can see her shadow cast across the wall, penned in by the scaffolding's negative space. It is an optical illusion of a prison, a trick of the eye. Aunor Mahal notices the configuration and appreciates the symbolism of walking into a spider's web just before Osiris lunges from the darkness, grabbing her by the collar of her robe to slam her up against the opposite wall.\n\nAunor grunts on impact, her gaze trailing down to Osiris's trembling hands holding fistfuls of fabric. While his stare is ferocious, his strength is lacking. She lets him hold her there against the wall, and the moment he realizes he's being pitied, Osiris releases her and takes a step back.\n\n\"Your mind is still sharp,\" Aunor opines. It stings his pride, makes his jaw clench. \"What did you think was going to happen next? I'm not going to fight you.\" She looks him up and down. \"It wouldn't be sporting.\"\n\n\"I remember the day you were raised,\" Osiris says with hushed strength. \"Curled up beneath a ruined bus, screaming for help. Too terrified to listen to your Ghost, too frightened to hold the gun it had nudged under the wreck for you.\"\n\nAunor sucks in a breath through her teeth and smooths the front of her robe. \"I'm not here to hunt you,\" she clarifies. \"I'm here to keep you safe.\" \n\n\"From yourself\" is implied. To that, Osiris has no retort. He reconsiders his surroundings and his actions and shrinks away with regret.",
                "itemHash": "2710316218",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/c1995524ff277c6024c7ea755493292e.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    53,
                    2,
                    22,
                    2,
                    6,
                    2,
                    19
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Warmind's Avatar Pants",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "Searching for here and now.",
                "ExtLore": "Every instinct tells Osiris to fight. And yet…\n\n\"I'm glad you could make it,\" is the warm greeting that Saladin Forge gives to Osiris as he steps into a study aboard the Ascendancy Flagship Eligos Lex V. Cabal architecture blends with rustic Human furnishings that would not look out of place in the Iron Temple. Tea is already steeping when Osiris joins Saladin at the table, the aroma of black Assam bringing back ancient sense memories.\n\n\"I assume your tastes haven't changed much,\" Saladin says, gesturing to the tea.\n\n\"Did Ikora ask you to check on me?\" Osiris asks, and realizes how defensive it sounds the moment it leaves his mouth. He masks his bitter regret by taking a sip of the too-hot tea.\n\n\"No. I wanted to check on an old friend.\" Saladin sits forward, cradling his own cup without lifting it from the table. \"But I see you survived a Lightless encounter with not one but two Hive gods. I'd say you're doing better than most.\"\n\nThe pride in Saladin's voice makes Osiris's stomach turn. Not out of uneasiness, but out of shame. And yet, Saladin's certainty isn't patronizing. It's not in his nature to be.\n\n\"You're content here?\" Osiris deflects. \"Among the Cabal?\"\n\nSaladin shrugs away his question. \"Contentment is a luxury neither of us can afford. I am here. That's what matters. My place is here now, and humanity is better for it.\" A moment of silence hangs over the two, and Saladin is the first to brave that space. \"How long has it been since you and I took tea together?\"\n\n\"I can't even remember,\" Osiris says. \"So long ago that it feels like a dream.\" Then, quieter: \"Jolder was there.\"\n\nSaladin says nothing, focusing instead on his rippling reflection in the teacup. \n\n\"I should not have mentioned her name,\" Osiris adds softly.\n\n\"No.\" Saladin's response is swift and firm. \"I don't want Jolder's memory to fade like so many others. It may hurt to remember, but that pain reminds us that we lived.\"",
                "itemHash": "2471829328",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/3b3a3501794a5d0ab24f26315ec935f4.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    56,
                    2,
                    24,
                    2,
                    2,
                    9,
                    17
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Warmind's Avatar Bond",
                "type": "Legendary Warlock Bond",
                "description": "",
                "lore": "Let him find what he needs.",
                "ExtLore": "Datapads are stacked atop handwritten field reports stacked upon leatherbound tomes. They rest in a spot of sunlight spilling through a round window draped with linen curtains dyed sunset hues and framed by crawling ivy and wisteria.\n\nOsiris stoops over the table, half in the beam of afternoon light and half out. An audio log plays on one of the tablets, with subtitles to translate the speaker's tongue of Ulurant:\n\n<<ATMOSPHERIC COMPOSITION HYDROGEN, HELIUM, METHANE. SCANS SHOW NO ACTIVE STRUCTURES OR CIVILIZATIONS.>>\n\nOsiris clenches one hand into a trembling fist, then scrubs forward in the log.\n\n<<STARSHIP TRANSIT CORRIDORS NEAR PLANETARY BODY ARE NON-EXISTENT. LACK OF HABITATION IDEAL FOR CONCEALING CIVILIAN FLEET. NO SIGNS OF PRIOR HUMAN HABITATION. >>\n\nCursing, Osiris sweeps the tablet off the table along with the books and notes. A scream rises from his mouth, and as he turns in rage, he locks eyes with Saint. Fury burns away to a cool ember of shame the moment Saint steps from the kitchen doorway. His partner is not dressed in armor, a sight few ever see. Instead, his broad shoulders are concealed by a loose poncho of magenta and lilac bearing embroidered bird patterns spun by Eliksni hands.\n\nSaint approaches and gently cups Osiris's face in his hands. The gesture causes the tension to melt away, and Osiris rests a cheek against Saint's fingers.\n\n\"Why are you so angry?\" Saint asks, his voice gentle and reassuring. It isn't so much a question as it is an exercise.\n\n\"I'm afraid,\" Osiris whispers into Saint's palm. \"That Ikora is right. That I—That I'm—\" It takes time for Osiris to make his fear real with words, but Saint gives it to him. \n\n\"…That I'm broken.\"\n\nSaint pulls Osiris to his chest in a firm embrace, then presses a kiss to the top of his head. \"You are not a teacup,\" he whispers against the shorter man's scalp.  \"People do not break, and you are not broken.\" Osiris rests his forehead against Saint's chest, at once feeling humbled and secure.\n\nThe embrace lingers for as long as Osiris needs it, and when he finally does lean back enough to look up into Saint's eyes, he asks, \"Then what am I?\"\n\nTo which Saint simply replies, \"You are enough.\"",
                "itemHash": "1934312075",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/14e2407f7c43178297165abaf29ecf2e.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Hunter": {
            "Helmet": {
                "name": "Warmind's Avatar Mask",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "Trust him.",
                "ExtLore": "\"He is not compromised!\"\n\nSaint-14's voice echoes off the walls of Ikora's study. It would be hoarse if he weren't an Exo—they've been arguing for over an hour.\n\nIkora crosses her arms over her chest. \"We can't know that for sure.\"\n\n\"You can't,\" Saint fires back, \"but I can. I see it in him. The frustration, the guilt, the pain. Osiris is telling the truth about his visions!\"\n\n\"I don't doubt that he is,\" Ikora replies, a note of frustration creeping into her own voice. \"But my Hidden turned their eyes to Neptune and found nothing. I can't ignore the possibility that Savathûn planted those visions in his head to misdirect us.\"\n\n\"So, you ignore his warnings instead?\" Saint asks pointedly. \"Send your spies for a quick glance and then bury their findings in a drawer? Is every word Osiris speaks forever tainted by the Witch Queen?\"\n\nIkora says nothing in response. The silence drags on until Saint grumbles to himself and turns to leave.\n\n\"Saint,\" Ikora calls after him, warmer than before. \"Osiris needs to rest. Please keep an eye on him.\"\n\n\"Why?\" Saint asks without looking back. \"I'm sure your Hidden have enough eyes on him as it is.\"\n\nHe leaves before Ikora can say another word.\n\nAlone in her study, she reaches into a drawer and pulls out a stack of papers: documents she had once been ordered to destroy but had instead preserved.\n\nOsiris's prophecies, from a time when she trusted his every word.",
                "itemHash": "648266032",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/6c24a0a6dd0f3913979a4089b6b8af27.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    49,
                    17,
                    6,
                    2,
                    12,
                    2,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Warmind's Avatar Vambraces",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "Caught alone in a tangled web.",
                "ExtLore": "Osiris pulls the hood of his oversized cloak forward. Though he hopes to pass through the Botza District unnoticed, the sharp beak protruding from his shadowy hood betrays his disguise. Eliksni passersby stare at him with suspicion.\n\nThe erstwhile Warlock slips into a darkened corner of The Ether Tank, where the barroom floor bustles with both Human and Eliksni gamblers, who wager whether the Warmind Rasputin will be restored, and how many civilians it will kill if revived. On the far side of the room, Spider lords over the scene with satisfaction. Osiris watches him, intent on finding a way to discretely question him regarding Neptune. The Eliksni crime boss has cultivated a different set of informants than the Hidden, and Osiris needs intel from the widest net possible.\n\nSuddenly, Osiris feels the hair on the back of his neck stand up. Though he no longer has his Light, centuries of training have left his intuition as sharp as ever. He merges into a crowd of karaoke enthusiasts and surveys the room.\n\nStanding just inside the tavern entrance is another cloaked figure. Though their disguise is far more plausible than his own, Osiris can clearly identify the Praxic Warlock, Aunor Mahal. Osiris curses under his breath. \n\nHe retreats through the back entrance into the chill of the night. Osiris feels the darkness close in around him and wonders who among his former allies still trusts him. \n\nGiven everything, he wonders whether he should still trust himself.",
                "itemHash": "446049665",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/f33b356e3ed81db101be3e41d4ee405f.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    53,
                    9,
                    2,
                    16,
                    7,
                    6,
                    13
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Warmind's Avatar Vest",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "Surrounded by shadows.",
                "ExtLore": "Construction scaffolding casts geometric shadows across damp alleyways. Work is still being done to repair the damage caused by Ghaul's invasion, and it is here in this place where rats scurry in the absence of citizens and where Osiris lies in wait. \n\nHe had been here once before, nestled in a crack at the foot of the Schnell building, cupping his hands to his face to hold back the dark tide of necrotic fluid pulsing from his—\n\nNo. That was Savathûn. But still, the shadows remember him, and he remembers their embrace.\n\nOsiris stirs from his reverie the moment his pursuer enters the alley. He can see her shadow cast across the wall, penned in by the scaffolding's negative space. It is an optical illusion of a prison, a trick of the eye. Aunor Mahal notices the configuration and appreciates the symbolism of walking into a spider's web just before Osiris lunges from the darkness, grabbing her by the collar of her robe to slam her up against the opposite wall.\n\nAunor grunts on impact, her gaze trailing down to Osiris's trembling hands holding fistfuls of fabric. While his stare is ferocious, his strength is lacking. She lets him hold her there against the wall, and the moment he realizes he's being pitied, Osiris releases her and takes a step back.\n\n\"Your mind is still sharp,\" Aunor opines. It stings his pride, makes his jaw clench. \"What did you think was going to happen next? I'm not going to fight you.\" She looks him up and down. \"It wouldn't be sporting.\"\n\n\"I remember the day you were raised,\" Osiris says with hushed strength. \"Curled up beneath a ruined bus, screaming for help. Too terrified to listen to your Ghost, too frightened to hold the gun it had nudged under the wreck for you.\"\n\nAunor sucks in a breath through her teeth and smooths the front of her robe. \"I'm not here to hunt you,\" she clarifies. \"I'm here to keep you safe.\" \n\n\"From yourself\" is implied. To that, Osiris has no retort. He reconsiders his surroundings and his actions and shrinks away with regret.",
                "itemHash": "4116381015",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/41fb322d6fb964058ea8c864315f7f83.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    59,
                    6,
                    12,
                    8,
                    15,
                    16,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Warmind's Avatar Legguards",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "Searching for here and now.",
                "ExtLore": "Every instinct tells Osiris to fight. And yet…\n\n\"I'm glad you could make it,\" is the warm greeting that Saladin Forge gives to Osiris as he steps into a study aboard the Ascendancy Flagship Eligos Lex V. Cabal architecture blends with rustic Human furnishings that would not look out of place in the Iron Temple. Tea is already steeping when Osiris joins Saladin at the table, the aroma of black Assam bringing back ancient sense memories.\n\n\"I assume your tastes haven't changed much,\" Saladin says, gesturing to the tea.\n\n\"Did Ikora ask you to check on me?\" Osiris asks, and realizes how defensive it sounds the moment it leaves his mouth. He masks his bitter regret by taking a sip of the too-hot tea.\n\n\"No. I wanted to check on an old friend.\" Saladin sits forward, cradling his own cup without lifting it from the table. \"But I see you survived a Lightless encounter with not one but two Hive gods. I'd say you're doing better than most.\"\n\nThe pride in Saladin's voice makes Osiris's stomach turn. Not out of uneasiness, but out of shame. And yet, Saladin's certainty isn't patronizing. It's not in his nature to be.\n\n\"You're content here?\" Osiris deflects. \"Among the Cabal?\"\n\nSaladin shrugs away his question. \"Contentment is a luxury neither of us can afford. I am here. That's what matters. My place is here now, and humanity is better for it.\" A moment of silence hangs over the two, and Saladin is the first to brave that space. \"How long has it been since you and I took tea together?\"\n\n\"I can't even remember,\" Osiris says. \"So long ago that it feels like a dream.\" Then, quieter: \"Jolder was there.\"\n\nSaladin says nothing, focusing instead on his rippling reflection in the teacup. \n\n\"I should not have mentioned her name,\" Osiris adds softly.\n\n\"No.\" Saladin's response is swift and firm. \"I don't want Jolder's memory to fade like so many others. It may hurt to remember, but that pain reminds us that we lived.\"",
                "itemHash": "1940895219",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/f80804044e92948caaf41a4bddb29b71.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    54,
                    2,
                    22,
                    2,
                    6,
                    9,
                    13
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Warmind's Avatar Cloak",
                "type": "Legendary Hunter Cloak",
                "description": "",
                "lore": "Let him find what he needs.",
                "ExtLore": "Datapads are stacked atop handwritten field reports stacked upon leatherbound tomes. They rest in a spot of sunlight spilling through a round window draped with linen curtains dyed sunset hues and framed by crawling ivy and wisteria.\n\nOsiris stoops over the table, half in the beam of afternoon light and half out. An audio log plays on one of the tablets, with subtitles to translate the speaker's tongue of Ulurant:\n\n<<ATMOSPHERIC COMPOSITION HYDROGEN, HELIUM, METHANE. SCANS SHOW NO ACTIVE STRUCTURES OR CIVILIZATIONS.>>\n\nOsiris clenches one hand into a trembling fist, then scrubs forward in the log.\n\n<<STARSHIP TRANSIT CORRIDORS NEAR PLANETARY BODY ARE NON-EXISTENT. LACK OF HABITATION IDEAL FOR CONCEALING CIVILIAN FLEET. NO SIGNS OF PRIOR HUMAN HABITATION. >>\n\nCursing, Osiris sweeps the tablet off the table along with the books and notes. A scream rises from his mouth, and as he turns in rage, he locks eyes with Saint. Fury burns away to a cool ember of shame the moment Saint steps from the kitchen doorway. His partner is not dressed in armor, a sight few ever see. Instead, his broad shoulders are concealed by a loose poncho of magenta and lilac bearing embroidered bird patterns spun by Eliksni hands.\n\nSaint approaches and gently cups Osiris's face in his hands. The gesture causes the tension to melt away, and Osiris rests a cheek against Saint's fingers.\n\n\"Why are you so angry?\" Saint asks, his voice gentle and reassuring. It isn't so much a question as it is an exercise.\n\n\"I'm afraid,\" Osiris whispers into Saint's palm. \"That Ikora is right. That I—That I'm—\" It takes time for Osiris to make his fear real with words, but Saint gives it to him. \n\n\"…That I'm broken.\"\n\nSaint pulls Osiris to his chest in a firm embrace, then presses a kiss to the top of his head. \"You are not a teacup,\" he whispers against the shorter man's scalp. \"People do not break, and you are not broken.\" Osiris rests his forehead against Saint's chest, at once feeling humbled and secure.\n\nThe embrace lingers for as long as Osiris needs it, and when he finally does lean back enough to look up into Saint's eyes, he asks, \"Then what am I?\"\n\nTo which Saint simply replies, \"You are enough.\"",
                "itemHash": "1949733158",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/c77de0063f8d75f41394ce2553cf3d4b.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Titan": {
            "Helmet": {
                "name": "Warmind's Avatar Helm",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "Trust him.",
                "ExtLore": "\"He is not compromised!\"\n\nSaint-14's voice echoes off the walls of Ikora's study. It would be hoarse if he weren't an Exo—they've been arguing for over an hour.\n\nIkora crosses her arms over her chest. \"We can't know that for sure.\"\n\n\"You can't,\" Saint fires back, \"but I can. I see it in him. The frustration, the guilt, the pain. Osiris is telling the truth about his visions!\"\n\n\"I don't doubt that he is,\" Ikora replies, a note of frustration creeping into her own voice. \"But my Hidden turned their eyes to Neptune and found nothing. I can't ignore the possibility that Savathûn planted those visions in his head to misdirect us.\"\n\n\"So, you ignore his warnings instead?\" Saint asks pointedly. \"Send your spies for a quick glance and then bury their findings in a drawer? Is every word Osiris speaks forever tainted by the Witch Queen?\"\n\nIkora says nothing in response. The silence drags on until Saint grumbles to himself and turns to leave.\n\n\"Saint,\" Ikora calls after him, warmer than before. \"Osiris needs to rest. Please keep an eye on him.\"\n\n\"Why?\" Saint asks without looking back. \"I'm sure your Hidden have enough eyes on him as it is.\"\n\nHe leaves before Ikora can say another word.\n\nAlone in her study, she reaches into a drawer and pulls out a stack of papers: documents she had once been ordered to destroy but had instead preserved.\n\nOsiris's prophecies, from a time when she trusted his every word.",
                "itemHash": "1059446290",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/a562d4f5b217ebb346a666244c48fd27.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    49,
                    10,
                    2,
                    10,
                    2,
                    16,
                    9
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Warmind's Avatar Gauntlets",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "Caught alone in a tangled web.",
                "ExtLore": "Osiris pulls the hood of his oversized cloak forward. Though he hopes to pass through the Botza District unnoticed, the sharp beak protruding from his shadowy hood betrays his disguise. Eliksni passersby stare at him with suspicion.\n\nThe erstwhile Warlock slips into a darkened corner of The Ether Tank, where the barroom floor bustles with both Human and Eliksni gamblers, who wager whether the Warmind Rasputin will be restored, and how many civilians it will kill if revived. On the far side of the room, Spider lords over the scene with satisfaction. Osiris watches him, intent on finding a way to discretely question him regarding Neptune. The Eliksni crime boss has cultivated a different set of informants than the Hidden, and Osiris needs intel from the widest net possible.\n\nSuddenly, Osiris feels the hair on the back of his neck stand up. Though he no longer has his Light, centuries of training have left his intuition as sharp as ever. He merges into a crowd of karaoke enthusiasts and surveys the room.\n\nStanding just inside the tavern entrance is another cloaked figure. Though their disguise is far more plausible than his own, Osiris can clearly identify the Praxic Warlock, Aunor Mahal. Osiris curses under his breath. \n\nHe retreats through the back entrance into the chill of the night. Osiris feels the darkness close in around him and wonders who among his former allies still trusts him. \n\nGiven everything, he wonders whether he should still trust himself.",
                "itemHash": "1525902715",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/a3b2be57d7f34a7f3337456b304fc7a5.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    50,
                    2,
                    22,
                    2,
                    6,
                    6,
                    12
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Warmind's Avatar Chestplate",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "Surrounded by shadows.",
                "ExtLore": "Construction scaffolding casts geometric shadows across damp alleyways. Work is still being done to repair the damage caused by Ghaul's invasion, and it is here in this place where rats scurry in the absence of citizens and where Osiris lies in wait. \n\nHe had been here once before, nestled in a crack at the foot of the Schnell building, cupping his hands to his face to hold back the dark tide of necrotic fluid pulsing from his—\n\nNo. That was Savathûn. But still, the shadows remember him, and he remembers their embrace.\n\nOsiris stirs from his reverie the moment his pursuer enters the alley. He can see her shadow cast across the wall, penned in by the scaffolding's negative space. It is an optical illusion of a prison, a trick of the eye. Aunor Mahal notices the configuration and appreciates the symbolism of walking into a spider's web just before Osiris lunges from the darkness, grabbing her by the collar of her robe to slam her up against the opposite wall.\n\nAunor grunts on impact, her gaze trailing down to Osiris's trembling hands holding fistfuls of fabric. While his stare is ferocious, his strength is lacking. She lets him hold her there against the wall, and the moment he realizes he's being pitied, Osiris releases her and takes a step back.\n\n\"Your mind is still sharp,\" Aunor opines. It stings his pride, makes his jaw clench. \"What did you think was going to happen next? I'm not going to fight you.\" She looks him up and down. \"It wouldn't be sporting.\"\n\n\"I remember the day you were raised,\" Osiris says with hushed strength. \"Curled up beneath a ruined bus, screaming for help. Too terrified to listen to your Ghost, too frightened to hold the gun it had nudged under the wreck for you.\"\n\nAunor sucks in a breath through her teeth and smooths the front of her robe. \"I'm not here to hunt you,\" she clarifies. \"I'm here to keep you safe.\" \n\n\"From yourself\" is implied. To that, Osiris has no retort. He reconsiders his surroundings and his actions and shrinks away with regret.",
                "itemHash": "839296981",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/0d6e7171f595f3c0fd99ea62e3e58f2b.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    52,
                    13,
                    11,
                    2,
                    11,
                    8,
                    7
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Warmind's Avatar Legplates",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "Searching for here and now.",
                "ExtLore": "Every instinct tells Osiris to fight. And yet…\n\n\"I'm glad you could make it,\" is the warm greeting that Saladin Forge gives to Osiris as he steps into a study aboard the Ascendancy Flagship Eligos Lex V. Cabal architecture blends with rustic Human furnishings that would not look out of place in the Iron Temple. Tea is already steeping when Osiris joins Saladin at the table, the aroma of black Assam bringing back ancient sense memories.\n\n\"I assume your tastes haven't changed much,\" Saladin says, gesturing to the tea.\n\n\"Did Ikora ask you to check on me?\" Osiris asks, and realizes how defensive it sounds the moment it leaves his mouth. He masks his bitter regret by taking a sip of the too-hot tea.\n\n\"No. I wanted to check on an old friend.\" Saladin sits forward, cradling his own cup without lifting it from the table. \"But I see you survived a Lightless encounter with not one but two Hive gods. I'd say you're doing better than most.\"\n\nThe pride in Saladin's voice makes Osiris's stomach turn. Not out of uneasiness, but out of shame. And yet, Saladin's certainty isn't patronizing. It's not in his nature to be.\n\n\"You're content here?\" Osiris deflects. \"Among the Cabal?\"\n\nSaladin shrugs away his question. \"Contentment is a luxury neither of us can afford. I am here. That's what matters. My place is here now, and humanity is better for it.\" A moment of silence hangs over the two, and Saladin is the first to brave that space. \"How long has it been since you and I took tea together?\"\n\n\"I can't even remember,\" Osiris says. \"So long ago that it feels like a dream.\" Then, quieter: \"Jolder was there.\"\n\nSaladin says nothing, focusing instead on his rippling reflection in the teacup. \n\n\"I should not have mentioned her name,\" Osiris adds softly.\n\n\"No.\" Saladin's response is swift and firm. \"I don't want Jolder's memory to fade like so many others. It may hurt to remember, but that pain reminds us that we lived.\"",
                "itemHash": "4270910189",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/e08f4f4667019b62a921adbf1b950063.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    52,
                    2,
                    22,
                    2,
                    18,
                    2,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Warmind's Avatar Mark",
                "type": "Legendary Titan Mark",
                "description": "",
                "lore": "Let him find what he needs.",
                "ExtLore": "Datapads are stacked atop handwritten field reports stacked upon leatherbound tomes. They rest in a spot of sunlight spilling through a round window draped with linen curtains dyed sunset hues and framed by crawling ivy and wisteria.\n\nOsiris stoops over the table, half in the beam of afternoon light and half out. An audio log plays on one of the tablets, with subtitles to translate the speaker's tongue of Ulurant:\n\n<<ATMOSPHERIC COMPOSITION HYDROGEN, HELIUM, METHANE. SCANS SHOW NO ACTIVE STRUCTURES OR CIVILIZATIONS.>>\n\nOsiris clenches one hand into a trembling fist, then scrubs forward in the log.\n\n<<STARSHIP TRANSIT CORRIDORS NEAR PLANETARY BODY ARE NON-EXISTENT. LACK OF HABITATION IDEAL FOR CONCEALING CIVILIAN FLEET. NO SIGNS OF PRIOR HUMAN HABITATION. >>\n\nCursing, Osiris sweeps the tablet off the table along with the books and notes. A scream rises from his mouth, and as he turns in rage, he locks eyes with Saint. Fury burns away to a cool ember of shame the moment Saint steps from the kitchen doorway. His partner is not dressed in armor, a sight few ever see. Instead, his broad shoulders are concealed by a loose poncho of magenta and lilac bearing embroidered bird patterns spun by Eliksni hands.\n\nSaint approaches and gently cups Osiris's face in his hands. The gesture causes the tension to melt away, and Osiris rests a cheek against Saint's fingers.\n\n\"Why are you so angry?\" Saint asks, his voice gentle and reassuring. It isn't so much a question as it is an exercise.\n\n\"I'm afraid,\" Osiris whispers into Saint's palm. \"That Ikora is right. That I—That I'm—\" It takes time for Osiris to make his fear real with words, but Saint gives it to him. \n\n\"…That I'm broken.\"\n\nSaint pulls Osiris to his chest in a firm embrace, then presses a kiss to the top of his head. \"You are not a teacup,\" he he whispers against the shorter man's scalp.  \"People do not break, and you are not broken.\" Osiris rests his forehead against Saint's chest, at once feeling humbled and secure.\n\nThe embrace lingers for as long as Osiris needs it, and when he finally does lean back enough to look up into Saint's eyes, he asks, \"Then what am I?\"\n\nTo which Saint simply replies, \"You are enough.\"",
                "itemHash": "4256213288",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/20608967f7d674365058cad83dc80004.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        }
    }
}