{
    "Location": "The Last City",
    "Planet": "Earth",
    "Landing Zone": "Tower Hangar",
    "Week": "December 15, 2023",
    "Exotics": {
        "Exotic Engram": {
            "name": "Exotic Engram",
            "type": "Exotic Engram",
            "description": "An engram with a predestined outcome.\n\nContains a new Exotic if any of the possible rewards remain to be collected. Preview contents for possible rewards.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "3875551374",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/ee21b5bc72f9e48366c9addff163a187.png",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Quest": {
            "name": "Xenology",
            "type": "Exotic Quest Step",
            "description": "Complete Vanguard playlist activities, or win matches in Crucible or Gambit.\n\nExtra progress is awarded for more challenging activities and for succeeding with clanmates.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "2125848607",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/7f9e6e79bb7a8ce59de9258a7d674af2.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Weapon": {
            "name": "Black Talon",
            "type": "Exotic Sword",
            "description": "",
            "lore": "\"His life brought peace to the Reef. His death brings a sword.\" —Crows of the Black Hull",
            "ExtLore": "Three months after the Taken War…\n\nHallam found her in the washroom closest to the Black Hull entrance.\n\n\"We're going to be late.\"\n\nPetra sat on the sink, eyes dry, shoulders squared. \"I'm not going.\"\n\nHallam let his Paladin-straight posture relax a little. \"The Regent-Commander should probably attend the late prince's memorial. The Crows will want to see you. I hear they've commissioned a sword in his honor.\"\n\n\"If I go, it's as good as saying he's dead. As good as saying Mara's dead.\"\n\n\"Well,\" Hallam exhaled. \"Aren't they?\"\n\nPetra ground her teeth. Then: \"But I want people to believe.\"",
            "itemHash": "3766045777",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/b40fd2d06867196af70a4bce290f15fc.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Crow's Wings",
                    "description": "[Heavy Attack]  : Fire a heavy projectile attack. \nHeavy attacks are stronger with full energy.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/f8345b65625301dd9b85294e3796a829.png",
                    "hashID": 4072668471,
                    "weaponHash": 3766045777,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Tempered Edge",
                    "description": "Increased sword damage and ammo.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/694a093ed0c7718b05cdf1ebaa3dd648.png",
                    "hashID": 938542991,
                    "weaponHash": 3766045777,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Heavy Guard",
                    "description": "Sword Guard has high overall defenses, but lowers charge rate.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/6ec0f787c192f27f4039140af9be1af9.png",
                    "hashID": 2349202967,
                    "weaponHash": 3766045777,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Tireless Blade",
                    "description": "Sword ammo granted for every other powered sword kill.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d597ced6ce0812d168ce86b31eaaeb03.png",
                    "hashID": 2590710093,
                    "weaponHash": 3766045777,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Power",
            "legendWeaponDamageElement": "Void",
            "masterworkData": null
        },
        "Hawkmoon": {
            "name": "Hawkmoon",
            "type": "Exotic Hand Cannon",
            "description": "",
            "lore": "Stalk thy prey and let loose thy talons upon the Darkness.",
            "ExtLore": "What is this feeling?\n\nI did not ask for it. I do not understand it. I do not want it.\n\nThe Crow is so carefree in his ignorance. The bonfire's glow lights up his pale features and I am drawn to the hope in his gold eyes. Where is the despairing child I anticipated?\n\nHe drinks from an open bottle of wine against the recommendation of his Ghost. The Guardian encourages him and they are laughing. This celebration is maddening; neither have reason to be so jubilant. Their world is ending and they thrash like dying creatures in the final light of collapsing stars. They do not seem to acknowledge the futility of their existence, the impermanence of it in the face of cosmic annihilation.\n\nNow the Guardian is drinking, standing close to the fire. Their Ghost, too, encourages them not to partake. They poison themselves for the enjoyment of it.\n\nI am reminded of my sisters. Of moments spent by lapping shores, gazing up at infinite stars full of possibilities and wonder. I am left yearning.\n\nWhat is this feeling?\n\nI do not understand it. I do not want it.\n\nThey are celebrating their victory over the Taken. The Crow is making a gun shape with his hand, swinging the nearly empty bottle of wine around in the other like a Sword. The Guardian looks pensive, sitting on a rock by the fire, contemplating the secret they are keeping. The Crow notices, but tries not to show it. He wants the Guardian's spirits to be lifted. He wants to be supportive, so that they may share in their triumphs together.\n\nAs equals.\n\nI am reminded of my home. I am reminded of the warmth of the sun and the embrace of my family. I am reminded of my father's face. I am reminded of everyone I betrayed. All the blood spilled in the name of immortality. The warmth of the sun burns me with its memory.\n\nWhat is this feeling?\n\nI do not want it.\n\nThe fire has nearly died. The Crow fell over and cannot stand, though he insists he is fine. The Guardian is turning the embers with the tip of their Sword. The Ghosts are talking to one another in quiet conspiracy. The celebration has ended, but I can sense their emotions are mixed: complex and myriad things, when a simple, singular focus would suffice.\n\nThere is a growing kinship here. Against better judgment.\n\nWhat is this feeling?",
            "itemHash": "3856705927",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/cef1290d58a2d94d1437e1e569fa7996.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Paracausal Shot",
                    "description": "Final blows and precision hits with Hawkmoon grant stacks of Paracausal Charge. The final round in the magazine deals bonus damage based on the number of stacks. Stowing Hawkmoon on the final round removes this bonus.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/243f5529bbd845871803181958599473.png",
                    "hashID": 213689231,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Full Bore",
                    "description": "Barrel optimized for distance.\n  •  Greatly increases range\n  •  Decreases stability\n  •  Slightly decreases handling speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/40a4bdcf0f5a4e492927f9569eaf529d.png",
                    "hashID": 202670084,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Alloy Magazine",
                    "description": "Faster reloads when the magazine is empty.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/069170916c98748b7b3e33b80bd7d689.png",
                    "hashID": 1431678320,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Eye of the Storm",
                    "description": "This weapon becomes more accurate and boosts handling as your health gets lower.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8f4755f9068959b26b8829641e5725ad.png",
                    "hashID": 699525795,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Heavy Grip",
                    "description": "This grip is weighted for recoil control.\n  •  Increases stability\n  •  Decreases handling speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/02a60561b11d9abee82741981af12a3f.png",
                    "hashID": 1012699414,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Kinetic",
            "legendWeaponDamageElement": "Kinetic",
            "masterworkData": null
        },
        "Warlock Exotic": {
            "name": "Winter's Guile",
            "type": "Exotic Gauntlets",
            "description": "",
            "lore": "\"I know you.\" —Lord Felwinter",
            "ExtLore": "\"Listen to me very carefully. They're coming for you. They'll ask you for a name. Your name is Felwinter.'\" \n\"I don't think that's my name.\" \n\"I know. Say it anyway.\" \n\"Why can't I remember my name? I always remember my name. Something's wrong. Was I damaged in Crypt processing?\" \n\"I don't know anything about the Deep Stone Crypt. Before my time.\" \n\"What the hell are you?\" \n\"You don't trust me.\" \n\"No.\" \n\"You will.\" \n\"You're a very presumptuous little drone. What makes you think that?\" \n\"No one else will help you. It's kill or die out there.\"",
            "itemHash": "3844826443",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/0c586f183b821e16dd9b696c8e871d2b.jpg",
            "rarity": "Exotic",
            "class": 2,
            "statRolls": [
                64,
                10,
                14,
                8,
                10,
                16,
                6
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Warlord's Sigil",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/afb8bae64742a8633975b1bc85c98923.png",
                    "desc": "Defeating targets with melee attacks increases your melee damage. Targets encased by Penumbral Blast automatically shatter."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Hunter Exotic": {
            "name": "Liar's Handshake",
            "type": "Exotic Gauntlets",
            "description": "",
            "lore": "Look 'em in the eye.",
            "ExtLore": "While Otto and I finish up inside, Thalia covers the lookout.\n\nHe's a thin, quick shadow, this lookout, and he watches every angle. He listens for every sound. He's on his toes, ready to throw up the alarm the second he sees one little thing out of place.\n\nGuy like that sees everything, but he doesn't see Thalia.\n\nShe comes out of the shadows like a ghost, but steps full into the light, because now she wants to be seen. She waits a second too long for my liking—gives him too much breathing room between the reveal and her first punch. But I shouldn't doubt her. He doesn't even have time to bring his hands up. He's fast, but she's faster.\n\nShe throws herself into every punch like it's her last, dodges and ducks his blows like a dancer. Scariest of all, she bares her teeth in this nasty smile while she does it. Doesn't make a sound.\n\nSo that's the last thing the lookout sees: her silent, grinning face, as her cross-counter reveals a hidden knife that slides smoothly into the soft flesh under his chin.\n\nNever touches a gun, that girl. She likes to get close. Likes to look right in their eyes and be the last thing they see.\n\nThalia lets him drop, wipes her knife clean on her sleeve, and raises her hand for Ayrin. Go, man, go.",
            "itemHash": "4165919945",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/39a2f16e2f092e37f21eb5f61f107594.jpg",
            "rarity": "Exotic",
            "class": 1,
            "statRolls": [
                67,
                8,
                26,
                2,
                23,
                6,
                2
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Cross Counter",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/71a75146e38ba257b7379af0efacd61f.png",
                    "desc": "Using your Arc melee ability or being hit by a melee attack will allow you to follow up with an extremely powerful melee counterpunch that will heal you."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Titan Exotic": {
            "name": "Armamentarium",
            "type": "Exotic Chest Armor",
            "description": "",
            "lore": "For this, there is one remedy.",
            "ExtLore": "True freedom is an iron-clad lock\nAnd the most useful key, a rock\nThe tastiest spice is hunger\nAnd the truest certainty—wonder. \n\nThe best repair is but destruction, \nThe purest ignorance, instruction\nThe safest shelter is an offensive, \nAnd to fall in battle is true ascension\n\nBrothers and sisters, bear thy arms and be merry\nTo the front, to battle!\nDefeat is a sickness and we've found the cure",
            "itemHash": "3874247549",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/f1fd65d0fc4a21dcf29c4a18f347a62d.jpg",
            "rarity": "Exotic",
            "class": 0,
            "statRolls": [
                64,
                2,
                8,
                24,
                20,
                2,
                8
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "And Another Thing",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/87ed6eb97c923d6a8d0e14639f4b7791.png",
                    "desc": "Gain an additional grenade charge."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        }
    },
    "Legendaries": {
        "Legendary weapons": [
            {
                "name": "Chroma Rush",
                "type": "Legendary Auto Rifle",
                "description": "",
                "lore": "Drink from the data stream.",
                "ExtLore": "The Eliksni awkwardly shouldered its way onto the empty stool at the ramen shop and rested its four elbows on the bar.\n\nMaurice looked up over the huge pot of broth and, thinking a Titan in one of their ridiculous helmets had arrived for lunch, called out \"Irasshaimase!\" It wasn't until he absently stepped to the bar that he realized who his customer was.\n\nMetal plating covered the creature's forehead and the side of its face, ending in a nozzle that hissed a stream of blueish mist. A haphazard collision of heavy canvas and metallic weave draped over its shoulders. A Vanguard lanyard dangled absurdly from its neck. \n\nIt was small for an Eliksni, but its angular head still towered above Maurice as it hunched over the bar. Four blue eyes looked back at him from above a lipless mouth. It opened, revealing rows of thin, sharp teeth. \n\n\"One item ramen soup,\" the Eliksni croaked stiltedly. \"Please.\" \n\nMaurice held his breath, tightened his grip on his pencil, and grinned. He grinned when he was nervous, and this seemed like as good a time as any. \n\nThe Eliksni grinned back, nodded, and then opened its horrible mouth again. \"I smelled it, and the smell was good,\" it said.\n\nMaurice scanned the bar. His other customers sat frozen, their bowls of ramen steaming silently in front of them. He realized his mouth had apparently decided to talk on its own, as if nothing were wrong. He heard himself ask, \"How spicy, zero to five stars?\"\n\nThe Eliksni had anticipated this question. \"Spicy five stars,\" it said, holding up one hand with three claws splayed, and another with two. \"May I receive additional dead flesh, please?\"\n\n\"You got it,\" Maurice said, his even voice betraying none of his tension, and he turned back to the bubbling pot of broth. Muscle memory took over, and he soon found himself placing a steaming bowl of ramen in front of the creature, who clucked cheerfully.\n\nMaurice took a half-step back. A small crowd was forming in the walkway in front of the restaurant. Some of the customers leaned in as their curiosity overcame their terror. Maurice noticed the woman in seat 2 needed more water, but it could wait. \n\nThe Eliksni raised its arms tentatively, then looked to Maurice again. \"What is the protocol?\" \n\nMaurice found himself unsure of which pair of the Eliksni's eyes to look into and focused on the ramen instead. \"Well, you eat the noodles and pork and egg with—\" \n\n\"Egg,\" repeated the Eliksni, enjoying the unfamiliar word.\n\n\"—yeah, egg. You eat all that with the chopsticks, and you get the broth with the spoon.\" Maurice saw how the Eliksni's claws dwarfed the ceramic spoon. \"Or you can just lift the whole bowl and drink it.\"\n\nMaurice mimed lifting a bowl to his lips. The Eliksni nodded. Its claws tapped the metal on its face and the hissing blue mist ceased. \n\nThe Eliksni held the chopsticks, tested their weight, and respectfully placed them back on the bar before bringing the bowl to its mouth with its upper arms. Above the ramen bowl, Maurice saw all four of the Eliksni's eyes close. \n\nA long moment of tension fell over the shop, the silence broken only by a staccato series of hissing slurps.\n\nFinally, the Eliksni lowered the empty bowl. It breathed in as the blue mist resumed its thin spray. It looked toward Maurice. \"I tasted all of it,\" it said with deep satisfaction. \"I am very thankful.\"\n\nMaurice's grin turned into a tentative smile. \"Glad you enjoyed it.\" \n\nThe Eliksni stood and held out what looked like a small model of the Traveler. It glowed as it floated in the Eliksni's palm. \"Compensation,\" it said.\n\nMaurice reached to take the treasure, then drew his hand back. \"For new customers, there is no charge,\" he said. \"No compensation. Thank you for coming in.\" \n\nThe Eliksni cocked its head, then clucked and the model vanished beneath the folds of its cloak. It smiled at Maurice. \n\n\"You,\" it said, then cleared its throat with a rumble, \"you are a—\" and the five spirited words that followed were replete with hard consonants. \n\nIn the confused silence that followed, the Eliksni nodded graciously, then walked through the crowd outside and deeper into the City.",
                "itemHash": "1119734784",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/7393c216e3b437571e64f78a613dc181.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Extended Barrel",
                        "description": "Weighty barrel extension.\n  •  Increases range\n  •  Decreases handling speed\n  •  Moderately controls recoil",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9e5e8fa07a84c29252b78b0e7b3106d.png",
                        "hashID": 1467527085,
                        "weaponHash": 1119734784,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Accurized Rounds",
                        "description": "This weapon can fire longer distances.\n  •  Increases range",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d85024478504205359c7fb52dbc4f6b6.png",
                        "hashID": 3142289711,
                        "weaponHash": 1119734784,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Feeding Frenzy",
                        "description": "Each rapid kill with this weapon progressively increases reload speed for a short time.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/89d7e65f5ebe8d291ea96f128765921d.png",
                        "hashID": 2779035018,
                        "weaponHash": 1119734784,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Kill Clip",
                        "description": "Reloading after a kill grants increased damage.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0afd4799427004b2d8170ab213a2ef0c.png",
                        "hashID": 1015611457,
                        "weaponHash": 1119734784,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Rapid-Fire Frame",
                    "description": "Deeper ammo reserves. Slightly faster reload when magazine is empty.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/801d62d1f9783bee81d5700c54c24fda.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Kinetic",
                "masterworkData": {
                    "name": "Reload Speed",
                    "description": "The time it takes to reload this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e3a74e6dd4c520ea17eb1fdaf2128213.jpg",
                    "mwHash": 4283235143
                }
            },
            {
                "name": "Eternity's Edge",
                "type": "Legendary Sword",
                "description": "",
                "lore": "\"A sword is a wand that casts two spells: parry and cut.\" —Tarsem Sauer",
                "ExtLore": null,
                "itemHash": "2782325301",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/db84dfbb8cc5045c401583367df23276.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Hungry Edge",
                        "description": "Increased sword ammo.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/974bb52d2a830e83bb142699b31e567c.png",
                        "hashID": 436053704,
                        "weaponHash": 2782325301,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Infinite Guard",
                        "description": "Sword Guard has balanced defenses and maximized endurance.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/6aef1709498dad9c61e2d85874f34c8b.png",
                        "hashID": 2363751990,
                        "weaponHash": 2782325301,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Tireless Blade",
                        "description": "Sword ammo granted for every other powered sword kill.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d597ced6ce0812d168ce86b31eaaeb03.png",
                        "hashID": 2590710093,
                        "weaponHash": 2782325301,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Assassin's Blade",
                        "description": "Sword final blows boost movement speed and damage.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/3084651d1a6c6d206994af7f92856dfe.png",
                        "hashID": 354401740,
                        "weaponHash": 2782325301,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Vortex Frame",
                    "description": "[Heavy Attack]  : Launch a heavy spin attack.\nHeavy attacks are stronger with full energy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/23e50e126159f0f22983f73d6a246f0d.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Impact",
                    "description": "Increases the damage inflicted by each round.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/f2354558ad75fb2527155f0f58c2dcc3.jpg",
                    "mwHash": 1486919755
                }
            },
            {
                "name": "The Vision",
                "type": "Legendary Sidearm",
                "description": "",
                "lore": "Glory in the damage the right blast can do.",
                "ExtLore": "Director Lakshmi-2,\n\nEnough is enough. I know what you're using, and I'll be speaking with the Vanguard. The fact that you think you can interpret what has driven dozens to insanity doesn't give me a good deal of confidence in your decision-making abilities, and I can't keep my concerns internal any longer. We don't need another Sundaresh in the upper ranks.\n\nI don't care if you saw the Red War before it happened. What would you say of the several other unfruitful predictions you conveniently ignore now?\n\nI have listened to your speeches and read your many messages calling for support. I understand you believe the future is at stake, and we are supposed to do something about that. Fear over the Fallen is not the future this organization was meant to combat. Your paranoia won't change my mind.\n\nMy children were harassed in the streets today for daring to bring food to the Eliksni Quarter. They came home in tears, and I wonder how long until it becomes worse. I won't be a part of spreading that fear. I won't participate in splitting this City and turning it against itself. I'm well aware of the dangers posed by Fallen Houses, but the City remains strong because we stand together.\n\nYou're a student of history. You know how the Iron Lords converted Warlords into dutiful servants of the Light. Lord Shaxx alone should speak to the value of that effort. If a Fallen House wants to stand with us against their own—just like the Warlords of old, just like Fallen in the Reef did—who are you to tell them no?\n\nArmies, we can keep out. The Guardians will hold the wall. That danger is nowhere close to the death from within that you are stoking. If it all falls apart, just remember Mithrax didn't fire the first shot. You did.\n\nConsider this my resignation,\n\nNovarro",
                "itemHash": "2414141462",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/00a269571904bff3d4abb858f80461ac.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Control SAS",
                        "description": "Stable Sidearm sight. \n  •  Increases handling speed\n  •  Increases stability",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/687240e502cf2c8546f70d1d7589aaf2.png",
                        "hashID": 445755706,
                        "weaponHash": 2414141462,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Alloy Magazine",
                        "description": "Faster reloads when the magazine is empty.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/069170916c98748b7b3e33b80bd7d689.png",
                        "hashID": 1431678320,
                        "weaponHash": 2414141462,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Surplus",
                        "description": "Increases handling, reload speed, and stability for each fully charged ability.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/a4c054c3547840300b9ce7ef11b7b6fc.png",
                        "hashID": 3436462433,
                        "weaponHash": 2414141462,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Disruption Break",
                        "description": "Breaking an enemy's shield with this weapon makes them more vulnerable to Kinetic damage for a brief period.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/45b57ce27fa0213218c7cb8f2253c517.png",
                        "hashID": 1683379515,
                        "weaponHash": 2414141462,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Omolon Adaptive Frame",
                    "description": "Well-rounded, reliable, fires a 3-round burst.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/967fb4abc6ab98f74639d6c08e5f56ee.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            },
            {
                "name": "Fractethyst",
                "type": "Legendary Shotgun",
                "description": "",
                "lore": "\"Imagine that as the last sound you hear.\" —Petra Venj",
                "ExtLore": "Amanda Holliday finished welding the new fluid catch to the underside of the Ether tanks with a satisfied grunt. She wriggled her way backwards into the corridor and bumped into the legs of the massive Eliksni who was crouched behind her.\n\n\"Mithrax!\" she scolded, pulling off her welding helmet.\n\n\"Amanda,\" Mithrax replied. \"You are unexpected, but welcome. You are improving our Ether tanks?\"\n\n\"I threw a fresh fluid catch on there, yeah,\" Amanda shrugged as she repacked her tools. \"It's nothing you couldn't do yourselves, but I was passing by.\"\n\nMithrax gazed across the Botza District for a moment. \"I find that unlikely,\" he said wryly.\n\nAmanda laughed. \"C'mon now. You know what they say about gift horses.\"\n\nMithrax cocked his head.\n\n\"Forget it,\" she said. \"So, how've y'all been doing down here? Since, y'know…\" she trailed off.\n\n\"Since the Human and Vex attacks have ceased, we have been well,\" Mithrax said, standing to his full height as he pulled Amanda to her feet. \"With the Endless Night lifted, resources are more plentiful. I see your people and mine moving forward together.\"\n\n\"Yeah, it's nice,\" Amanda agreed. \"Things are happening now I wouldn't have dreamed of a few months ago. The other day, I saw a group of Eliksni at the Bazaar picking out Ghost shells!\" \n\nMithrax's laughter was a deep rumble. \"Yes, the empty shells are quite beautiful. Would you introduce me to your Ghost, Amanda? I would enjoy meeting them.\"\n\n\"Ooh, sorry,\" Amanda chuckled. She put two fingers to her wrist. \"Still got a pulse. No Ghost for me.\" \n\nMithrax balked. \"You are not a Lightbearer?\"\n\n\"Nope,\" she said, \"just a regular person.\"\n\nMithrax thought for a moment. \"To aid as you do without the gift of the Light…\" he said, bringing a clawed hand to his chest and bowing. \"There is much my people would learn from you.\"\n\nAmanda shifted from one foot to the other and scratched at her neck. \"Afraid I ain't much of a teacher,\" she said quietly.\n\nMithrax smiled. \"I find that unlikely.\"",
                "itemHash": "3184681056",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/9feb11833613f20e0e9bab915c4fa47a.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Smoothbore",
                        "description": "Smooth shotgun barrel. Greatly increases range at the cost of more projectile spread.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/893c134549afba522b3cbd2e43fdf4fa.png",
                        "hashID": 466087222,
                        "weaponHash": 3184681056,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Appended Mag",
                        "description": "This weapon's magazine is built for higher capacity.\n  •  Increases magazine size",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9f468cce26fe35d9db413e2f8451127.png",
                        "hashID": 1087426260,
                        "weaponHash": 3184681056,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Full Auto Trigger System",
                        "description": "Holding down the trigger will fire this weapon at full auto.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/85059dae97dea2121091a0f787e20985.png",
                        "hashID": 2117683199,
                        "weaponHash": 3184681056,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Adagio",
                        "description": "After defeating a target, this weapon fires, charges, or draws more slowly and deals increased damage for a brief time.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/b344c34bf750a840b24ff5d2f8fe4507.png",
                        "hashID": 3673922083,
                        "weaponHash": 3184681056,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Precision Frame",
                    "description": "This weapon's recoil pattern is more predictably vertical.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e9dd736124e8ef94048901a279a5bb18.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Stasis",
                "masterworkData": {
                    "name": "Handling",
                    "description": "The speed with which the weapon can be readied and aimed.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/d2e1ab2542f585d025fb4cc1a3885164.jpg",
                    "mwHash": 518224747
                }
            },
            {
                "name": "Canis Major",
                "type": "Legendary Grenade Launcher",
                "description": "",
                "lore": "\"The stars roar with violent destruction. Channel their astral rage.\" —Ylaia, Awoken Techeun",
                "ExtLore": "Petra Venj and Ylaia sat together in a courtyard as the waning dusk of the Dreaming City settled in around them.\n\n\"I began the training first,\" Petra explained, \"but I found it—difficult. It didn't come naturally to me. Not like this.\" She nodded toward the grenade launcher sitting beside her. \n\n\"Imar didn't make it any easier. He was one of the oldest, and the only male Techeun I ever met. I never felt like he gave me an honest chance.\" Petra paused to consider. \"Maybe he'd already looked in the future and saw that I'd washed out.\" \n\n\"I didn't know exactly how unsuited I was until my sister started her training,\" Petra continued. \"Right away, Pinar and I began having long conversations inside our dreams. We'd talk all night and wake up with full memories of what we'd said. That was the first time I realized how powerful she'd become.\" \n\nPetra lowered her eyes. \"Of course, Pinar was Imar's favorite. And the more quickly she progressed, the stronger our shared dreams became. It didn't take long before it was more than just talking.\" \n\n\"She began to manipulate the dreams—changing locations or her shape. I couldn't keep up. It was like being a passenger in my own head. Her dreams became my nightmares.\" Petra shook her head, as if dislodging an unwelcome memory. \"That's when I quit the training and the dreams stopped.\" \n\n\"Eventually I found my place in the Corsairs,\" Petra mused, \"but part of me wishes I had finished my training as a Techeun. If I had, maybe I could still find Pinar out there, in a dream somewhere.\" She plucked a blade of grass from between the paving stones and tossed it into the breeze. \n\nAfter a pensive moment, Petra focused again on Ylaia. \"So, my suggestion is to give the training a chance. If it takes, you'll know. And if not,\" she patted the grenade launcher at her side, \"we've got plenty of other jobs for you.\"",
                "itemHash": "2066434718",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/cc48d0afb44de5a61bc9cc44bbc8897e.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Countermass",
                        "description": "This weapon is weighted for vertical recoil.\n  •  Greatly controls recoil\n  •  Increases stability\n  •  Increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/6fda396e0f2fa3c2eceac79e39f9c44b.png",
                        "hashID": 3809316345,
                        "weaponHash": 2066434718,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Spike Grenades",
                        "description": "Grenades fired from this weapon do increased damage on direct hits.\n  •  Increases stability",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/05302d5b12e5f68541622766f18d3797.png",
                        "hashID": 3301904089,
                        "weaponHash": 2066434718,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Killing Wind",
                        "description": "Final blows grant increased mobility, weapon range, and handling for a short duration.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/db2aa71ff6d808929bb0e668dcf0822e.png",
                        "hashID": 2450788523,
                        "weaponHash": 2066434718,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Adagio",
                        "description": "After defeating a target, this weapon fires, charges, or draws more slowly and deals increased damage for a brief time.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/b344c34bf750a840b24ff5d2f8fe4507.png",
                        "hashID": 3673922083,
                        "weaponHash": 2066434718,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Rapid-Fire Frame",
                    "description": "Deeper ammo reserves. Slightly faster reload when magazine is empty.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/801d62d1f9783bee81d5700c54c24fda.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Blast Radius",
                    "description": "Increases the explosion radius of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/cb114512a0710cab990fb8d5b4af91c6.jpg",
                    "mwHash": 3928770367
                }
            },
            {
                "name": "Legal Action II",
                "type": "Legendary Pulse Rifle",
                "description": "",
                "lore": "It's time to file a complaint.",
                "ExtLore": null,
                "itemHash": "3409645497",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/988aa410cbd1940e194f063ce7305857.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Corkscrew Rifling",
                        "description": "Balanced barrel. \n  •  Slightly increases range and stability\n  •  Slightly increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7730e1732ed7ef91afce50277639c493.png",
                        "hashID": 4090651448,
                        "weaponHash": 3409645497,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Alloy Magazine",
                        "description": "Faster reloads when the magazine is empty.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/069170916c98748b7b3e33b80bd7d689.png",
                        "hashID": 1431678320,
                        "weaponHash": 3409645497,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Underdog",
                        "description": "This weapon gains a boost to reload speed as your health gets lower.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/b3ed57ea544513afd1fe6dfba2bed4cc.png",
                        "hashID": 205890336,
                        "weaponHash": 3409645497,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Rampage",
                        "description": "Kills with this weapon temporarily grant increased damage. Stacks 3x.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8976ead57430e4f5f8af1b3005de4f83.png",
                        "hashID": 3425386926,
                        "weaponHash": 3409645497,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "High-Impact Frame",
                    "description": "Slow firing and high damage. This weapon is more accurate when stationary, moving slowly, and aiming down sights.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/34573143849cf910d2381554bb57a10d.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Kinetic",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            },
            {
                "name": "CALUS Mini-Tool",
                "type": "Legendary Submachine Gun",
                "description": "",
                "lore": "An Earth artifact, refashioned to suit the Emperor's modest tastes.",
                "ExtLore": null,
                "itemHash": "2490988246",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/40909558f2b45d65917eb0c9e245f403.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Arrowhead Brake",
                        "description": "Lightly vented barrel.\n  •  Greatly controls recoil\n  •  Increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/8f7fb54687aa52a9c2595d90ce9c9417.png",
                        "hashID": 839105230,
                        "weaponHash": 2490988246,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Tactical Mag",
                        "description": "This weapon has multiple tactical improvements.\n  •  Slightly increases stability\n  •  Increases reload speed\n  •  Slightly increases magazine size",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/f0e309a267b25279a871d182f8910bcc.png",
                        "hashID": 106909392,
                        "weaponHash": 2490988246,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Slideways",
                        "description": "Sliding partially reloads this weapon's magazine and temporarily boosts handling and stability.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/531db7656c3f2ed054898e141d85b801.png",
                        "hashID": 2039302152,
                        "weaponHash": 2490988246,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Disruption Break",
                        "description": "Breaking an enemy's shield with this weapon makes them more vulnerable to Kinetic damage for a brief period.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/45b57ce27fa0213218c7cb8f2253c517.png",
                        "hashID": 1683379515,
                        "weaponHash": 2490988246,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "To Excess",
                        "description": "Final blows with this weapon while your Super is full grant a bonus to Strength and Discipline for a moderate duration.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/b35084a1bd62b75098f489a6c689ad08.png",
                        "hashID": 1905044254,
                        "weaponHash": 2490988246,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "MIDA Synergy",
                    "description": "Superb handling. Move faster with this lightweight weapon equipped. This weapon grants additional speed benefits when MIDA Multi-Tool is also equipped.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/d8d316f540b241ebab16b4c9a6e73d18.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            }
        ],
        "Warlock": {
            "Helmet": {
                "name": "Pathfinder's Visor",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "Clear mind and strong will serve as guides through the Ley Lines.",
                "ExtLore": "NEW COVEN - I\n\nPetra stood at the bordering cliff's edge of the Divalian Mists, wrapped in a concealing vapor. Beside her, Illyn, Techeun Coven Mother. A deluge of water spewed from deep within the stone below; gentle tremors rippled through their bodies without notice. The pure sky above them tore like well-worn fabric as fronds of malignant Taken growth crept into the Dreaming City.\n\n\"They will be upon us soon. It was not enough to simply halt Oryx's advance,\" Petra said.\n\nShe had spent months of conversation building the kindling to an idea in Illyn's thoughts prior to the Battle of Saturn: a new Coven, a new class of sister recruits. Now, with the queen's flagship in ruins and the Coven missing several of its most skilled Techeuns, there was no longer the luxury of refusal.\n\n\"I can't hold the Reef with Corsairs alone. I can't search for the queen with looking glasses and a depleted armada. We need more Techeuns, Illyn. You know I'm right.\"\n\nIllyn shook her head. \"We are not weapons for the Queen's Wrath to command…\"\n\nThe Coven's reluctance to forge the next link in the chain of their lineage was a strong one. Since the formation of Eleusinia and the exploitation of Riven, the Elder Techeuns had grown protective of their arts. Techniques and texts were kept close. Despite all that, Petra knew Illyn had always been listening to her words. She too had dreamt of the Harbinger's failure. Of Oryx Taking her sisters.\n\n\"…We will snap shut the Ley Lines and seal the city,\" Illyn concluded.\n\n\"No!\" Petra retorted. \"The queen is lost and might still return.\" She turned to the Coven Mother. \"Of your seven, how many are still alive?\"\n\nPetra felt a mournful flame stoking beneath Illyn's visor. \"Precisely,\" Illyn said. \"We haven't the strength.\"\n\n\"Then heed my requests.\" Petra waved away the mist between them. \"Train more sisters.\"\n\nIllyn finally broke her gaze with the sky and scowled at Petra. \"We haven't the time. Training spans decades.\"\n\n\"Make. It. Work,\" Petra demanded before taking a breath and continuing. \"Illyn, I will do whatever you need. Please, can we work through this together?\"\n\nIllyn's head sunk. She leaned over the cliffside—over the stream of plummeting mist—and watched the flow of water drop into endlessness. \"Send me your candidates. I hope they are stronger than you were.\"",
                "itemHash": "3642146012",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/3dd0dc743c92663cf84954ba618d6c47.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    50,
                    2,
                    12,
                    12,
                    6,
                    7,
                    11
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Pathfinder's Wraps",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "Place your palms to the dirt and form the path you wish to walk.",
                "ExtLore": "WAYFINDING - II\n\nYlaia placed her hands on the focusing crystal once more. It had been months since she had seen the stars. Her view every day was instead of the same stone chamber she shared with twelve others; it doubled as both training ground and lodging for a new crop of Techeuns. The mustiness made Ylaia crave the open air of the Dreaming City's skyward turrets.\n\nShe imagined them piercing the sky like masts and drawing the clouds into sails. In her mind, the whole city sailed through the Ascendant Ocean, navigating the Ley Lines like currents. Ylaia placed herself there: a voyage, a turret crow's nest in search of distant land, ascendant anchors restraining cloud-sail billows against the wind of her will.\n\nShe tried to introduce that place to this one, to let them meet and exchange atmosphere.\n\n\"Make this real,\" she thought… but it was nothing more than thought. The concepts were familiar, but the execution was still foreign. Ylaia adjusted the crystal in her hands, as if the orientation mattered. Of all her sisters, only she still couldn't shape the Ley Lines.\n\n\"They're going to shift soon, you know,\" Austyn chided.\n\n\"I know,\" Ylaia spat back without looking. An explosion shook the room, raining plumes of dust over them and breaking her concentration.\n\n\"Damn it!\" Ylaia slammed a fist into the smooth stone and cast the crystal orb across the floor. \"Why are we training in a war zone?\"\n\nAustyn watched the crystal skip to the edge of the chamber. \"This place is built upon a crossroads of Ley Lines. If you can't align with them here…\"\n\n\"Don't say it,\" Ylaia hissed as she stood to retrieve the crystal. \"I need to try again.\"\n\nAs she walked, the wall before her illuminated and split into a doorway. Petra Venj entered the chamber, haggard, soot dulling the sheen of her armor. Ylaia stopped in her tracks. She hid away her embarrassment despite knowing that Petra hadn't seen her cast away the focusing crystal.\n\nPetra's foot tapped the crystal. She bent and scooped it from the ground and looked to Ylaia's empty hands. \"Do not lose this. There aren't many left.\"\n\n\"My apologies. I… I need to try again.\"\n\nPetra scanned the faces of each of the thirteen would-be Techeuns before her. The creases beneath their eyes drew deeper from stress and lack of sleep. \"I had trouble just the same. Let me show you.\"",
                "itemHash": "743529557",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/075320bdf06a414fdf2e2f1a5b7fd04f.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    53,
                    13,
                    6,
                    7,
                    2,
                    18,
                    7
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Pathfinder's Robe",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "Forged from the reinforced armor of fallen Corsairs to honor memories that they no longer can.",
                "ExtLore": "DURESS - III\n\nSjari shifted on the wooden operating table. Why must she be the first?\n\nShe probed the jelly-like substance smeared across her forehead as Elder Kalli entered the room.\n\n\"Don't touch that. It's an antiseptic… and a binding agent,\" Kalli said, placing a sizeable blue-crystal-adorned mask next to an assortment of scalpels, hooks, and erosion stencils on her back table. Each tool was etched with ceremonial iconography, and freshly sharpened.\n\n\"Normally, it takes years to become an Adept among our ranks… but the Queen's Wrath believes time is short. If you survive, these augments will expedite your training and enhance your abilities.\"\n\nKalli turned away to work a mortar and pestle. \"You will need to learn to focus under duress. Remove your mind from this place. Sink into the cosmic, project out from yourself. There is no pain, no flesh, no nerves.\"\n\nSjari gripped the sides of the operating table and pressed her back flat, until no air existed between her and the surface beneath—until she felt herself a part of it. She told herself to ignore the grinding of the pestle and thought about how Petra had taught her to use the physical as a transitionary conduit to the Ascendant.\n\n\"Drink this,\" Kalli ordered, handing Sjari a small cup of queensfoil tea.\n\nSjari opened her eyes and released her grip as her meditation broke. \"Yes, Elder sister. Give me a moment to focus, please,\" she pleaded, hastily gulping down the tea.\n\n\"You think my voice is sharper than this knife?\" Kalli asked, lifting the scalpel from her back table. \"Duress. You must push through it if you are to survive. Be strong, or you will die. This is your final test.\"\n\nSjari drank quickly and pressed herself to the table once more. She focused on her fingertips and the feel of the hand-worked wood. The grain formed diminutive pathways for her nails to trace; tiny patterns hidden away within the enormity that surrounded them, only revealed by shrinking one's perspective. She let herself drift.\n\nKalli threaded the thin metal edge directly through to the bone of Sjari's skull. A line of incision opened a wave of red. Searing penetration through the layers. Overwhelming electrified senses. They gave way to a calming sting in the discordant firing of nerves. A pattern. The texture. The split between what was and what could be.\n\nIn her mind's eye, Sjari saw the Ley Lines unfurl like budding petals of a living blossom. Nebula-like plumes of pollen. She let herself slip away until the pain of her flesh was only one of many choices before her.",
                "itemHash": "2259629899",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/8c41a1dea7fc0cad12c872c1bae820ef.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    52,
                    13,
                    9,
                    6,
                    6,
                    12,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Pathfinder's Pants",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "Step without ground. Leap without falling. Fly without wind.",
                "ExtLore": "JOURNEY - IV\n\nAustyn sat in silence with eyes shut. Ley Lines swept over her in waves—in pulses, which she slowly brought into alignment with her own. Entanglement. It was not the first time she had pressed herself into symbiosis with the Ascendant Plane. She'd been through the thoughts of all the sisters in her Coven. She had dreamt with Petra and harvested secrets from her, with the Queen's Wrath being none the wiser. Austyn knew they were meant to save Queen Mara Sov. They were meant to find her and restore the throne. She had been searching the Ley Lines for a path to the queen each night after her training.\n\nHer Coven sisters lay sleeping all around her body, but her mind flew through countless panes of prismatic glass. As they shattered, she flittered from one plane to the next, catching momentary glimpses of incommunicable wonder.\n\nIn the distant cosmos far ahead, Austyn saw a darkened haze of indecipherable noise. Somewhere nestled in the Ley Lines, this shadowed spot was growing. Austyn knew Mara Sov was distant. She knew the queen had obscured herself from her enemies. Austyn had felt a presence reach from the noise toward the Dreaming City more than once. Tonight, she would reach back.\n\nAustyn focused her will on a path to the distant noise and, as she did so, it was. The way was open, but still so far. She reached out with her physical body, placing a hand in the air before her and splitting the oxygen with her touch. She carved a slit in reality, through the molecules of the air, and the path anchored to it at her command.\n\nThe noise descended upon her, and instantly, she was at the precipice.\n\nHand pressed, frozen, paralyzed, and awash in insidious whispers that shredded the doorway into open nothing.\n\nIt tore her consciousness across the cosmos to a grand terrace of onyx swords and emerald flame reigning over a red harbor. Fingers reached like blades from distant hollows. Screaming noise upon noise. A lone figure stood on the terrace aside two empty thrones. Testing. Prodding. Tasting. Breeding war.\n\n\"Austyn!\" A familiar voice pried her back into the waking world. \"Austyn, are you all right?\"\n\nShe woke, soaked in sweat and heat. Petra Venj stood over her, gripping her shoulders.\n\nAustyn struggled to breathe. Her eyes met Petra's.\n\n\"Austyn?\"\n\nThey'd leave you behind if they knew what you just saw, she thought.\n\n\"Just a nightmare,\" Austyn reassured the Queen's Wrath. \"Thank you for waking me.\"",
                "itemHash": "2319651767",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/b04a99a030a35998eb4e651031d5f8d1.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    53,
                    2,
                    2,
                    25,
                    10,
                    2,
                    12
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Pathfinder's Bond",
                "type": "Legendary Warlock Bond",
                "description": "",
                "lore": "A beacon, like a flare, burning a sphere of safety in the night.",
                "ExtLore": "THIRD-STRING WITCHES - V\n\nPetra watched Sedia preside over the thirteen of the new Coven. A mixture of pride and fearful anxiety knotted her stomach, as if the interior of her skin was being tugged into her gut by warm sinew strings. She held the shape of her smile until they had taken their positions within the Blind Well. Austyn, Ylaia, and Sjari formed the core of the party, with the others interlinking in an exterior circle. They situated themselves at key points around a thrumming Wayfinder's Compass that bent the air into wild chromatic slurries. The Well awakened.\n\nThey prepared their minds. Slipped into meditation. Communion in searching. Thirteen voices spoke as one, and then silence as the Well dropped into prisms of glass beneath the novice Coven's feet. Not but a moment ago, they thirteen stood within the Blind Well, hands and minds interlocked. Now they cascaded through a river of possibility, will, and intention.\n\nIt was not long before the connection was made. Queen Mara Sov's voice filled their thoughts, and they drew to it like gravity. The Coven sisters skipped between Ley Lines, ricocheting from time to place until they found themselves swirling in the whirlpool accretion of a brilliant celestine goddess. Their queen.\n\nNot far beyond it, Austyn again saw the noise.\n\nShe kept her eye upon it while each of her sisters reached out, until the image of Mara Sov manifested and her words found footing in understanding. They focused their will upon her words, and before them, a pale screen of fog and glass gave way into a distant Ley Line beyond Sol.\n\n\"You have done well, my Techeuns,\" said Mara, stepping from the nothing and into their presence. She placed her hand on the Wayfinder's Compass. \"Take me home.\"\n\nThe Coven turned their minds back to the Dreaming City, to safety, to Petra. But as they began their return journey through the Ascendant Plane and across the Ley Lines, they felt the presence of another watching. At the edges of the accretion, a din of distorted noise pursued them.\n\nMara glowered at Austyn before turning and raising her palms. With a single word, the Ley Line shattered behind them, sending a lance of energy through the heart of the noise as they sped away toward the Dreaming City. \"I will not suffer a bloodied mongrel at my heels,\" whispered Mara. \"Keep your focus. She will be back.\"\n\nAustyn could feel the noise encircling them again, as it had done to her that night in her bed. It would suffocate them in this dream.\n\nEach time the Coven shifted Ley Lines, so too did the noise. She knew they could not escape it, and through her, so did her sisters. It descended upon them, and as it grew closer, the noise manifested into whispers. Austyn's mind could think of nothing but one name: Xivu Arath.\n\nShe could see the Dreaming City, but the image wasn't clear. The sharpness of the connection was darkening. Her sisters felt her worry. They did not have the strength to escape. Their minds aligned on an action. Austyn grabbed the compass and placed it in Mara Sov's hands. \"We will ensure your arrival.\"\n\nEach sister shifted her thoughts from the Dreaming City to her own corner of the Ascendant Plane, and with a burst of will, they scattered themselves across the Ley Lines. The noise halted momentarily and split in every direction to follow them.\n\nQueen Mara Sov crashed to her feet as she connected with the floor of the Blind Well.\n\n\"My queen!\" Petra looked to the quickly sealing rift from which she fell. \"Where are the others?\"",
                "itemHash": "616346210",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/c28146eb7f5892e74c71756f137ddd7b.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Hunter": {
            "Helmet": {
                "name": "Pathfinder's Helmet",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "Eyes open and keep to the horizon.",
                "ExtLore": "NEW COVEN - I\n\nPetra stood at the bordering cliff's edge of the Divalian Mists, wrapped in a concealing vapor. Beside her, Illyn, Techeun Coven Mother. A deluge of water spewed from deep within the stone below; gentle tremors rippled through their bodies without notice. The pure sky above them tore like well-worn fabric as fronds of malignant Taken growth crept into the Dreaming City.\n\n\"They will be upon us soon. It was not enough to simply halt Oryx's  advance,\" Petra said.\n\nShe had spent months of conversation building the kindling to an idea in Illyn's thoughts prior to the Battle of Saturn: a new Coven, a new class of sister recruits. Now, with the queen's flagship in ruins and the Coven missing several of its most skilled Techeuns, there was no longer the luxury of refusal.\n\n\"I can't hold the Reef with Corsairs alone. I can't search for the queen with looking glasses and a depleted armada. We need more Techeuns, Illyn. You know I'm right.\"\n\nIllyn shook her head. \"We are not weapons for the Queen's Wrath to command…\"\n\nThe Coven's reluctance to forge the next link in the chain of their lineage was a strong one. Since the formation of Eleusinia and the exploitation of Riven, the Elder Techeuns had grown protective of their arts. Techniques and texts were kept close. Despite all that, Petra knew Illyn had always been listening to her words. She too had dreamt of the Harbinger's failure. Of Oryx Taking her sisters.\n\n\"…We will snap shut the Ley Lines and seal the city,\" Illyn concluded.\n\n\"No!\" Petra  retorted. \"The queen is lost and might still return.\" She turned to the Coven Mother. \"Of your seven, how many are still alive?\"\n\nPetra felt a mournful flame stoking beneath Illyn's visor. \"Precisely,\" Illyn said. \"We haven't the strength.\"\n\n\"Then heed my requests.\" Petra waved away the mist between them. \"Train more sisters.\"\n\nIllyn finally broke her gaze with the sky and scowled at Petra. \"We haven't the time. Training spans decades.\"\n\n\"Make. It. Work,\" Petra demanded before taking a breath and continuing. \"Illyn, I will do whatever you need. Please, can we work through this together?\"\n\nIllyn's head sunk. She leaned over the cliffside—over the stream of plummeting mist—and watched the flow of water drop into endlessness. \"Send me your candidates. I hope they are stronger than you were.\"",
                "itemHash": "2957532337",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/d1a188f8de499e97d5d2a4123e28eb6a.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    54,
                    7,
                    13,
                    7,
                    11,
                    2,
                    14
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Pathfinder's Grips",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "Place your fingers on the pulse of this place. Find rhythm, and synchronize.",
                "ExtLore": "WAYFINDING - II\n\nYlaia placed her hands on the focusing crystal once more. It had been months since she had seen the stars. Her view every day was instead of the same stone chamber she shared with twelve others; it doubled as both training ground and lodging for a new crop of Techeuns. The mustiness made Ylaia crave the open air of the Dreaming City's skyward turrets.\n\nShe imagined them piercing the sky like masts and drawing the clouds into sails. In her mind, the whole city sailed through the Ascendant Ocean, navigating the Ley Lines like currents. Ylaia placed herself there: a voyage, a turret crow's nest in search of distant land, ascendant anchors restraining cloud-sail billows against the wind of her will.\n\nShe tried to introduce that place to this one, to let them meet and exchange atmosphere.\n\n\"Make this real,\" she thought… but it was nothing more than thought. The concepts were familiar, but the execution was still foreign. Ylaia adjusted the crystal in her hands, as if the orientation mattered. Of all her sisters, only she still couldn't shape the Ley Lines.\n\n\"They're going to shift soon, you know,\" Austyn chided.\n\n\"I know,\" Ylaia spat back without looking. An explosion shook the room, raining plumes of dust over them and breaking her concentration.\n\n\"Damn it!\" Ylaia slammed a fist into the smooth stone and cast the crystal orb across the floor. \"Why are we training in a war zone?\"\n\nAustyn watched the crystal skip to the edge of the chamber. \"This place is built upon a crossroads of Ley Lines. If you can't align with them here…\"\n\n\"Don't say it,\" Ylaia hissed as she stood to retrieve the crystal. \"I need to try again.\"\n\nAs she walked, the wall before her illuminated and split into a doorway. Petra Venj entered the chamber, haggard, soot dulling the sheen of her armor. Ylaia stopped in her tracks. She hid away her embarrassment despite knowing that Petra hadn't seen her cast away the focusing crystal.\n\nPetra's foot tapped the crystal. She bent and scooped it from the ground and looked to Ylaia's empty hands. \"Do not lose this. There aren't many left.\"\n\n\"My apologies. I… I need to try again.\"\n\nPetra scanned the faces of each of the thirteen would-be Techeuns before her. The creases beneath their eyes drew deeper from stress and lack of sleep. \"I had trouble just the same. Let me show you.\"",
                "itemHash": "1574187016",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/3ed812d3a164a4f5c43cdcd2f1ecdb69.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    53,
                    12,
                    7,
                    7,
                    7,
                    14,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Pathfinder's Tunic",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "Forged from the reinforced armor of fallen Corsairs to shepherd the lost as they no longer can.",
                "ExtLore": "DURESS - III\n\nSjari shifted on the wooden operating table. Why must she be the first?\n\nShe probed the jelly-like substance smeared across her forehead as Elder Kalli entered the room.\n\n\"Don't touch that. It's an antiseptic… and a binding agent,\" Kalli said, placing a sizeable blue-crystal-adorned mask next to an assortment of scalpels, hooks, and erosion stencils on her back table. Each tool was etched with ceremonial iconography, and freshly sharpened.\n\n\"Normally, it takes years to become an Adept among our ranks… but the Queen's Wrath believes time is short. If you survive, these augments will expedite your training and enhance your abilities.\"\n\nKalli turned away to work a mortar and pestle. \"You will need to learn to focus under duress. Remove your mind from this place. Sink into the cosmic, project out from yourself. There is no pain, no flesh, no nerves.\"\n\nSjari gripped the sides of the operating table and pressed her back flat, until no air existed between her and the surface beneath—until she felt herself a part of it. She told herself to ignore the grinding of the pestle and thought about how Petra had taught her to use the physical as a transitionary conduit to the Ascendant.\n\n\"Drink this,\" Kalli ordered, handing Sjari a small cup of queensfoil tea.\n\nSjari opened her eyes and released her grip as her meditation broke. \"Yes, Elder sister. Give me a moment to focus, please,\" she pleaded, hastily gulping down the tea.\n\n\"You think my voice is sharper than this knife?\" Kalli asked, lifting the scalpel from her back table. \"Duress. You must push through it if you are to survive. Be strong, or you will die. This is your final test.\"\n\nSjari drank quickly and pressed herself to the table once more. She focused on her fingertips and the feel of the hand-worked wood. The grain formed diminutive pathways for her nails to trace; tiny patterns hidden away within the enormity that surrounded them, only revealed by shrinking one's perspective. She let herself drift.\n\nKalli threaded the thin metal edge directly through to the bone of Sjari's skull. A line of incision opened a wave of red. Searing penetration through the layers. Overwhelming electrified senses. They gave way to a calming sting in the discordant firing of nerves. A pattern. The texture. The split between what was and what could be.\n\nIn her mind's eye, Sjari saw the Ley Lines unfurl like budding petals of a living blossom. Nebula-like plumes of pollen. She let herself slip away until the pain of her flesh was only one of many choices before her.",
                "itemHash": "1049436160",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/6aa6425574f51be89f4de8523dea6a74.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    52,
                    6,
                    12,
                    9,
                    17,
                    6,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Pathfinder's Legguards",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "Keep moving. Find the others. Stay alive.",
                "ExtLore": "JOURNEY - IV\n\nAustyn sat in silence with eyes shut. Ley Lines swept over her in waves—in pulses, which she slowly brought into alignment with her own. Entanglement. It was not the first time she had pressed herself into symbiosis with the Ascendant Plane. She'd been through the thoughts of all the sisters in her Coven. She had dreamt with Petra and harvested secrets from her, with the Queen's Wrath being none the wiser. Austyn knew they were meant to save Queen Mara Sov. They were meant to find her and restore the throne. She had been searching the Ley Lines for a path to the queen each night after her training.\n\nHer Coven sisters lay sleeping all around her body, but her mind flew through countless panes of prismatic glass. As they shattered, she flittered from one plane to the next, catching momentary glimpses of incommunicable wonder.\n\nIn the distant cosmos far ahead, Austyn saw a darkened haze of indecipherable noise. Somewhere nestled in the Ley Lines, this shadowed spot was growing. Austyn knew Mara Sov was distant. She knew the queen had obscured herself from her enemies. Austyn had felt a presence reach from the noise toward the Dreaming City more than once. Tonight, she would reach back.\n\nAustyn focused her will on a path to the distant noise and, as she did so, it was. The way was open, but still so far. She reached out with her physical body, placing a hand in the air before her and splitting the oxygen with her touch. She carved a slit in reality, through the molecules of the air, and the path anchored to it at her command.\n\nThe noise descended upon her, and instantly, she was at the precipice.\n\nHand pressed, frozen, paralyzed, and awash in insidious whispers that shredded the doorway into open nothing.\n\nIt tore her consciousness across the cosmos to a grand terrace of onyx swords and emerald flame reigning over a red harbor. Fingers reached like blades from distant hollows. Screaming noise upon noise. A lone figure stood on the terrace aside two empty thrones. Testing. Prodding. Tasting. Breeding war.\n\n\"Austyn!\" A familiar voice pried her back into the waking world. \"Austyn, are you all right?\"\n\nShe woke, soaked in sweat and heat. Petra Venj stood over her, gripping her shoulders.\n\nAustyn struggled to breathe. Her eyes met Petra's.\n\n\"Austyn?\"\n\nThey'd leave you behind if they knew what you just saw, she thought.\n\n\"Just a nightmare,\" Austyn reassured the Queen's Wrath. \"Thank you for waking me.\"",
                "itemHash": "2675526370",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/9dac93ee2d6ed5ec519bc5d1ce41e9ae.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    50,
                    8,
                    6,
                    12,
                    8,
                    10,
                    6
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Pathfinder's Hood",
                "type": "Legendary Hunter Cloak",
                "description": "",
                "lore": "A faithful companion to cover your flank.",
                "ExtLore": "THIRD-STRING WITCHES - V\n\nPetra watched Sedia preside over the thirteen of the new Coven. A mixture of pride and fearful anxiety knotted her stomach, as if the interior of her skin was being tugged into her gut by warm sinew strings. She held the shape of her smile until they had taken their positions within the Blind Well. Austyn, Ylaia, and Sjari formed the core of the party, with the others interlinking in an exterior circle. They situated themselves at key points around a thrumming Wayfinder's Compass that bent the air into wild chromatic slurries. The Well awakened.\n\nThey prepared their minds. Slipped into meditation. Communion in searching. Thirteen voices spoke as one, and then silence as the Well dropped into prisms of glass beneath the novice Coven's feet. Not but a moment ago, they thirteen stood within the Blind Well, hands and minds interlocked. Now they cascaded through a river of possibility, will, and intention.\n\nIt was not long before the connection was made. Queen Mara Sov's voice filled their thoughts, and they drew to it like gravity. The Coven sisters skipped between Ley Lines, ricocheting from time to place until they found themselves swirling in the whirlpool accretion of a brilliant celestine goddess. Their queen.\n\nNot far beyond it, Austyn again saw the noise.\n\nShe kept her eye upon it while each of her sisters reached out, until the image of Mara Sov manifested and her words found footing in understanding. They focused their will upon her words, and before them, a pale screen of fog and glass gave way into a distant Ley Line beyond Sol.\n\n\"You have done well, my Techeuns,\" said Mara, stepping from the nothing and into their presence. She placed her hand on the Wayfinder's Compass. \"Take me home.\"\n\nThe Coven turned their minds back to the Dreaming City, to safety, to Petra. But as they began their return journey through the Ascendant Plane and across the Ley Lines, they felt the presence of another watching. At the edges of the accretion, a din of distorted noise pursued them.\n\nMara glowered at Austyn before turning and raising her palms. With a single word, the Ley Line shattered behind them, sending a lance of energy through the heart of the noise as they sped away toward the Dreaming City. \"I will not suffer a bloodied mongrel at my heels,\" whispered Mara. \"Keep your focus. She will be back.\"\n\nAustyn could feel the noise encircling them again, as it had done to her that night in her bed. It would suffocate them in this dream.\n\nEach time the Coven shifted Ley Lines, so too did the noise. She knew they could not escape it, and through her, so did her sisters. It descended upon them, and as it grew closer, the noise manifested into whispers. Austyn's mind could think of nothing but one name: Xivu Arath.\n\nShe could see the Dreaming City, but the image wasn't clear. The sharpness of the connection was darkening. Her sisters felt her worry. They did not have the strength to escape. Their minds aligned on an action. Austyn grabbed the compass and placed it in Mara Sov's hands. \"We will ensure your arrival.\"\n\nEach sister shifted her thoughts from the Dreaming City to her own corner of the Ascendant Plane, and with a burst of will, they scattered themselves across the Ley Lines. The noise halted momentarily and split in every direction to follow them.\n\nQueen Mara Sov crashed to her feet as she connected with the floor of the Blind Well.\n\n\"My queen!\" Petra looked to the quickly sealing rift from which she fell. \"Where are the others?\"",
                "itemHash": "401152189",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/5a71fdee959ac02216bbb002b6a0535c.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Titan": {
            "Helmet": {
                "name": "Pathfinder's Helm",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "If the sky is falling, shelter those beneath you.",
                "ExtLore": "NEW COVEN - I\n\nPetra stood at the bordering cliff's edge of the Divalian Mists, wrapped in a concealing vapor. Beside her, Illyn, Techeun Coven Mother. A deluge of water spewed from deep within the stone below; gentle tremors rippled through their bodies without notice. The pure sky above them tore like well-worn fabric as fronds of malignant Taken growth crept into the Dreaming City.\n\n\"They will be upon us soon. It was not enough to simply halt Oryx's  advance,\" Petra said.\n\nShe had spent months of conversation building the kindling to an idea in Illyn's thoughts prior to the Battle of Saturn: a new Coven, a new class of sister recruits. Now, with the queen's flagship in ruins and the Coven missing several of its most skilled Techeuns, there was no longer the luxury of refusal.\n\n\"I can't hold the Reef with Corsairs alone. I can't search for the queen with looking glasses and a depleted armada. We need more Techeuns, Illyn. You know I'm right.\"\n\nIllyn shook her head. \"We are not weapons for the Queen's Wrath to command…\"\n\nThe Coven's reluctance to forge the next link in the chain of their lineage was a strong one. Since the formation of Eleusinia and the exploitation of Riven, the Elder Techeuns had grown protective of their arts. Techniques and texts were kept close. Despite all that, Petra knew Illyn had always been listening to her words. She too had dreamt of the Harbinger's failure. Of Oryx Taking her sisters.\n\n\"…We will snap shut the Ley Lines and seal the city,\" Illyn concluded.\n\n\"No!\" Petra retorted. \"The queen is lost and might still return.\" She turned to the Coven Mother. \"Of your seven, how many are still alive?\"\n\nPetra felt a mournful flame stoking beneath Illyn's visor. \"Precisely,\" Illyn said. \"We haven't the strength.\"\n\n\"Then heed my requests.\" Petra waved away the mist between them. \"Train more sisters.\"\n\nIllyn finally broke her gaze with the sky and scowled at Petra. \"We haven't the time. Training spans decades.\"\n\n\"Make. It. Work,\" Petra demanded before taking a breath and continuing. \"Illyn, I will do whatever you need. Please, can we work through this together?\"\n\nIllyn's head sunk. She leaned over the cliffside—over the stream of plummeting mist—and watched the flow of water drop into endlessness. \"Send me your candidates. I hope they are stronger than you were.\"",
                "itemHash": "430504837",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/a2036b7e7d2e0f03a572f9370b4671e0.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    56,
                    8,
                    6,
                    16,
                    10,
                    14,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Pathfinder's Gauntlets",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "Place yourself at the gate. Pry it open, and hold it for those who follow.",
                "ExtLore": "WAYFINDING - II\n\nYlaia placed her hands on the focusing crystal once more. It had been months since she had seen the stars. Her view every day was instead of the same stone chamber she shared with twelve others; it doubled as both training ground and lodging for a new crop of Techeuns. The mustiness made Ylaia crave the open air of the Dreaming City's skyward turrets.\n\nShe imagined them piercing the sky like masts and drawing the clouds into sails. In her mind, the whole city sailed through the Ascendant Ocean, navigating the Ley Lines like currents. Ylaia placed herself there: a voyage, a turret crow's nest in search of distant land, ascendant anchors restraining cloud-sail billows against the wind of her will.\n\nShe tried to introduce that place to this one, to let them meet and exchange atmosphere.\n\n\"Make this real,\" she thought… but it was nothing more than thought. The concepts were familiar, but the execution was still foreign. Ylaia adjusted the crystal in her hands, as if the orientation mattered. Of all her sisters, only she still couldn't shape the Ley Lines.\n\n\"They're going to shift soon, you know,\" Austyn chided.\n\n\"I know,\" Ylaia spat back without looking. An explosion shook the room, raining plumes of dust over them and breaking her concentration.\n\n\"Damn it!\" Ylaia slammed a fist into the smooth stone and cast the crystal orb across the floor. \"Why are we training in a war zone?\"\n\nAustyn watched the crystal skip to the edge of the chamber. \"This place is built upon a crossroads of Ley Lines. If you can't align with them here…\"\n\n\"Don't say it,\" Ylaia hissed as she stood to retrieve the crystal. \"I need to try again.\"\n\nAs she walked, the wall before her illuminated and split into a doorway. Petra Venj entered the chamber, haggard, soot dulling the sheen of her armor. Ylaia stopped in her tracks. She hid away her embarrassment despite knowing that Petra hadn't seen her cast away the focusing crystal.\n\nPetra's foot tapped the crystal. She bent and scooped it from the ground and looked to Ylaia's empty hands. \"Do not lose this. There aren't many left.\"\n\n\"My apologies. I… I need to try again.\"\n\nPetra scanned the faces of each of the thirteen would-be Techeuns before her. The creases beneath their eyes drew deeper from stress and lack of sleep. \"I had trouble just the same. Let me show you.\"",
                "itemHash": "1211181652",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/4a74cf23d0d26b359ed39310e97cbabe.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    58,
                    22,
                    2,
                    6,
                    12,
                    2,
                    14
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Pathfinder's Chestplate",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "Forged from the reinforced armor of fallen Corsairs to carry the burden that they no longer can.",
                "ExtLore": "DURESS - III\n\nSjari shifted on the wooden operating table. Why must she be the first?\n\nShe probed the jelly-like substance smeared across her forehead as Elder Kalli entered the room.\n\n\"Don't touch that. It's an antiseptic… and a binding agent,\" Kalli said, placing a sizeable blue-crystal-adorned mask next to an assortment of scalpels, hooks, and erosion stencils on her back table. Each tool was etched with ceremonial iconography, and freshly sharpened.\n\n\"Normally, it takes years to become an Adept among our ranks… but the Queen's Wrath believes time is short. If you survive, these augments will expedite your training and enhance your abilities.\"\n\nKalli turned away to work a mortar and pestle. \"You will need to learn to focus under duress. Remove your mind from this place. Sink into the cosmic, project out from yourself. There is no pain, no flesh, no nerves.\"\n\nSjari gripped the sides of the operating table and pressed her back flat, until no air existed between her and the surface beneath—until she felt herself a part of it. She told herself to ignore the grinding of the pestle and thought about how Petra had taught her to use the physical as a transitionary conduit to the Ascendant.\n\n\"Drink this,\" Kalli ordered, handing Sjari a small cup of queensfoil tea.\n\nSjari opened her eyes and released her grip as her meditation broke. \"Yes, Elder sister. Give me a moment to focus, please,\" she pleaded, hastily gulping down the tea.\n\n\"You think my voice is sharper than this knife?\" Kalli asked, lifting the scalpel from her back table. \"Duress. You must push through it if you are to survive. Be strong, or you will die. This is your final test.\"\n\nSjari drank quickly and pressed herself to the table once more. She focused on her fingertips and the feel of the hand-worked wood. The grain formed diminutive pathways for her nails to trace; tiny patterns hidden away within the enormity that surrounded them, only revealed by shrinking one's perspective. She let herself drift.\n\nKalli threaded the thin metal edge directly through to the bone of Sjari's skull. A line of incision opened a wave of red. Searing penetration through the layers. Overwhelming electrified senses. They gave way to a calming sting in the discordant firing of nerves. A pattern. The texture. The split between what was and what could be.\n\nIn her mind's eye, Sjari saw the Ley Lines unfurl like budding petals of a living blossom. Nebula-like plumes of pollen. She let herself slip away until the pain of her flesh was only one of many choices before her.",
                "itemHash": "2606405484",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/1413bc59b86040c00a67c3ff8ff411e4.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    56,
                    6,
                    20,
                    2,
                    2,
                    2,
                    24
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Pathfinder's Greaves",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "When your muscles burn and the path stretches on, turn your thoughts to how far you've come.",
                "ExtLore": "JOURNEY - IV\n\nAustyn sat in silence with eyes shut. Ley Lines swept over her in waves—in pulses, which she slowly brought into alignment with her own. Entanglement. It was not the first time she had pressed herself into symbiosis with the Ascendant Plane. She'd been through the thoughts of all the sisters in her Coven. She had dreamt with Petra and harvested secrets from her, with the Queen's Wrath being none the wiser. Austyn knew they were meant to save Queen Mara Sov. They were meant to find her and restore the throne. She had been searching the Ley Lines for a path to the queen each night after her training.\n\nHer Coven sisters lay sleeping all around her body, but her mind flew through countless panes of prismatic glass. As they shattered, she flittered from one plane to the next, catching momentary glimpses of incommunicable wonder.\n\nIn the distant cosmos far ahead, Austyn saw a darkened haze of indecipherable noise. Somewhere nestled in the Ley Lines, this shadowed spot was growing. Austyn knew Mara Sov was distant. She knew the queen had obscured herself from her enemies. Austyn had felt a presence reach from the noise toward the Dreaming City more than once. Tonight, she would reach back.\n\nAustyn focused her will on a path to the distant noise and, as she did so, it was. The way was open, but still so far. She reached out with her physical body, placing a hand in the air before her and splitting the oxygen with her touch. She carved a slit in reality, through the molecules of the air, and the path anchored to it at her command.\n\nThe noise descended upon her, and instantly, she was at the precipice.\n\nHand pressed, frozen, paralyzed, and awash in insidious whispers that shredded the doorway into open nothing.\n\nIt tore her consciousness across the cosmos to a grand terrace of onyx swords and emerald flame reigning over a red harbor. Fingers reached like blades from distant hollows. Screaming noise upon noise. A lone figure stood on the terrace aside two empty thrones. Testing. Prodding. Tasting. Breeding war.\n\n\"Austyn!\" A familiar voice pried her back into the waking world. \"Austyn, are you all right?\"\n\nShe woke, soaked in sweat and heat. Petra Venj stood over her, gripping her shoulders.\n\nAustyn struggled to breathe. Her eyes met Petra's.\n\n\"Austyn?\"\n\nThey'd leave you behind if they knew what you just saw, she thought.\n\n\"Just a nightmare,\" Austyn reassured the Queen's Wrath. \"Thank you for waking me.\"",
                "itemHash": "1457343582",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/1b2397b633362742d67699141f9e52bb.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    50,
                    6,
                    7,
                    12,
                    6,
                    7,
                    12
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Pathfinder's Mark",
                "type": "Legendary Titan Mark",
                "description": "",
                "lore": "A sigil of solidarity between two cities.",
                "ExtLore": "THIRD-STRING WITCHES - V\n\nPetra watched Sedia preside over the thirteen of the new Coven. A mixture of pride and fearful anxiety knotted her stomach, as if the interior of her skin was being tugged into her gut by warm sinew strings. She held the shape of her smile until they had taken their positions within the Blind Well. Austyn, Ylaia, and Sjari formed the core of the party, with the others interlinking in an exterior circle. They situated themselves at key points around a thrumming Wayfinder's Compass that bent the air into wild chromatic slurries. The Well awakened.\n\nThey prepared their minds. Slipped into meditation. Communion in searching. Thirteen voices spoke as one, and then silence as the Well dropped into prisms of glass beneath the novice Coven's feet. Not but a moment ago, they thirteen stood within the Blind Well, hands and minds interlocked. Now they cascaded through a river of possibility, will, and intention.\n\nIt was not long before the connection was made. Queen Mara Sov's voice filled their thoughts, and they drew to it like gravity. The Coven sisters skipped between Ley Lines, ricocheting from time to place until they found themselves swirling in the whirlpool accretion of a brilliant celestine goddess. Their queen.\n\nNot far beyond it, Austyn again saw the noise.\n\nShe kept her eye upon it while each of her sisters reached out, until the image of Mara Sov manifested and her words found footing in understanding. They focused their will upon her words, and before them, a pale screen of fog and glass gave way into a distant Ley Line beyond Sol.\n\n\"You have done well, my Techeuns,\" said Mara, stepping from the nothing and into their presence. She placed her hand on the Wayfinder's Compass. \"Take me home.\"\n\nThe Coven turned their minds back to the Dreaming City, to safety, to Petra. But as they began their return journey through the Ascendant Plane and across the Ley Lines, they felt the presence of another watching. At the edges of the accretion, a din of distorted noise pursued them.\n\nMara glowered at Austyn before turning and raising her palms. With a single word, the Ley Line shattered behind them, sending a lance of energy through the heart of the noise as they sped away toward the Dreaming City. \"I will not suffer a bloodied mongrel at my heels,\" whispered Mara. \"Keep your focus. She will be back.\"\n\nAustyn could feel the noise encircling them again, as it had done to her that night in her bed. It would suffocate them in this dream.\n\nEach time the Coven shifted Ley Lines, so too did the noise. She knew they could not escape it, and through her, so did her sisters. It descended upon them, and as it grew closer, the noise manifested into whispers. Austyn's mind could think of nothing but one name: Xivu Arath.\n\nShe could see the Dreaming City, but the image wasn't clear. The sharpness of the connection was darkening. Her sisters felt her worry. They did not have the strength to escape. Their minds aligned on an action. Austyn grabbed the compass and placed it in Mara Sov's hands. \"We will ensure your arrival.\"\n\nEach sister shifted her thoughts from the Dreaming City to her own corner of the Ascendant Plane, and with a burst of will, they scattered themselves across the Ley Lines. The noise halted momentarily and split in every direction to follow them.\n\nQueen Mara Sov crashed to her feet as she connected with the floor of the Blind Well.\n\n\"My queen!\" Petra looked to the quickly sealing rift from which she fell. \"Where are the others?\"",
                "itemHash": "1010196641",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/5d45f3753c155ee218ae6c5ffd87532b.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        }
    }
}