{
    "Location": "European Dead Zone",
    "Planet": "Earth",
    "Landing Zone": "Winding Cove",
    "Week": "September 15, 2023",
    "Exotics": {
        "Exotic Engram": {
            "name": "Exotic Engram",
            "type": "Exotic Engram",
            "description": "An engram with a predestined outcome.\n\nContains a new Exotic if any of the possible rewards remain to be collected. Preview contents for possible rewards.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "3875551374",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/ee21b5bc72f9e48366c9addff163a187.png",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Quest": {
            "name": "Xenology",
            "type": "Exotic Quest Step",
            "description": "Complete Vanguard playlist activities, or win matches in Crucible or Gambit.\n\nExtra progress is awarded for more challenging activities and for succeeding with clanmates.",
            "lore": "",
            "ExtLore": null,
            "itemHash": "2125848607",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/7f9e6e79bb7a8ce59de9258a7d674af2.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Exotic Weapon": {
            "name": "Trinity Ghoul",
            "type": "Exotic Combat Bow",
            "description": "",
            "lore": "\"I couldn't afford to miss. Not when it was his life on the line.\" —Marin Mansanas, Tangled Outrider",
            "ExtLore": "\"Marin Mansanas…\" the Rifleman's voice hissed over her comm. \"I did not think you would show.\" \n\nMarin spat onto the dusty ground, scuffed it with the heel of her boot. Squinted across the flat, dusty expanse of the High Plains. Ignored the Rifleman to address the other person on the channel, ex-Corsair Errol Mayz, who stood alone just over seven hundred meters from her position with his hands bound behind his back and a canister of ether balanced on his head. \n\n\"Errol, you son of a tech witch.\" \n\nShe could see his shoulders shift in an attempt at a casual shrug. His gruff voice tickled her ear through the comm. \"Sorry, Rin.\"\n\n\"You know the wager.\" The Rifleman didn't like to be ignored. \"Get on with it. If you think you can make the shot.\"\n\nMarin's eyes flicked to the hills of rubble dotting the High Plains, looking for the Rifleman's perch. Almost a sure thing the four-armed lunk on the far ridge was just another of the braggart's decoys, but no point risking Errol's life over a guess. \"I can make the shot. And I expect you to honor this wager when you're down a K of ether and I'm walking outta here with Mayz.\" \n\nRough alien laughter was the only reply. \n\nShe pulled three arrows out of her quiver and whispered, \"Pom, whatever happens, don't come out.\" Her Ghost answered her with a pulse of warmth in her left hand. \n\nTwo arrows she tucked into her belt. The third she nocked to her old friend, Trinity Ghoul. \n\nErrol's voice returned, so low she could almost feel hot breath on her ear. \n\n\"Hey, Rin.\" \n\n\"Don't talk. Don't breathe.\" \n\n\"Just don't miss. Okay?\" \n\n\"Good idea.\" \n\n\"You know what I mean.\" \n\nMarin pulled the Ghoul taut, lined up her shot with the canister perched atop Errol's scruffy blue head. \n\n\"Yeah,\" she said. \"I know.\"",
            "itemHash": "814876685",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/ab33a7c7024299b28d8c6410d63e5bb5.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Split Electron",
                    "description": "Fires an arrow that splits when released. Aiming down sights and fully drawing the bow both decrease the spread.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/e3d693fc9f3f8e88a70731e3a603c59f.png",
                    "hashID": 1573888036,
                    "weaponHash": 814876685,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "High Tension String",
                    "description": "Tightly strung bow.\n  •  Greatly increases accuracy\n  •  Slightly slower draw time\n  •  Slightly decreases stability",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/347e9dbe7a237097160dcf797bcac19a.png",
                    "hashID": 3371775011,
                    "weaponHash": 814876685,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Compact Arrow Shaft",
                    "description": "Thinner arrows to increase nocking speed and weapon handling.\n  •  Increases handling speed \n  •  Increases reload speed",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/92192e1f865a985b853ca28f5321c1ba.png",
                    "hashID": 16392701,
                    "weaponHash": 814876685,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Lightning Rod",
                    "description": "Precision kills grant the next shot chain-lightning capabilities.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/e85736b898adb2aaf2f97cf585578d8d.png",
                    "hashID": 200829441,
                    "weaponHash": 814876685,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Energy",
            "legendWeaponDamageElement": "Arc",
            "masterworkData": null
        },
        "Hawkmoon": {
            "name": "Hawkmoon",
            "type": "Exotic Hand Cannon",
            "description": "",
            "lore": "Stalk thy prey and let loose thy talons upon the Darkness.",
            "ExtLore": "What is this feeling?\n\nI did not ask for it. I do not understand it. I do not want it.\n\nThe Crow is so carefree in his ignorance. The bonfire's glow lights up his pale features and I am drawn to the hope in his gold eyes. Where is the despairing child I anticipated?\n\nHe drinks from an open bottle of wine against the recommendation of his Ghost. The Guardian encourages him and they are laughing. This celebration is maddening; neither have reason to be so jubilant. Their world is ending and they thrash like dying creatures in the final light of collapsing stars. They do not seem to acknowledge the futility of their existence, the impermanence of it in the face of cosmic annihilation.\n\nNow the Guardian is drinking, standing close to the fire. Their Ghost, too, encourages them not to partake. They poison themselves for the enjoyment of it.\n\nI am reminded of my sisters. Of moments spent by lapping shores, gazing up at infinite stars full of possibilities and wonder. I am left yearning.\n\nWhat is this feeling?\n\nI do not understand it. I do not want it.\n\nThey are celebrating their victory over the Taken. The Crow is making a gun shape with his hand, swinging the nearly empty bottle of wine around in the other like a Sword. The Guardian looks pensive, sitting on a rock by the fire, contemplating the secret they are keeping. The Crow notices, but tries not to show it. He wants the Guardian's spirits to be lifted. He wants to be supportive, so that they may share in their triumphs together.\n\nAs equals.\n\nI am reminded of my home. I am reminded of the warmth of the sun and the embrace of my family. I am reminded of my father's face. I am reminded of everyone I betrayed. All the blood spilled in the name of immortality. The warmth of the sun burns me with its memory.\n\nWhat is this feeling?\n\nI do not want it.\n\nThe fire has nearly died. The Crow fell over and cannot stand, though he insists he is fine. The Guardian is turning the embers with the tip of their Sword. The Ghosts are talking to one another in quiet conspiracy. The celebration has ended, but I can sense their emotions are mixed: complex and myriad things, when a simple, singular focus would suffice.\n\nThere is a growing kinship here. Against better judgment.\n\nWhat is this feeling?",
            "itemHash": "3856705927",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/cef1290d58a2d94d1437e1e569fa7996.jpg",
            "rarity": "Exotic",
            "class": 3,
            "statRolls": [],
            "weaponPerks": [
                {
                    "name": "Paracausal Shot",
                    "description": "Final blows and precision hits with Hawkmoon grant stacks of Paracausal Charge. The final round in the magazine deals bonus damage based on the number of stacks. Stowing Hawkmoon on the final round removes this bonus.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/243f5529bbd845871803181958599473.png",
                    "hashID": 213689231,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Fluted Barrel",
                    "description": "Ultra-light barrel. \n  •  Greatly increases handling speed\n  •  Slightly increases stability",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/260eba9dd149dbb94b1306c9ed4dd8db.png",
                    "hashID": 1840239774,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Alloy Magazine",
                    "description": "Faster reloads when the magazine is empty.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/069170916c98748b7b3e33b80bd7d689.png",
                    "hashID": 1431678320,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Snapshot Sights",
                    "description": "Faster time to aim down sights.",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/ce16c9e2cbd73bb548af3e15bdfc7177.png",
                    "hashID": 957782887,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                },
                {
                    "name": "Textured Grip",
                    "description": "The friction on this weapon's grip is particularly strong.\n  •  Greatly increases handling speed\n  •  Slightly decreases stability",
                    "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/f1a31e1710aac5b4fb1715d174093199.png",
                    "hashID": 3917450714,
                    "weaponHash": 3856705927,
                    "isPerk": true,
                    "isFavorablePerk": false
                }
            ],
            "exoticArmorPerk": null,
            "legendWeaponFrame": null,
            "legendWeaponDamageType": "Kinetic",
            "legendWeaponDamageElement": "Kinetic",
            "masterworkData": null
        },
        "Warlock Exotic": {
            "name": "Ophidian Aspect",
            "type": "Exotic Gauntlets",
            "description": "",
            "lore": "\"Have I the aspic in my lips?\"",
            "ExtLore": "A torn and crumpled journal page, found on the street in the City:\n\n—not his lessons I remember so much as the words we exchanged in passing. I recall a trivial argument we had over some tale from the Golden Age. It might have been a love story, or a tragedy.\n\nA proud queen, forsaken by a lover obsessed with his past heroism, chooses to preserve her dignity in death rather than endure humiliation.\n\nHe brought it up as an example of why we should not fear death, but even as he spoke, I thought to myself: what about those who looked to her to rule? Those whose lives depended on her own?\n\nNow, looking back, it strikes me that he talked with the arrogance of one who can always return from the Void. One who has contemplated the darkness so long he thinks of it as a friend, of sorts.",
            "itemHash": "3627185503",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/a3e9b60f50480547349cf245f30b28f5.jpg",
            "rarity": "Exotic",
            "class": 2,
            "statRolls": [
                66,
                3,
                18,
                13,
                10,
                2,
                20
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Cobra Totemic",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/3945ff76d8e7ec70991cb0f6601c6797.png",
                    "desc": "Weapons ready and reload very quickly. Provides a small benefit to the airborne effectiveness stat of all weapons."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Hunter Exotic": {
            "name": "Young Ahamkara's Spine",
            "type": "Exotic Gauntlets",
            "description": "",
            "lore": "Give me your arm, oh bearer mine. Let me help you fill the world with teeth.",
            "ExtLore": "Bones! Let's wear some bones! \n\nOh, it's a taste many Guardians develop. I think because they feel a wee bit spectral. All this transmatting leaves one saying \"Am I still here? Am I flesh or am I mist?\" So, you strap some old bones to your arm, bones that've been unbreakable for an eon, and you feel solid again. More yourself. \n\nBearers of a particular species of bone do claim—and mind that I'm not recommending these bones—that the fossils grant them unusual powers. Nothing too wild. A little more of this and that. \n\nMy own research suggests these special bones come from a species of draconic post-Traveler neolife called 'ahamkara'. They apparently talked—loved the phrase 'o seeker mine'—and troubled us enough to be hunted to extinction. If you wanted some more of these bones for your friends, I might know a source…",
            "itemHash": "475652357",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/e8ebba4e0fbbaf71de4bd188f072fe67.jpg",
            "rarity": "Exotic",
            "class": 1,
            "statRolls": [
                61,
                10,
                19,
                3,
                14,
                9,
                6
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Wish-Dragon Teeth",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/28aa0f30e0e57d914bf5f12345c631f0.png",
                    "desc": "Increases Tripmine Grenade duration and blast radius. Ability damage grants Tripmine Grenade energy."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        },
        "Titan Exotic": {
            "name": "Crest of Alpha Lupi",
            "type": "Exotic Chest Armor",
            "description": "",
            "lore": "Whoever survives our passing does so only by our consent.",
            "ExtLore": "Near-gods must believe in greater gods. But every power is finite, every life shorter than it wishes. \n\nOnly an astonishing mind can truly appreciate just how tiny it is when set against the known universe; and how insignificant the known becomes when it is devoured by what isn't seen and can't be comprehended. \n\nAs darkness begins to claim their ragged souls, you look ahead to find a great power pouring out of you—a face of fire and golden light. \n\nThat blazing wonder, a gift from the great-eyed god, is their salvation. Or are you? \nPerhaps you are the greater god now.",
            "itemHash": "1591207519",
            "itemRating": null,
            "icon": "https://www.bungie.net/common/destiny2_content/icons/9ddd5eb2eee64925a01abdc4cd9830ad.jpg",
            "rarity": "Exotic",
            "class": 0,
            "statRolls": [
                69,
                7,
                17,
                11,
                2,
                2,
                30
            ],
            "weaponPerks": [],
            "exoticArmorPerk": [
                {
                    "name": "Survival Well",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/a5c5979f3630735a03bee7f2d32e9043.png",
                    "desc": "Generates an additional Orb of Power from Supers and a healing pulse when Barricade is activated."
                }
            ],
            "legendWeaponFrame": null,
            "legendWeaponDamageType": null,
            "legendWeaponDamageElement": null,
            "masterworkData": null
        }
    },
    "Legendaries": {
        "Legendary weapons": [
            {
                "name": "Iota Draconis",
                "type": "Legendary Fusion Rifle",
                "description": "",
                "lore": "\"The paths between stars are fractal mirrors of the neurons in our brains and the vicissitudes of our fates.\" —Sjari, Awoken Techeun",
                "ExtLore": "Sjari's eyes snapped open as the telltale sizzle of a fusion rifle pierced the miasma of the Ascendant Plane.\n\nThe Techeun had been sitting against the same crumbling wall for over two weeks as an unrelenting sludgy river of grey fog flowed past her, the damp air clinging to her skin. The stench of the Taken permeated her nostrils: ozone, gun lubricant, and the sickly sweet burn of soulfire.\n\nThe fusion rifle sounded again, closer this time. The shot was met with garbled hisses and return gunfire as the Taken rallied.\n\nAfter her abandonment, Sjari had tried to move as little as possible so as not to attract the attention of the Taken patrols that periodically swept the area. But the fighting moved closer, now a dozen meters from her hiding place. She quieted her fear and let her mind go lax, encouraging them to overlook her.\n\nShe had staved off the prying minds of the Taken Psions by lowering her heart rate and entering a deep meditative trance, sometimes for many hours at a time. But each time she re-emerged into her body, its demands became harder to ignore. She was desperate for food, for water, for anything.\n\nDespite all her training, she was nearing the end of her resolve. Until she heard a voice—a soft, clear whisper in her ear: \"Have faith, my Techeuns. You are lost, but not forgotten. Help is on the way.\"\n\nIt seemed that Queen Mara's promise would finally come to pass. There was yet hope.",
                "itemHash": "3044460004",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/aa48186de4cf0826ec42e6a2e44d30a3.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Chambered Compensator",
                        "description": "Stable barrel attachment.\n  •  Increases stability\n  •  Moderately controls recoil\n  •  Slightly decreases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0b451cbccc7f11f6aec9c153e59474cb.png",
                        "hashID": 3661387068,
                        "weaponHash": 3044460004,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Enhanced Battery",
                        "description": "Strong battery life.\n  •  Increases magazine size",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0ee59b61e99c52c85c2ea18ab705f700.png",
                        "hashID": 2680121939,
                        "weaponHash": 3044460004,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Ensemble",
                        "description": "Improved handling and reload speed when allies are nearby.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/421d6325598857bc63c1df0f25607cde.png",
                        "hashID": 2621346526,
                        "weaponHash": 3044460004,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Harmony",
                        "description": "Final blows with other weapons improve this weapon's damage and performance for a short duration.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/37f787e53bf9589f03c0e2f7e18b3736.png",
                        "hashID": 438098033,
                        "weaponHash": 3044460004,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "High-Impact Frame",
                    "description": "Slow firing and high damage. This weapon is more accurate when stationary, moving slowly, and aiming down sights.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/34573143849cf910d2381554bb57a10d.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Solar",
                "masterworkData": {
                    "name": "Charge Time",
                    "description": "The time in milliseconds before a weapon fires.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/0ab7e72f178dbec85d531cc7eae34571.jpg",
                    "mwHash": 3353797898
                }
            },
            {
                "name": "Interference VI",
                "type": "Legendary Grenade Launcher",
                "description": "",
                "lore": "Come between your enemies and their lives.",
                "ExtLore": null,
                "itemHash": "2257180473",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/1c4737c405e9739162163522e7a17782.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Confined Launch",
                        "description": "This weapon's launch parameters are particularly stable.\n  •  Greatly increases stability\n  •  Increases blast radius\n  •  Decreases projectile speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0a783b44bf9fc49b4bed0a93dfa21d5d.png",
                        "hashID": 1844523823,
                        "weaponHash": 2257180473,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Spike Grenades",
                        "description": "Grenades fired from this weapon do increased damage on direct hits.\n  •  Increases stability",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/05302d5b12e5f68541622766f18d3797.png",
                        "hashID": 3301904089,
                        "weaponHash": 2257180473,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Grave Robber",
                        "description": "Melee final blows reload this weapon's magazine from reserves.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/043d100167af67d6041719044a033221.png",
                        "hashID": 1631667848,
                        "weaponHash": 2257180473,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Swashbuckler",
                        "description": "This weapon gains increased damage from melee kills and kills with this weapon.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/42631a4aff4432e794529a5a707eba61.png",
                        "hashID": 4082225868,
                        "weaponHash": 2257180473,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Adaptive Frame",
                    "description": "A well-rounded grip, reliable and sturdy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/967fb4abc6ab98f74639d6c08e5f56ee.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Velocity",
                    "description": "Increases the speed of projectiles fired by this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/bbb5b083694aa6b15904ddad69a41ae1.jpg",
                    "mwHash": 4105787909
                }
            },
            {
                "name": "Hoosegow",
                "type": "Legendary Rocket Launcher",
                "description": "",
                "lore": "Cause a stir.",
                "ExtLore": null,
                "itemHash": "3669616453",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/7237fd2c64473782ef3807593aa9bb5e.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Confined Launch",
                        "description": "This weapon's launch parameters are particularly stable.\n  •  Greatly increases stability\n  •  Increases blast radius\n  •  Decreases projectile speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0a783b44bf9fc49b4bed0a93dfa21d5d.png",
                        "hashID": 1844523823,
                        "weaponHash": 3669616453,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "High-Velocity Rounds",
                        "description": "This weapon's projectiles are particularly light and quick.\n  •  Increases projectile speed\n  •  Increases reload speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/2a2b757cd73305126990cd19ad011a2c.png",
                        "hashID": 2822142346,
                        "weaponHash": 3669616453,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Underdog",
                        "description": "This weapon gains a boost to reload speed as your health gets lower.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/b3ed57ea544513afd1fe6dfba2bed4cc.png",
                        "hashID": 205890336,
                        "weaponHash": 3669616453,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Quickdraw",
                        "description": "This weapon can be drawn unbelievably fast.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/6893bb2c7ec7d13cb0d91ec9dd8b6500.png",
                        "hashID": 706527188,
                        "weaponHash": 3669616453,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Adaptive Frame",
                    "description": "A well-rounded grip, reliable and sturdy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/967fb4abc6ab98f74639d6c08e5f56ee.png"
                },
                "legendWeaponDamageType": "Power",
                "legendWeaponDamageElement": "Arc",
                "masterworkData": {
                    "name": "Blast Radius",
                    "description": "Increases the explosion radius of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/cb114512a0710cab990fb8d5b4af91c6.jpg",
                    "mwHash": 3928770367
                }
            },
            {
                "name": "Tears of Contrition",
                "type": "Legendary Scout Rifle",
                "description": "",
                "lore": "Message transmission successful // Message deleted without opening // Resend?",
                "ExtLore": "Mara Sov can feel her twin's heartbeat in the chest of the man now known as Crow. She dreams, sometimes, of gathering him in an embrace like she did when they were children. Of one ear pressed to his sternum, listening…\n\n\"I'm sorry,\" she imagines she would say. \"For everything. I was wrong.\"\n\nBut Mara has been afforded no such opportunity, and on nights like tonight—when she stares across the infinite void of space, alone—she reminds herself that her brother's absence is what he desires. It's also what she deserves.\n\n\"My queen,\" a familiar voice murmurs from behind her. Mara turns to find Petra's figure cutting a harsh silhouette in her doorway. \n\n\"Where is he?\" Mara asks.\n\n\"The Leviathan.\" Shadows obscure Petra's face, making it impossible to read, and for a moment, Mara understands how others must often feel in her own presence. \"Eris tells me he sees himself there. He sees Uldren.\"\n\n\"I know,\" says Mara. Because of course she knows. She feels Crow's suffering as intensely as she feels the beating of his heart.\n\n\"You want to go to him,\" Petra states plainly. \"You shouldn't.\" Something steely has entered her voice; Mara recognizes it as a warning.\n\n\"I know that too.\" Mara turns back to the twinkling ocean of stars but focuses on the vast nothingness beyond it. \"Good night, Petra.\"\n\n\"Good night, my queen.\" Petra's retreating footsteps fade away, and Mara is alone again. \n\nNo, she thinks, not alone. She and her brother are together, even when they are apart. That is enough.\n\nIt must be.",
                "itemHash": "1366394399",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/b5bb55de6a6dacea23cb63626e06580f.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Extended Barrel",
                        "description": "Weighty barrel extension.\n  •  Increases range\n  •  Decreases handling speed\n  •  Moderately controls recoil",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d9e5e8fa07a84c29252b78b0e7b3106d.png",
                        "hashID": 1467527085,
                        "weaponHash": 1366394399,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Accurized Rounds",
                        "description": "This weapon can fire longer distances.\n  •  Increases range",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/d85024478504205359c7fb52dbc4f6b6.png",
                        "hashID": 3142289711,
                        "weaponHash": 1366394399,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Triple Tap",
                        "description": "Rapidly landing precision hits will return one round to the magazine.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0795f44c0c3611b15428742c67918cd1.png",
                        "hashID": 3400784728,
                        "weaponHash": 1366394399,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Explosive Payload",
                        "description": "Projectiles create an area-of-effect detonation on impact.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/31f02e5f3bae68ecdfdd3f899cf931c7.png",
                        "hashID": 3038247973,
                        "weaponHash": 1366394399,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Extrovert",
                        "description": "Final blows while near multiple combatants or near Nightmares restores health.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0e8f9374f41cca37c52fce1695184e18.png",
                        "hashID": 1250481499,
                        "weaponHash": 1366394399,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Precision Frame",
                    "description": "This weapon's recoil pattern is more predictably vertical.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/e9dd736124e8ef94048901a279a5bb18.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Kinetic",
                "masterworkData": {
                    "name": "Handling",
                    "description": "The speed with which the weapon can be readied and aimed.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/d2e1ab2542f585d025fb4cc1a3885164.jpg",
                    "mwHash": 518224747
                }
            },
            {
                "name": "Seventh Seraph SI-2",
                "type": "Legendary Sidearm",
                "description": "",
                "lore": "Kept in holster as the last line. Known for its reliability.",
                "ExtLore": null,
                "itemHash": "3937866388",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/71ad178e3d2087197b59f97a25af8de8.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Corkscrew Rifling",
                        "description": "Balanced barrel. \n  •  Slightly increases range and stability\n  •  Slightly increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7730e1732ed7ef91afce50277639c493.png",
                        "hashID": 4090651448,
                        "weaponHash": 3937866388,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Steady Rounds",
                        "description": "This magazine is optimized for recoil control.\n  •  Greatly increases stability \n  •  Slightly decreases range\n  •  Increases airborne effectiveness",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/6c6e1cc341487a8afd0b0c714a229255.png",
                        "hashID": 3177308360,
                        "weaponHash": 3937866388,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Hip-Fire Grip",
                        "description": "Increases accuracy, stability, and precision hit targeting when firing from the hip.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/e0265e60a4e29a96adf47a35b898fad4.png",
                        "hashID": 1866048759,
                        "weaponHash": 3937866388,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Elemental Capacitor",
                        "description": "Increased stats based on the currently equipped subclass.\n• [Solar] increases your reload speed.\n• [Arc] increases handling.\n• [Void] increases stability.\n• [Stasis] moderately controls recoil and increases movement speed when aiming down sights.\n• [Strand] increases airborne effectiveness.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/e455d94dcafdab7a0d5a850712908020.png",
                        "hashID": 3511092054,
                        "weaponHash": 3937866388,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Lightweight Frame",
                    "description": "Superb handling. Move faster with this weapon equipped.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/6db8cd21c2b3e6fffeb6f111d6c70dd2.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Void",
                "masterworkData": {
                    "name": "Range",
                    "description": "Increases the effective range of this weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/95af3923bdbdf11438504ddeb498afe8.jpg",
                    "mwHash": 150943607
                }
            },
            {
                "name": "Extraordinary Rendition",
                "type": "Legendary Submachine Gun",
                "description": "",
                "lore": "\"My warriors fight not for themselves, or even me, but for each other.\" —Empress Caiatl",
                "ExtLore": "[Report by VanNet encrypted router]\n\nMy friend and first, I know Her Royal Tuskiness is not my assignment, but I couldn't help but catch the following exchange on my latest trip to you-know-where. If anything, it's good for a laugh. Don't let our favorite Praxic wear you down to a nub. If she gives you grief, you give her a swift kick from me. —C.Y.\n\n[Attached transcript.]\n\n\n\nRECORD: 30.10.15.C.Y.Report\nIDENTITIES: Advisor Taurun [A.T.], Empress Caiatl [E.C.], The Spider [T.S.]\nFILE//HID_CLASSIFIED//AUDIO\n\n[A.T.] The connection is made. Let the imperial record show that, on this day, the great Empress Caiatl, ascendant of Calus, slayer of Umun'arath, convened via radio message with the Spider of the Tangled Shore, formerly of the House of—\n\n[E.C.] Enough, Taurun. The scribes can add whatever flourishes they wish after the fact.\n\n[T.S.] Yes, let's not waste time. I know you have more important matters to attend to. Matters that I would be happy to help with… in my own small way.\n\n[E.C.] I would no sooner seek aid from you than a war beast would from a bog-tick. Do you know how many thieves I've had to excise from my ranks? They debased themselves. Crawling about our proving grounds. Refashioning battle-trash into weapons. All because you tempted them with a flash of Glimmer.\n\n[T.S.] Ha! Me? Tempt them? It's all I can do to keep them from flooding the market.\n\n[E.C.] This is not my first time dealing with war profiteers, insect. Though, if I squash you thoroughly enough, it may be my last.\n\n[T.S.] And here I thought I was doing you a charity, promoting Cabal entrepreneurship. I was told the empire was low on funds.\n\n[E.C.] Is that so?\n\n[T.S.] Your Majesty, I don't know what advice you've been getting from your imperial hangers-on, but—\n\n[A.T.] How dare you—\n\n[E.C.] Quiet.\n\n[T.S.] But things are different here in the Sol system. Smash and conquer—like so many traditions of old Torobatl—won't get you far. Ghaul found that out the hard way. The remnants of his Red Legion have learned to adapt.\n\n[T.S.] Let me know if you'd like to do the same. I'd even go against my own custom and consider a payment plan.\n\n[E.C.] How generous. But it seems I have no need. As you've revealed, I have untapped resources at my disposal.\n\n[T.S.] Whichever ones have survived your purge, yes. But weapons are not my most valuable wares, not by a long shot. If you're anything like your father, you'll be far more interested in the information I have to offer.\n\n[E.C.] Send your coordinates. We can discuss face-to-face. But tread lightly. I've yet to decide whether you're worth my mercy.\n\n[T.S.] Oh, I'm honored to host Her Imperial Highness on my humble Shore. It's no palatial estate, but we insects are just happy to have a place to call home.\n\n[End transmission.]",
                "itemHash": "1097616550",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/fa530f3e219d27e40f203c11dccc1a8d.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Chambered Compensator",
                        "description": "Stable barrel attachment.\n  •  Increases stability\n  •  Moderately controls recoil\n  •  Slightly decreases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0b451cbccc7f11f6aec9c153e59474cb.png",
                        "hashID": 3661387068,
                        "weaponHash": 1097616550,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Extended Mag",
                        "description": "This weapon has a greatly increased magazine size, but reloads much slower.\n  •  Greatly increases magazine size\n  •  Greatly decreases reload speed\n  •  Increases airborne effectiveness",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/66cfea124e24e73cca1ce6370b44ca7e.png",
                        "hashID": 2420895100,
                        "weaponHash": 1097616550,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Firmly Planted",
                        "description": "Increased accuracy, stability, and handling when firing while crouched.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/379796d2e74676d3790f0bd485ea03a9.png",
                        "hashID": 280464955,
                        "weaponHash": 1097616550,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "One for All",
                        "description": "Hitting three separate targets increases damage for a moderate duration.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/b1bce269c3cd21393131b4f5cffae692.png",
                        "hashID": 4049631843,
                        "weaponHash": 1097616550,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Aggressive Frame",
                    "description": "High damage, high recoil.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/64209c4fd20513b33109c374179d0958.png"
                },
                "legendWeaponDamageType": "Kinetic",
                "legendWeaponDamageElement": "Kinetic",
                "masterworkData": {
                    "name": "Stability",
                    "description": "How much or little recoil you will experience while firing the weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/c345c1b985997a4e2730ea3919b45359.jpg",
                    "mwHash": 1590375901
                }
            },
            {
                "name": "Hollow Denial",
                "type": "Legendary Trace Rifle",
                "description": "",
                "lore": "\"Never forget what is taken from you.\"",
                "ExtLore": "Kethiks, the Yet-Proven, had spent three lunar orbits surveying the small village. He was not the first Captain to strike here, but while others had come for killing or labor, his clutch of Vandals came for something else.\n\nA Lightbearer resided in the village—a demon who had killed many of his friends. A demon who had shattered the Captain whose place Kethiks had taken. It was Kethiks's duty to seek revenge, to hunt this demon, and clear the death debt. Those were the words House Devils had sent with Kethiks. \n\nBut to Kethiks, this demon's life paid more than vengeance. Its life paid glory. The same glory Kethiks's father, Ykriis, claimed when he felled a Lightbearer in single combat, took its tiny machine and drank of its divine Ether. Soon that glory would be Kethiks's as well. Soon his position would be recognized for more than its circumstance.\n\nVandals crept on either side of Kethiks, maneuvering through tall grass with quiet anticipation. Where the grass died off to tilled soil and log walls, they paused, waiting for Kethiks's command. He would not launch flares to declare their strike. He would not give the Lightbearer time to plan.\n\nAs the rear-guard Dregs joined the rest of his raiding party, Kethiks ignited an Arc spear and raised it against the night. The signal: attack!\n\nThe raiders descended, expecting a paltry guard. They were soon met by stiff resistance. The Captain tore through to the heart of the village, hunting for the demon who commanded the defense. He spotted the demon in the midst of the fighting. Kethiks strode forward, seizing a defiant Human in his path with his lower arms and flung her through a burning wooden structure.\n\n\"DEMON!\" he shrieked in Eliksni, brandishing his Arc spear.\n\nBefore he could advance, a young Human defiantly stepped between him and the demon and brandished a blade. Kethiks assessed the \"warrior\" and clicked his mandibles in laughter, easily knocking the boy's curved blade aside. The Captain taunted the youth with half-hearted thrusts that threw the small Human off balance. When he was finished toying with his prey, Kethiks drove the spear point through him.\n\nKethiks looked up from the pinned youth to the demon and snarled. His eyes met the demon's crackling own. The Captain raised his spear to charge—",
                "itemHash": "2323544076",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/3dec8ff90780505213e28421c8a52cba.jpg",
                "rarity": "Legendary",
                "class": 3,
                "statRolls": [],
                "weaponPerks": [
                    {
                        "name": "Corkscrew Rifling",
                        "description": "Balanced barrel. \n  •  Slightly increases range and stability\n  •  Slightly increases handling speed",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/7730e1732ed7ef91afce50277639c493.png",
                        "hashID": 4090651448,
                        "weaponHash": 2323544076,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Projection Fuse",
                        "description": "Distance optimizations.\n  •  Increases range",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/eaa6fcec699a88e768782068d5e509e1.png",
                        "hashID": 2969185026,
                        "weaponHash": 2323544076,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Lead from Gold",
                        "description": "Picking up Heavy ammo also grants ammo to this weapon.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/87f6cac4799cbae4e11ba74d3dc77504.png",
                        "hashID": 1556840489,
                        "weaponHash": 2323544076,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Repulsor Brace",
                        "description": "Defeating a Void-debuffed target grants an overshield.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/cfcbde3872d34c5258fd8227640a020e.png",
                        "hashID": 776531651,
                        "weaponHash": 2323544076,
                        "isPerk": true,
                        "isFavorablePerk": false
                    },
                    {
                        "name": "Extrovert",
                        "description": "Final blows while near multiple combatants or near Nightmares restores health.",
                        "perkIcon": "https://www.bungie.net/common/destiny2_content/icons/0e8f9374f41cca37c52fce1695184e18.png",
                        "hashID": 1250481499,
                        "weaponHash": 2323544076,
                        "isPerk": true,
                        "isFavorablePerk": false
                    }
                ],
                "exoticArmorPerk": null,
                "legendWeaponFrame": {
                    "name": "Adaptive Frame",
                    "description": "A well-rounded grip, reliable and sturdy.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/967fb4abc6ab98f74639d6c08e5f56ee.png"
                },
                "legendWeaponDamageType": "Energy",
                "legendWeaponDamageElement": "Void",
                "masterworkData": {
                    "name": "Stability",
                    "description": "How much or little recoil you will experience while firing the weapon.",
                    "icon": "https://www.bungie.net/common/destiny2_content/icons/c345c1b985997a4e2730ea3919b45359.jpg",
                    "mwHash": 1590375901
                }
            }
        ],
        "Warlock": {
            "Helmet": {
                "name": "Simulator Hood",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"Her back is always turned to us. It's almost as if she knows we're watching.\" —RECORD 459-CHASM-1002",
                "ExtLore": null,
                "itemHash": "2538410394",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/0c29992b93d95eaba148009891e71ac5.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    64,
                    2,
                    28,
                    2,
                    10,
                    20,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Simulator Gloves",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"I see a submerged Earth. I see humanity in crude boats, battered, drifting. I see them fight what rises from the deeps. Fight and win.\" —RECORD 463-CHASM-3102",
                "ExtLore": null,
                "itemHash": "480714723",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/9464f040ab8503175350146f0bcd2e75.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    66,
                    17,
                    2,
                    14,
                    2,
                    11,
                    20
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Simulator Robes",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"She just fainted? Didn't say anything? No, 'great wyrm' doesn't mean anything to me.\"  —RECORD 462-CHASM-3103",
                "ExtLore": null,
                "itemHash": "248302381",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/eb5560985f04f515cb2206836ee4fba9.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    67,
                    10,
                    22,
                    2,
                    16,
                    15,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Simulator Legs",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"Many Ghosts, whispering like a stream. I walked among them, listening, but could not understand.\" —RECORD 460-CHASM-1022",
                "ExtLore": null,
                "itemHash": "2401694485",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/7432903c4f1506e8c7dd1a42b789f922.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    63,
                    18,
                    2,
                    10,
                    24,
                    2,
                    7
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Entanglement Bond",
                "type": "Legendary Warlock Bond",
                "description": "",
                "lore": "\"A dazzling flash. Blinding. All-consuming. I saw nothing more.\" —RECORD 460-CHASM-1004",
                "ExtLore": null,
                "itemHash": "2657180960",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/362c587417354f9c4d7b7fa087b2a098.jpg",
                "rarity": "Legendary",
                "class": 2,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Hunter": {
            "Helmet": {
                "name": "Simulator Mask",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"It's not inevitable, is it? What I saw? Please say it's not.\" —RECORD 451-CHASM-7037",
                "ExtLore": null,
                "itemHash": "2915206011",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/366604c8dad9dda3505cd7fe0c4d7677.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    64,
                    2,
                    28,
                    2,
                    23,
                    7,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Simulator Grips",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"Visualization was unexpectedly drawn toward images suggestive of the past. Experiment terminated at lead investigator's frantic demand.\" —RECORD 457-CHASM-7002",
                "ExtLore": null,
                "itemHash": "79417130",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/e8222eca30798ce3dbd60c8ca6c3a8cc.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    67,
                    7,
                    2,
                    24,
                    12,
                    20,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Simulator Vest",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"Flames. Ice. Floods. Whirlwinds. Earthquakes. Eruptions. Destruction and despair.\" —RECORD 458-CHASM-7121",
                "ExtLore": null,
                "itemHash": "1512311134",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/2387f01de6e2050730a6c1a4e5694511.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    63,
                    2,
                    18,
                    12,
                    10,
                    11,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Simulator Boots",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"I saw her! I saw her! No, send me back, I saw her!\" —RECORD 453-CHASM-7377",
                "ExtLore": null,
                "itemHash": "3030715588",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/0318b0bc718010ecd4dd785a297b991b.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    60,
                    10,
                    2,
                    18,
                    6,
                    14,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Entanglement Cloak",
                "type": "Legendary Hunter Cloak",
                "description": "",
                "lore": "\"I see six armies, locked in battle, across far systems. Now I see four armies. And now I see one.\" —RECORD 579-CHASM-3360",
                "ExtLore": null,
                "itemHash": "883514983",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/79f8269c42c00762bf32aee830f1ac04.jpg",
                "rarity": "Legendary",
                "class": 1,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        },
        "Titan": {
            "Helmet": {
                "name": "Simulator Helm",
                "type": "Legendary Helmet",
                "description": "",
                "lore": "\"The face of war continues to change. In this timeline, Cabal. In another, Vex. And in this other one—we have no name for what we saw.\" —RECORD 614-CHASM-8299",
                "ExtLore": null,
                "itemHash": "1607585295",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/c94c5907c1c37a3bf92a87265326999a.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    64,
                    12,
                    14,
                    6,
                    20,
                    2,
                    10
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Arms": {
                "name": "Simulator Gauntlets",
                "type": "Legendary Gauntlets",
                "description": "",
                "lore": "\"As in the other timelines we examined, where the simulation includes our intervention, the City survives. Where it does not, well...\" —RECORD 116-CHASM-0064",
                "ExtLore": null,
                "itemHash": "3762717334",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/dea850b01656e0600288e26b7ca542bf.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    65,
                    6,
                    20,
                    7,
                    14,
                    16,
                    2
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Chest": {
                "name": "Simulator Plate",
                "type": "Legendary Chest Armor",
                "description": "",
                "lore": "\"In this vision we are victorious. In this vision also. And this one. And this.\" —RECORD 115-CHASM-8991",
                "ExtLore": null,
                "itemHash": "2005525978",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/6ac2eefcd68767b4ef304bf6f37059cb.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    66,
                    22,
                    10,
                    2,
                    12,
                    6,
                    14
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Legs": {
                "name": "Simulator Greaves",
                "type": "Legendary Leg Armor",
                "description": "",
                "lore": "\"I see the City, ruined and abandoned. I see no Traveler in the sky. The war is elsewhere. Let us find it.\" —RECORD 615-CHASM-2110",
                "ExtLore": null,
                "itemHash": "680132464",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/9550e93978d788b76c492f17448f01ec.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    65,
                    22,
                    2,
                    10,
                    15,
                    2,
                    14
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            },
            "Class Item": {
                "name": "Entanglement Mark",
                "type": "Legendary Titan Mark",
                "description": "",
                "lore": "\"A hand, lying on the grass, in one future. A head in another. Components scattered across six visions. All identifiable. I agree. We cannot tell her. Take this off the—\" —RECORD 784-CHASM-1016",
                "ExtLore": null,
                "itemHash": "1653979435",
                "itemRating": null,
                "icon": "https://www.bungie.net/common/destiny2_content/icons/386b603c3372d745a26f1cf8d18eaa58.jpg",
                "rarity": "Legendary",
                "class": 0,
                "statRolls": [
                    0,
                    0,
                    0,
                    0,
                    0,
                    0,
                    0
                ],
                "weaponPerks": [],
                "exoticArmorPerk": null,
                "legendWeaponFrame": null,
                "legendWeaponDamageType": null,
                "legendWeaponDamageElement": null,
                "masterworkData": null
            }
        }
    }
}